[{"id":"armidale-2022.md","slug":"index.html","base":"/armidale-2022/","collection":"trip","body":"Lyn used to study in the University of New England at Armidale and we have visited it in the 1990s, but since then we have not come back. Post COVID-19 lockdown, we thought it is a great opportunity to come back to this place and see what has changed.\n\nWe also visited various other places, including Copeton Dam and a few other dams (Split Rock, Dumaresq and Chaffey), as well as nearby towns Barraba and Uralla. We also visited Tamworth, the country music festival town.\n\nWe explored Waterfall Way, and saw Gara Gorge, Wollomombi Falls, Bakers Creek Falls, Dangar Gorge and the very picturesque Gostwyck Chapel.\n\nFinally, we spent a morning at the University of New England campus for nostalgia's sake.\n\n| Day | Date | Itinerary |\n| ---: | :---- | :--------- |\n| 1 | Thu 24 February | Lake Liddell, Tamworth |\n| 2 | Fri 25 February | Copeton Dam, Barraba, Split Rock Dam, Tamworth |\n| 3 | Sat 26 February | Gara Gorge, Bakers Creek Falls, Wollomombi Falls |\n| 4 | Sun 27 February | UNE, Armidale Heritage Walk and Drive |\n| 5 | Mon 28 February | Gara Gorge, Dangar Gorge, Gostwyck Chapel |\n| 6 | Tue 1 March | Dumaresq Dam, Uralla, Chaffey Dam |\n","trip":"Armidale 2022","place":"Australia","timezone":"Australia/NSW","location":"Armidale","title":"Armidale 2022","description":"We have not visited New England for over 20 years, so it was time to go back for a waterfall and nostalgia trip.","date":"2022-03-01T07:00:00.000Z","image":{"src":"/armidale-2022/_astro/trip.26fbfdda.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1},"tags":["New England","Armidale","Tamworth","Copeton Dam","Barraba","Split Rock Dam","Waterfall Way","Gara Gorge","Wollomombi Falls","Bakers Creek Falls","University of New England","Dangar Gorge","Gostwyck Chapel","Dumaresq Dam","Uralla","Chaffey Dam"]},{"id":"1-lake-liddell.md","slug":"1-lake-liddell","base":"/armidale-2022/","collection":"post","body":"We drove off in the morning, and was pleasantly surprised that in the intervening years, the Hunter Expressway (the largest single road investment in the history of New South Wales) is finally finished (it opened in March 2014). This expressway is a 40 km dual carriageway connecting the F3 Freeway to the New England Highway west of Branxton.\n\nWe stopped by at Singleton for lunch at Hungry Jacks, and reached Muswellbrook earlier than expected in the afternoon. It was too early for dinner for we decided to stop by and visit the Liddell and Bayswater power stations.\n\nLiddell Power Station is a coal-fired thermal power station that is expected to close sometime in 2023 [Update, decommissioned on 28 April 2023].\n\nLiddell Power Station has had an interesting history. Built as part of a pair of power stations in the Musswellbrook region in New South Wales (the other being the Bayswater Power Station), Liddell Power Station Liddell was the most powerful generating station in Australia t the time of its completion in the early 1970s. Liddell was the first major power station in New South Wales to be built inland, using fresh water for cooling instead of the more abundant salt water used in coastal power stations.\n\nIt is currently owned by AGL Energy and has been estimated to emit 14.70 million tonnes of greenhouse gases each year as a result of burning coal. In order to help combat climate change, AGL has announced it intends to close the station and replace it with a big battery and current plans are for this to happen by April 2023.\n\nLake Liddell is an artificial lake created to supply cooling water to the power station, and has been closed to the public because of brain eating amoeba.\n\nI flirted with Russ, a local resident of the campground, who works as a miner. He tells me the Liddell power station is really pretty at night with the lights shining from across the lake.\n\nWhen we were there, we also noticed a train carrying coal going across the tracks.\n\nThe nearby Bayswater Power Station is also a coal-powered thermal power station and is still operating.\n","trip":"Armidale 2022","place":"Australia","timezone":"Australia/NSW","location":"Liddell Power Station","title":"Day 1: Lake Liddell","description":"We visited Liddell and Bayswater power stations on the drive up to Armidale.","date":"2022-02-24T03:00:00.000Z","image":{"src":"/armidale-2022/_astro/Lake Liddell (1).69af5eec.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[-32.3718,150.9565,13],"tags":["Liddell Power Station","Lake Liddell"]},{"id":"1-oxley-lookout.md","slug":"1-oxley-lookout","base":"/armidale-2022/","collection":"post","body":"Oxley Scenic Lookout is a highlight of any visit to Tamworth. We followed Tamworth’s jacaranda-lined White St to the very top, and reached this viewpoint. The lookout, originally Oxley Park, is named in honour of John Oxley, Surveyor General and explorer, who passed through the Tamworth area in 1818.\n\nThe views are almost 180 degrees and stretch for kilometres into the distance providing incredible views of both the city and Peel River Valley.\n\nThe Lookout is surrounded by natural bushland and is the base camp for the Kamilaroi Walking Track, which winds its way through the bushland of Oxley Park linking the Botanic Garden, Marsupial Park, Oxley Lookout and Flagstaff Mountain over a distance of several kilometres.\n","trip":"Armidale 2022","place":"Australia","timezone":"Australia/NSW","location":"Oxley Lookout","title":"Day 1: Tamworth (Oxley Lookout)","description":"We stopped briefly at this scenic lookout that gives a good overview of Tamworth.","date":"2022-02-24T05:00:00.000Z","image":{"src":"/armidale-2022/_astro/Oxley Lookout (3).985f1b91.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[-31.08342,150.94674,17],"tags":["Tamworth","Oxley Lookout"]},{"id":"1-rydges.md","slug":"1-rydges","base":"/armidale-2022/","collection":"post","body":"[Rydges Armidale](https://www.rydges.com/accommodation/regional-nsw/armidale/) is Armidale’s premier 4.5 star hotel, offering stylish accommodation, warm professional service and delicious cuisine at Azka Restaurant or Wine & Tapas Bar.\n\nWe decided to have a lavish dinner at the Azka restaurant. I had the beef ribs, and Lyn had the salmon. After that, we had sticky date pudding for dessert.\n\nFelt like a whale afterwards. Sorry for the bad photos, these are all taken on my ancient iPhone.\n","trip":"Armidale 2022","place":"Australia","timezone":"Australia/NSW","location":"Rydges","title":"Day 1: Armidale (Rydges)","description":"We finally arrived at Armidale late in the afternoon and checked in to the hotel.","date":"2022-02-24T07:00:00.000Z","image":{"src":"/armidale-2022/_astro/Powerhouse by Rydges.782a5715.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1},"map":[-30.50612,151.67253,19],"tags":["Armidale","Rydges","hotel","dinner"]},{"id":"1-the-big-guitar.md","slug":"1-the-big-guitar","base":"/armidale-2022/","collection":"post","body":"Located 405km north-west of Sydney, 280km from Newcastle and 570km south of Brisbane, Tamworth is easy to get to regardless of whether you’re driving, or sitting back to let someone else do the hard work on a plane, bus or train.\n\nHome to the Kamilaroi/Gamilaroi/Gomeroi people for thousands of years, [Tamworth](https://www.destinationtamworth.com.au/) is a regional city perhaps best known as the Country Music Capital, home to the Big Golden Guitar, and Mecca to fans of the annual Tamworth Country Music Festival.\n\nWelcoming travellers on the New England Highway’s southern approach to Tamworth, the Big Golden Guitar – at 12 metres tall and weighing half a tonne – is an Australian icon, one of the region’s most recognised attractions.\n\nIts location as part of the Tamworth Visitor Information Centre complex (which includes a souvenir shop, National Guitar Museum, Country Music Wax Museum and Golden Guitar Café) makes the Big Golden Guitar the perfect stop-off on our way through.\n\nThe Big Golden Guitar was officially opened by the legend Slim Dusty and Mr Paul Crombie (General Manager of Tourism NSW) on 25 January, 1988. Made of fibreglass over a steel frame, it is a replica of the award presented to artists at the Country Music Awards of Australia, the Golden Guitar Awards (which are held annually during the Tamworth Country Music Festival). That’s why it has no strings!\n","trip":"Armidale 2022","place":"Australia","timezone":"Australia/NSW","location":"Big Golden Guitar","title":"Day 1: Tamworth (Big Golden Guitar)","description":"We stopped by at Tamworth in the afternoon and took photos at The Big Golden Guitar.","date":"2022-02-24T04:00:00.000Z","image":{"src":"/armidale-2022/_astro/The Big Guitar (2).42d523e4.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1},"map":[-31.12757,150.92362,19],"tags":["Tamworth","The Big Guitar"]},{"id":"2-barraba-silo-art.md","slug":"2-barraba-silo-art","base":"/armidale-2022/","collection":"post","body":"[‘The Water Diviner’](https://www.australiansiloarttrail.com/barraba) by artist Fintan Magee was unveiled in April 2019 and has received worldwide notoriety.\n\nThe Barraba Silos are privately owned by Simon and Amanda Koopman and are located at the southern entrance to town on Manilla Road.\n\nTo refine the theme for this mural, Fintan visited Barraba in early 2019 to inspect the site and to meet with the local community. After speaking to the locals he gained an understanding of the local area. He listened to their stories and the concept for the mural was conceived.\n\nIn 2019, NSW continued to be in the grip of one of the worst droughts Australia has ever faced, with over 90% of the state in drought. Large areas of NSW were facing severe water shortages, with supply being limited to critical water needs only.\n\nThis mural depicts a local water diviner searching for groundwater, using a y-shaped twig or rod or two L-shaped ones. Diviners study the landscape of a farm and walk over areas where they suspect the water may be located. Ground minerals and magnetic forces force the sticks to cross or be pushed downwards when water is located. Despite many studies claiming the technique is pseudo-science, diviners continue to be used throughout Australia as a way of finding groundwater.\n\nWork began on the silos on the 25 March 2019 and they were completed just 24 days later on the 19 of April. The Barraba Silos are officially the 28th silos to be included in the [Australian Silo Art Trail](https://www.australiansiloarttrail.com/) Collection.\n","trip":"Armidale 2022","place":"Australia","timezone":"Australia/NSW","location":"Barraba Silo Art","title":"Day 2: Barraba Silo Art","description":"On the outskirts of Barraba is a stunning example of silo art.","date":"2022-02-25T03:00:00.000Z","image":{"src":"/armidale-2022/_astro/Barraba Silo Art (3).bca6b983.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[-30.39917,150.61413,17],"tags":["Barraba"]},{"id":"2-barraba-town.md","slug":"2-barraba-town","base":"/armidale-2022/","collection":"post","body":"[Barraba](https://www.visitnsw.com/destinations/country-nsw/tamworth-area/barraba) is a little country town surrounded by the Nandewar Ranges and the Horton Valley, tucked into a bend of the Manilla River. The town was established in the late 1800s on the back of grazing and the gold rush, named for the Kamilaroi word meaning “camping place on the edge of a river”.\n\nWith its tree-lined streets, heritage buildings and old fashioned shop fronts, Barraba is a delightful historic mining town. We liked the mix of colonial and art deco architecture on Queen Street.\n\nWe walked around and visited the clock tower, Art Deco playhouse, and various turn of the century buildings. It also has many interesting shop window displays as the Barraba show is on in Friday.\n\nI always find small town residents to be ever so polite and friendly. One woman noticed me peering at the dresses in the frock shop and thought I wanted to buy one. She told me the shop is closed because the proprietor's mother had just died, but if I knocked on the door, the proprietor will probably open it for me. I said thanks, but I am okay.\n","trip":"Armidale 2022","place":"Australia","timezone":"Australia/NSW","location":"Barraba","title":"Day 2: Barraba","description":"After Copeton Dam, we drove south to visit the small town of Barraba.","date":"2022-02-25T02:00:00.000Z","image":{"src":"/armidale-2022/_astro/Barraba (5).ebc2af18.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1},"map":[-30.3797,150.6002,15],"tags":["Barraba"]},{"id":"2-bicentennial-park.md","slug":"2-bicentennial-park","base":"/armidale-2022/","collection":"post","body":"Tamworth Regional Playground and the adjoining Bicentennial Park forms a green stretch just south of Tamworth central business district and follows the bank of the Peel River.\n\nThere is a playground for the young kids, as well as plenty of open space for them to run around. There are also several sporting fields and a swimming pool in the area.\n\n![Tamworth Regional Playground](../../assets/gallery/2-bicentennial-park/Tamworth_Regional_Playground.jpeg)\n\nNear the duck pond there is a statue celebrating the Australian horses that went to the early wars we were involved in, but never returned. There is also some other war memorials in the park.\n\nLocated at the entrance to Bicentennial Park is Pioneer's Parade, a row of busts featuring some of Australia’s best loved music legends.\n\nThe first unveiling in January 1991 was a privately funded bust honouring Buddy Williams, followed just six months later by a likeness of Tex Morton.\n\nSince then, industry legends including  Barry Thornton, Stan Coster, Reg Lindsay, Jimmy Little, Shirley Thoms and Chad Morgan have been commemorated here. A bust of Frank Ifield was installed in January, 2019, and fundraising is underway for the next installation – Brian Young OAM by sculptor Peter Latona.\n\nThere is a row of Busts of some of the stars that are jamming away in Country music heaven, as well as a stage for the up and coming stars.\n","trip":"Armidale 2022","place":"Australia","timezone":"Australia/NSW","location":"Bicentennial Park","title":"Day 2: Tamworth (Bicentennial Park)","description":"After dinner, we walked around the Bicentennial Park and admired the busts of famous country musicians.","date":"2022-02-25T06:00:00.000Z","image":{"src":"/armidale-2022/_astro/Tamworth Bicentennial Park (1).39f6c4ef.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1},"map":[-31.09431,150.93037,17],"tags":["Tamworth","Bicentennial Park","Pioneers Parade"]},{"id":"2-copeton-dam.md","slug":"2-copeton-dam","base":"/armidale-2022/","collection":"post","body":"[Copeton Dam](https://www.waternsw.com.au/nsw-dams/regional-nsw-dams/copeton-dam) is situated on the Gwydir River about 60 kilometres upstream of Bingara and 35 kilometres south-west of Inverell on the north west slopes of the NSW Northern Tablelands. The dam is about 570 kilometres north of Sydney.\n\nThe dam is one of the largest inland dams in NSW, and is said to be almost three times the size of Sydney Harbour. It was spilling up to 10,000 megaliters per day for the first time in almost a decade.\n\nWhen we reached it, it looked full but it was not spilling. We drove across the dam wall for amazing views of the lake and mountains.\n\nIt is a clay core and rock fill embankment dam with nine radial gates and a gated concrete chute spillway.\n","trip":"Armidale 2022","place":"Australia","timezone":"Australia/NSW","location":"Copeton Dam","title":"Day 2: Copeton Dam","description":"One of the largest inland dams in NSW.","date":"2022-02-24T23:00:00.000Z","image":{"src":"/armidale-2022/_astro/Copeton Dam (27).42ba6c5c.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[-29.90435,150.91826,17],"tags":["Copeton Dam","dam"]},{"id":"2-split-rock-dam.md","slug":"2-split-rock-dam","base":"/armidale-2022/","collection":"post","body":"[Split Rock Dam](https://www.waternsw.com.au/nsw-dams/regional-nsw-dams/split-rock-dam) is situated on the Manilla River about 28 kilometres upstream of Manilla and 70 kilometres north-west of Tamworth on the NSW North West Slopes. The dam is about 500 kilometres north-west of Sydney.\n\nWhen we visited, access to the dam wall was restricted for safety reasons due to the recent rain and falling rocks. We were only able to admire the dam from the lookout point.\n","trip":"Armidale 2022","place":"Australia","timezone":"Australia/NSW","location":"Split Rock Dam","title":"Day 2: Split Rock Dam","description":"This is a small dam located just south of Barraba.","date":"2022-02-25T04:00:00.000Z","image":{"src":"/armidale-2022/_astro/Split Rock Dam (2).1af372f9.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[-30.5638,150.6762,16],"tags":["Split Rock Dam","dam"]},{"id":"2-taco-bell.md","slug":"2-taco-bell","base":"/armidale-2022/","collection":"post","body":"Can you believe I have never been to [Taco Bell](https://tacobell.com.au/) before, not here, not in the US? The food wasn't too bad.\n\nTaco Bell originated in California, United States of America. It was founded by Glen Bell, and he opened the first Taco Bell restaurant back in 1962 in Downey, California. Before Taco Bell, he originally owned and operated a hamburger stand called Bell’s Hamburgers in California, built in 1948 on the border of San Bernardino and the city of Colton. Glen opened his first taco stand, Taco Tia in 1954, selling tacos for nineteen cents (AUD$2.17 value today).\n","trip":"Armidale 2022","place":"Australia","timezone":"Australia/NSW","location":"Taco Bell","title":"Day 2: Taco Bell","description":"We drove back to Tamworth for an early dinner at Taco Bell.","date":"2022-02-25T05:00:00.000Z","image":{"src":"/armidale-2022/_astro/Taco Bell (2).e9ec2c0e.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1},"map":[-31.096,150.9363,16],"tags":["Tamworth","Taco Bell","dinner"]},{"id":"3-bakers-creek-falls.md","slug":"3-bakers-creek-falls","base":"/armidale-2022/","collection":"post","body":"We had problems finding the falls as we missed the turnoff and came back via the back way. The correct way is via Old Hillgrove Rd.\n\nOnce we found the picnic area and toilets, a short walk took us to a viewing platform of the falls. Bakers Falls can be seen in the distance from the viewing platform. There is no formal walking track to get a closer view to Bakers Falls, just bush bashing if you had any hopes of reaching it. The falls can often be very dry so it's recommended viewing them after heavy rain for a more magnificent view. Luckily today the falls are quite spectacular due to recent rain.\n\nThe views of the valley and grotto below are also amazing. Limestone surrounds the area, as well as sand stone and granite that are hidden among the trees and bushes of the valley.\n","trip":"Armidale 2022","place":"Australia","timezone":"Australia/NSW","location":"Bakers Creek Falls","title":"Day 3: Bakers Creek Falls","description":"We stopped along the Waterfall Way to view this spectacular falls into a gorge.","date":"2022-02-26T00:00:00.000Z","image":{"src":"/armidale-2022/_astro/Bakers Creek Falls (4).876e93be.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[-30.54367,151.89097,17],"tags":["Waterfall Way","Bakers Creek Falls"]},{"id":"3-gara-gorge.md","slug":"3-gara-gorge","base":"/armidale-2022/","collection":"post","body":"Today we decided to explore the  185km Waterfall Way scenic drive which links Coffs harbour and Armidale, passing rainforest, river valleys and waterfalls, including New England and Dorrigo national parks.\n\nFirst stop is [Gara Gorge](https://www.nationalparks.nsw.gov.au/things-to-do/lookouts/gara-gorge-lookout). \n\nWe drove to the Threlfall picnic area, which is just off Waterfall Way near Armidale and on the northern edge of Oxley Wild Rivers National Park.\n\nAs the grounds were quite wet from recent rain (in fact it was drizzling whilst we were there), we just did a short loop around the picnic area and the nearby Blue Hole. We explored the remains of the old dam at Gara Gorge and the Blue Hole.\n\nNormally, the Gara river is quiet and calm, but after the recent rains it has become a raging rapid! We also saw some classic New England granite boulders here and beautiful wildflowers.\n","trip":"Armidale 2022","place":"Australia","timezone":"Australia/NSW","location":"Threlfall picnic area","title":"Day 3: Gara Gorge","description":"Gara Gorge is the first stop on our exploration of Waterfall Way.","date":"2022-02-25T23:00:00.000Z","image":{"src":"/armidale-2022/_astro/Gara Gorge (22).77b30f65.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1},"map":[-30.6009,151.7985,16],"tags":["Waterfall Way","Gara Gorge"]},{"id":"3-hao.md","slug":"3-hao","base":"/armidale-2022/","collection":"post","body":"After Wollombi Falls, it started to rain quite heavily, so decided not to stop anymore and just drove the remainder of Waterfall Way to Ebor, then returned via an alternate route (Guyra Rd), and then cut back to Armidale via Rockdale Rd. The road was unsealed all the way, and it was quite an adventure following it, and we were glad when we started seeing signs of civilisation once more.\n\nAfter that, we decided to have dinner at [Hao Sushi & Grill](https://www.haosushiandgrill.com/), located next to the Wicklow Hotel. We ordered chicken teriyaki and an unagi bento box. I was very surprised when the bento box arrived with no unagi in it! Fortunately, I managed to get another bowl with unagi. We also ordered some salmon sushi as entree.\n\nLyn ordered Chicken Teriyaki. I later noticed their rolls were really nice.\n","trip":"Armidale 2022","place":"Australia","timezone":"Australia/NSW","location":"Hao","title":"Day 3: Armidale (Dinner at Hao)","description":"We arrived back to Armidale in the evening and decided to have dinner at a Japanese restaurant.","date":"2022-02-26T07:00:00.000Z","image":{"src":"/armidale-2022/_astro/Hao.67101d22.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1},"map":[-30.51203,151.66995,19],"tags":["Armidale","Hao","dinner"]},{"id":"3-wollomombi-falls.md","slug":"3-wollomombi-falls","base":"/armidale-2022/","collection":"post","body":"Wollomombi Falls is a plunge waterfall on the Wollomombi River in the Oxley Wild Rivers National Park. It is  approximately 1.45 kilometres (0.90 mi) off the Waterfall Way, on top of the Wollomombi Gorge near the confluence of the Wollomombi River with the Chandler River. Nearby is the Chandler Falls on the Chandler River. The falls descend from an elevation of 907 metres (2,976 ft) above sea level (AHD) in one drop of 100 metres (330 ft), with a total descent that ranges in height between 150–230 metres (490–750 ft) depending on the flow of the river. It is the highest waterfall in NSW and the second highest in Australia.\n\nThe [Wollomombi Main Falls lookout](https://www.nationalparks.nsw.gov.au/things-to-do/lookouts/wollomombi-main-falls-lookout) is a 200m walk from Wollomombi Falls picnic area. After passing through towering stringybark and blackbutt forest, we reached the large viewing platform of Wollomombi Main Falls lookout. From here we enjoyed sweeping vistas across a rugged and beautiful landscape.\n\nAfter that, we went on the [Chandler walking track](https://www.nationalparks.nsw.gov.au/things-to-do/walking-tracks/chandler-walking-track) from the Wollomombi Falls picnic area. The track doesn’t lead to Chandler River anymore, due to erosion, however the brilliant views from Checks lookout are not to be missed.\n\nFrom Wollomombi lookout, we gazed across the spectacular waterfall where water plunges dramatically into the ravine below. From here, the track leads through woodlands of stringybarks and blackbutts. Another lookout allowed us to gaze across the maze of gorges and valleys.\n\nThe falls were looking better than any tourist brochure due to the heavy rain. This is what I imagined Rivendell would look like! We walked all the way around the rim, down to Chandler river, crossed a partially collapsed bridge (It was an Indiana Jones moment) to the top of both falls.\n\nIt was drizzling when we started but the rain settled into a solid pour. We were actually above the cloud level so it was strange to walk in the cloud. I have a picture of myself soaking wet at the top of Chandler Falls to prove we did it!","trip":"Armidale 2022","place":"Australia","timezone":"Australia/NSW","location":"Wollomombi Falls","title":"Day 3: Wollomombi Falls","description":"We stopped along the Waterfall Way to view this spectacular falls (highest in NSW) into a gorge.","date":"2022-02-26T03:00:00.000Z","image":{"src":"/armidale-2022/_astro/Wollomombi Falls.18cc9fbd.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1},"map":[-30.476,152.2918,16],"tags":["Waterfall Way","Wollomombi Falls"]},{"id":"4-heritage-drive.md","slug":"4-heritage-drive","base":"/armidale-2022/","collection":"post","body":"This is the companion to the heritage walk.\n\nWe did not stop at all the locations listed in the guide, but the key ones are:\n\n- St Mary's Anglican Church\n  ![St Mary's Anglican Church](../../assets/gallery/4-heritage-drive/St_Marys_Anglican_Church,_West_Armidale_1.jpeg)\n- Johnson and Kennedy Service Station\n  ![Johnson and Kennedy Service Station](../../assets/gallery/4-heritage-drive/Johnson_Kennedy_Service_Station.jpeg)\n- Armidale Train Station\n  ![Armidale Train Station](../../assets/gallery/4-heritage-drive/Armidale_Railway_Station.jpeg)\n- Crossword Cafe\n  ![Crossword Cafe](../../assets/gallery/4-heritage-drive/Crossword_Cafe_1.jpeg)\n- Railway Hotel\n  ![Railway Hotel](../../assets/gallery/4-heritage-drive/Railway_Hotel.jpeg)\n- Armidale Cemetery\n  ![Armidale Cemetery](../../assets/gallery/4-heritage-drive/Armidale_Cemetery.jpeg)\n- St. Patrick's Orphanage\n  ![St. Patrick's Orphanage](../../assets/gallery/4-heritage-drive/St_Patricks_Orphanage.jpeg)\n- Apex and Drummond Lookout\n  ![Apex and Drummond Lookout](../../assets/gallery/4-heritage-drive/Apex_and_Drummond_Lookout_6.jpeg)\n- O'Connor Catholic College\n  ![O'Connor Catholic College](../../assets/gallery/4-heritage-drive/OConnor_Catholic_College_4.jpeg)\n- The Armidale School\n  ![The Armidale School](../../assets/gallery/4-heritage-drive/The_Armidale_School_3.jpeg)\n\nArmidale was ofﬁcially declared a town in 1846. A few years later, the arrival of the railway and discovery of gold at Rocky River and Hillgrove heralded a population and building boom. Valuable minerals and metals, including tin, were discovered at other sites around the region and hundreds of Chinese joined the workforce, adding another dimension to the cultural mix.\n\nBack in the old days, bushrangers were notorious for disrupting the bucolic pastoral scene. The antics of Frederick Ward (alias, Captain Thunderbolt), for instance, are legendary here. Ward’s stellar career in highway robbery came to an end when he was shot by police at Kentucky Creek in 1870. Or was he? Controversy about who was actually killed on that day has been hotly debated ever since. On display at McCrossin’s Mill Museum in Uralla (a fine example of a late-19th century commercial building) is a fascinating collection of Thunderbolt memorabilia and displays that reveal stories about the area’s gold mining heyday and wool industry history. Thunderbolts Cave is just south of Guyra off the New England Highway.\n\nIt was a prosperous few decades and Armidale’s heritage architecture, in particular, reﬂects the grand ambitions of those late 19th-century settlers. The Anglican and Catholic cathedrals were among the earliest buildings to grace the centre of town, along with the stately post ofﬁce, state bank and courthouse, all still in use today.\n","trip":"Armidale 2022","place":"Australia","timezone":"Australia/NSW","location":"Armidale","title":"Day 4: Armidale (Heritage Drive)","description":"After the heritage walk, we went on a heritage drive.","date":"2022-02-27T05:00:00.000Z","image":{"src":"/armidale-2022/_astro/trip.26fbfdda.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1},"map":[-30.5139,151.6681,16],"tags":["Armidale","drive","historic"]},{"id":"4-heritage-walk.md","slug":"4-heritage-walk","base":"/armidale-2022/","collection":"post","body":"## Baptist Church\n\n![Baptist Church](../../assets/gallery/4-heritage-walk/Armidale_District_Baptist_Church_1.jpeg)\n\nThe commercial traveller and evangelist, Thomas Llewellyn, organised construction of the first Baptist Church in Armidale on the\ncorner of Brown and Allingham Streets. In 1918, Frank Nott constructed the present church in Gothic Revival style. The\ncontrasting brickwork is similar to that used in the old Express Building and Masonic Centre in Faulkner Street.\n\n## St Mary's Primary School\n\n![St Mary's Primary School](../../assets/gallery/4-heritage-walk/St_Marys_Catholic_Primary_School_1.jpeg)\n\nThe Ursuline nuns who arrived in Australia in 1882 began teaching at St Mary's in 1883. The school had originally been founded\nas a parochial school in 1862.\n\n## Ursuline Convent\n\n![Ursuline Convent](../../assets/gallery/4-heritage-walk/Ursuline_Convent.jpeg)\n\nThis impressive building was built for Armidale investor, Peter Speare, in 1877 and sold to the Ursuline Sisters in 1882. G.F.Nott\nextended the house during the period 1901 to 1902 and the front verandah and bay window areas were added in 1922. The\nlarge convent building facing Barney Street was constructed in 1889 and the chapel on the corner of Barney and Jessie Streets\nwas completed in 1928.\n\n## Smith House and Southall\n\n![Smith House and Southall](../../assets/gallery/4-heritage-walk/Smith_House_2.jpeg)\n\nS.H. Smith House, or \"The Girrawheen Boarding Establishment\" as it was then known, was constructed in 1889 as a new school,\nNew England Ladies College, which closed in 1904. In 1928 the house was purchased by the Armidale Teacher's College and\nextensively remodelled. The building features Flemish bond brickwork and the broken pediment (a form of gable) overhead\ntestifies to its Victorian origins. In 1960, \"Southall\", a two-storeyed Victorian building constructed in 1886, was incorporated into\nSmith House with verandah extensions joining the two buildings. \"Southall\" features lace verandahs, chimney pots, cedar mantle-\npieces, doors and staircase. Smith House is now privately owned and operating as long-term student accommodation.\n\n## Central Park\n\n![Central Park](../../assets/gallery/4-heritage-walk/Central_Park_7.jpeg)\n\nCentral Park was dedicated as a reserve in February 1874 as a result of the work of Brother Francis Gatti who transformed the\narea into a popular recreational site close to the centre of town. The first memorial erected in the park commemorates the Irish\nborn doctor, William Murray (1848-1897), who became Armidale's Mayor in 1893. The band rotunda is a memorial to those\nAustralians who served in the Boer War. It was unveiled on St Patrick's Day, 17 March 1902. The memorial fountain is a\nmonument to 762 people, including 11 local nurses who served in Belgium, Gallipoli, Egypt, Palestine, Mesopotamia, Rabaul and\nFrance during World War 1. The avenue of trees, planted in 1956 along Tingcombe Street, marks 100 years of government service\nin New South Wales. The HMAS Armidale memorial commemorates the sinking of the Corvette HMAS Armidale in the Timor Sea\nin 1942.\n\n## Town Hall\n\n![Town Hall](../../assets/gallery/4-heritage-walk/Armidale_Town_Hall.jpeg)\n\nThe Town Hall was completed in 1883 and was constructed in a style popular in provincial centres around the 1880s and 1890s.\nThe building features High Victorian architecture with decorative scrolls, pilasters (rectangular columns), frieze work and a\ndominating pediment (a form of gable). In 1990, the Armidale City Council renovated the interior to an Art Deco style.\n\n## Folk Museum\n\n![Folk Museum](../../assets/gallery/4-heritage-walk/Armidale_Folk_Museum_2.jpeg)\n\nThe Folk Museum, which was officially opened in November 1958, is housed in\na stuccoed brick Victorian building with cast iron veranda. Originally\nconstructed as a School of Arts and Mechanics Institute in 1863, the building\nhas also been used as a literary institute and municipal library. Last modified\nin1915.\n\n## Diocesan Registry\n\n![Diocesan Registry](../../assets/gallery/4-heritage-walk/Diocesan_Registry.jpeg)\n\nThe Diocesan Registry was built in 1824. Its contrasting coloured brick is similar to that used in the Baptist Church on the corner\nof Rusden and Jessie Streets.\n\n## Lindsay House\n\n![Lindsay House](../../assets/gallery/4-heritage-walk/Lindsay_House_1.jpeg)\n\nThis brick house was constructed in the early 1920s for Dr Walter E. Harris. The main entrance door facing Barney Street features\na leadlight design and bay window on either side. The top storey and chimneys were stuccoed in later alterations while the\nverandah, once semi-circular, was rebuilt in its present form. In 1972, the former Armidale College of Advanced Education\npurchased the building and named it “Lindsay House” in honour of the former Warden, Miss E. Dulce Lindsay.\n\n## Masonic Centre\n\n![Masonic Centre](../../assets/gallery/4-heritage-walk/Masonic_Centre.jpeg)\n\nThe Masonic Lodge in Armidale was formed and a hall constructed on this site in 1860. Armidale builder, George Frederick Nott,\nbuilt the Masonic Temple in its severe classical style in 1924. The building features a distinctive leadlight gallery. The Armidale\nMasonic Lodge has since purchased land in north-east Armidale and constructed a new building and retirement village.\n\n## Solomon’s Cottage (139 Faulkner Street)\n\n![Solomon’s Cottage](../../assets/gallery/4-heritage-walk/Solomons_Cottage_2.jpeg)\n\nThis cottage was built in 1863 by Armidale builder, Edward Grover. After ownership by various businessmen, Henry Solomon, who\nestablished a photographic studio in the city on 26 July 1880, purchased the cottage in the 1880s. The cottage has remained in\nthe hands of the Solomon family since that date. The Georgian style cottage has been constructed in English bond brickwork and\nfeatures a bull-nose front verandah. The original cedar doors and windows have since been replaced.\n\n## St Paul’s Presbyterian Church\n\n![St Paul’s Presbyterian Church](../../assets/gallery/4-heritage-walk/St_Pauls_Presbyterian_Church_3.jpeg)\n\nThe Presbyterian Church foundation stone was laid on 11 February 1881. In common with many buildings of this period, the\nfoundation stone was laid over copies of contemporary newspapers, coins and a detailed document of the proceedings. With its\ntall steeple, wrought iron decorations, lancet windows and rose window, the building is a typical example of a Gothic revival\nchurch. The first services commenced at St Paul’s on 30 April 1882.\n\n## Armidale Uniting Church\n\n![Armidale Uniting Church](../../assets/gallery/4-heritage-walk/Armidale_Uniting_Church_2.jpeg)\n\nThe first Wesleyan Church in Armidale was opened on 10 July 1864 under the instruction of Rev. Richard Watson Orton. The\nUniting Church now uses this building as a community hall. Its cedar fittings and coloured glass inlays have been retained. The\npresent church was opened on 10 July 1893. Notice the ornamental circular window above the front gable and the two Gothic\nstained glass panels on either side. Visitors are welcome to inspect a Willis Pipe Organ that was manufactured in 1879 and is still\nin use today.\n\n## St Kilda Hotel\n\n![St Kilda Hotel](../../assets/gallery/4-heritage-walk/St_Kilda_Hotel.jpeg)\n\nOctober 2011 marked the 150th anniversary of the St Kilda Hotel. Called the Freemasons Hotel when its foundation stone was\nlaid, the two storey building at the corner of Rusden and Marsh Streets opened circa June 1863. In July 1870, its name was\nchanged to the St Kilda Hotel. By July 1875, the Hotel was taken over by Benjamin Kendall for use as the Armidale Grammar\nSchool. The school closed at the end of 1877 and again became the St Kilda Hotel. After serving as a boarding house for more\nthan a decade, the building had major renovations in 1912 and 1913 and re-opened as a hotel.\n\n## Armidale Express Office\n\n![Armidale Express Office](../../assets/gallery/4-heritage-walk/Armidale_Express_Office.jpeg)\n\nThe Armidale Express printed its first edition of the newspaper on 5 April 1856 and has continued to serve the New England\ndistrict with local news since that date. The newspaper is Australia’s oldest country newspaper.\n\n## Lands Office\n\n![Lands Office](../../assets/gallery/4-heritage-walk/Lands_Office.jpeg)\n\nWith its solid English bond brick walls and elegant veranda, the 1887 Lands Office complements both the post office and the\nImperial Hotel. The building originally had a slate roof and chimneys with slate chimney pots. The same architect who supervised\nthe building of the Post Office designed the building.\n\n## Imperial Hotel\n\n![Imperial Hotel](../../assets/gallery/4-heritage-walk/Imperial_Hotel_1.jpeg)\n\nThe first hotel in Armidale was opened in 1843 and by 1850 seven hotels served\na population of less than 900. The Imperial was established in 1890. The then\npublican, John Kickham, provided transport between the railway station and the\nhotel in the form of horse-drawn coaches – a practice that no doubt gained him\nmany customers. Interesting external features include cast iron frieze-work on\nthe verandahs, bull-nosed awnings, and parapets decorated with triangular\npediments and Grecian urns.\n\n## Post Office\n\n![Post Office](../../assets/gallery/4-heritage-walk/Post_Office.jpeg)\n\nThe Armidale Post Office has stood on this site since 1880. Prior to this date it is thought that postal transactions were carried\nout in the postmaster’s private residences. For twenty years the various postmasters of the time received a commission and a\nsmall allowance for their duties. The appearance of the building, which is similar in style to many of the surrounding buildings,\nhelps to create a superbly scaled streetscape. The balcony and arched verandah were added in 1897 with further alterations\nbeing made over many years.\n\n## The Mall\n\n![The Mall](../../assets/gallery/4-heritage-walk/Beardy_St.jpeg)\n\nThe Mall was opened in 1973 and includes gardens, trees, seats and playground equipment. Armidale City Council refurbished\nthe Mall in 1988. Many heritage buildings are situated in the mall.\n\n## Court House\n\n![Court House](../../assets/gallery/4-heritage-walk/Court_House.jpeg)\n\nThe Court House was constructed during the period 1859 to 1860 and originally\nfaced north, overlooking Market Square and the lockup was originally next door\nto the post office. Later, in 1870, the building was extensively renovated and its\norientation reversed so that it looked south overlooking Beardy Street, with the\nnew lockup (now the Sheriff’s Cottage) at the rear of the court house. During\nthese renovations Sydney Blythe (1829-1888), the Clerk of Petty Sessions left a\nmessage under the building. Part of the message read “My friends, whoever you\nmay be who find this, rest assured that the world has wagged before your time as\nit will after your time, and that nothing is certain but death and taxes. For and on\nbehalf of my numerous creditors. Sydney Blythe”. His message lay hidden in a\ncognac bottle under the floorboards of the Court House until further renovations\nwere carried out in January 1971. The Court House features a triangular pediment, half fluted entrance columns with wrought\niron gates, a cobbled vestibule, and cedar furniture and joinery. The clock tower was added to the building in 1878.\n\n## Celtic Cross\n\n![Celtic Cross](../../assets/gallery/4-heritage-walk/Celtic_Cross.jpeg)\n\nThe Celtic Cross was erected to commemorate the first Christian Church Service held in Armidale on 12 October 1845. The\ngranite came from a dry creek bed on the western side of Mount Hutton near Uralla. As New England did not have machinery\nlarge enough to cut the huge piece of granite, it was sent, by train, to F.J. Arnold’s granite and sandstone quarry at Paddington in\nSydney to be cut and polished.\n\n## Westpac\n\n![Westpac](../../assets/gallery/4-heritage-walk/Westpac.jpeg)\n\nThe Westpac Bank building (formerly the Bank of New South Wales) was designed by Gordon W. Lee in Georgian revival style,\nwith metal framed windows, tiled roof, and panelled timber doors. The date of 1817, which appears on the parapet, relates to\nthe foundation of the Bank of New South Wales. The building itself was constructed in 1938.\nCourt House 1898\nImperial Hotel circa 1910\n\n## AMP Society\n\n![AMP Society](../../assets/gallery/4-heritage-walk/AMP.jpeg)\n\nThe AMP Society building, built in 1929, features a Georgian revival stuccoed brick facade. The elegance of this building is\nreflected in its sandstone entrance, timber shutters, timber-framed windows, sculptured figurines and terracotta roof. The AMP\nmotto appearing in Latin under the figurines means “a certain friend in uncertain times.”\n\n## Hanna’s Arcade\n\n![Hanna’s Arcade](../../assets/gallery/4-heritage-walk/Hannas.jpeg)\n\nHanna’s was established in 1921 and is one of the longest running family businesses in Armidale. In the arcade there is a large\nstained-glass window depicting life in the area: rural industry, education and cathedrals.\n\n## \"McLean's Corner\"\n\n![McLean's Corner](../../assets/gallery/4-heritage-walk/Police_Station.jpeg)\n\nThis structure was established as an\narchaeological interpretive project to preserve the remains of what used to be a house and mill dating back to the 1850s, originally\nowned by Mr McLean a local businessman and onetime mayor and coroner of Armidale.\n\n## Sheriff's Cottage\n\n![Sheriff's Cottage](../../assets/gallery/4-heritage-walk/Sherriffs_Cottage.jpeg)\n\nSituated at the rear of the original Armidale Court House. The building was originally a \"lockup\" and two of the cell windows\nfaced Moore Street, but have since been bricked in. On the opposite corner is the Armidale Police Station and current \"lockup\".\n\n## The Stables\n\n![The Stables](../../assets/gallery/4-heritage-walk/The_Stables.jpeg)\n\nConstructed approximately 1879, the building still has a slate roof and hoist over the main door to serve the loft.\n\n## New England Hotel\n\n![New England Hotel](../../assets/gallery/4-heritage-walk/New_England_Hotel_1.jpeg)\n\nOne hundred years ago the traveller to Armidale had a choice of 21 hotels, today there are nine. First opened in 1857, the New\nEngland Hotel is one of Armidale's oldest business establishments. The original building stood for 40 years until rebuilt on the\nsame site in 1897 by a local builder, George F. Nott.\n\n## J.R. Richardson and Company Limited 1842\n\n![J.R. Richardson and Company](../../assets/gallery/4-heritage-walk/Richardson_Co.jpeg)\n\nThe site of this shopping complex is the oldest business site in Armidale in continual commercial occupation. The first building to\nbe constructed on this site was John Mather's Armidale Stores where apparently bartering was an acceptable trade practice.\nTrading probably began in 1844 when it is recorded that Mather purchased the land. In 1872, John Richardson purchased the\nbusiness to establish Richardson's Store. The date that appears on the parapet (1842) marks the establishment of a chandlery by\nJohn Richardson in Brisbane. Over several years extensive remodelling has taken place inside the building.\n\n## Beardy Street\n\n![Alt text](../../assets/gallery/4-heritage-walk/Beardy_St_1.jpeg)\n\nBeardy Street was named after Duval and Chandler, two bearded stockmen who were employed as guides by prospective\nsquatters in the area.\n\n## State Bank\n\n![State Bank](../../assets/gallery/4-heritage-walk/State_Bank.jpeg)\n\nThe Australian Joint Stock Bank, later to be known as the State Bank, was constructed between 1887 and 1889. The high\nVictorian architecture of the time is reflected in the elegant columns, balustrades and tower-like structures on the front corners\nof the building. Entrance to the building formerly involved an iron shutter that could be raised and lowered from the inside.\n\n## Capitol Cinema\n\n![Capitol Cinema](../../assets/gallery/4-heritage-walk/Capitol_Theatre_1.jpeg)\n\nThe Capitol Cinema opened in 1925 as the Theatre Royal. Three years later the cinema reopened as the Capitol and remained a\npopular venue for well over fifty years.\n\n## Minto\n\n![Minto](../../assets/gallery/4-heritage-walk/The_Minto.jpeg)\n\nThe Minto, originally known as the Central Hotel, was designed by J. Rutledge Louat and constructed in 1894. Although this\nVictorian building has been substantially remodelled, remnants of the original cast iron lace work used in its original verandah\ncan still be seen on the upper window ledges.\n","trip":"Armidale 2022","place":"Australia","timezone":"Australia/NSW","location":"Armidale","title":"Day 4: Armidale (Heritage Walk)","description":"After UNE, we decided to stop at this Chinese restaurant that also holds memories for Lyn","date":"2022-02-27T03:00:00.000Z","image":{"src":"/armidale-2022/_astro/Beardy_St.9fd36460.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1},"map":[-30.5139,151.6681,16],"tags":["Armidale","walk"]},{"id":"4-mary-and-joseph.md","slug":"4-mary-and-joseph","base":"/armidale-2022/","collection":"post","body":"This magnificent building replaced the modest picturesque St Mary’s Cathedral which\ngraced the site from 1872-1912. On 5 February the foundation stone of a larger and\nstatelier Cathedral was laid. Sydney Architects, Sheerin and Hennessey, drew up plans\nbased on a basilica, the Roman-style court. Contract to build the Cathedral was won by\nGeorge Frederick Nott of Armidale. For a short time the two cathedrals stood side-by-\nside, until the present gothic revival-styled building with its steep roof, lofty spire and\ncastellated parapets took pride of place. Dedicated on 6 October 1912 it remains one\nof Armidale’s foremost landmarks. Open for general access seven days, 7.00am-\n6.00pm.\n","trip":"Armidale 2022","place":"Australia","timezone":"Australia/NSW","location":"Saints Mary and Joseph Catholic Cathedral","title":"Day 4: Armidale (Saints Mary and Joseph Catholic Cathedral)","description":"Part of the Armidale Heritage walk.","date":"2022-02-27T03:30:00.000Z","image":{"src":"/armidale-2022/_astro/Saints Mary and Joseph Cathedral (27).fcb6f7e7.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1},"map":[-30.51579,151.66389,18],"tags":["Armidale","Saints Mary and Joseph Catholic Cathedral","church"]},{"id":"4-mun-hing.md","slug":"4-mun-hing","base":"/armidale-2022/","collection":"post","body":"[Mun Hing Restaurant](https://munhingrestaurant.com.au/) is an established Chinese restaurant at the heart of Armidale central business district. Lyn has fond memories of eating here. This was where Lyn went for birthday celebrations and special occasions, and some of her friends worked there part time.\n\nWe had two dishes - they both seemed to be covered in standard nondescript brown sauce but were okay. The restaurant has a rock and water garden in front which has seen better days.\n","trip":"Armidale 2022","place":"Australia","timezone":"Australia/NSW","location":"Mun Hing","title":"Day 4: Armidale (Lunch at Mun Hing)","description":"After UNE, we decided to stop at this Chinese restaurant that also holds memories for Lyn","date":"2022-02-27T01:00:00.000Z","image":{"src":"/armidale-2022/_astro/Mun Hing (9).fc49c6d9.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1},"map":[-30.51266,151.66321,19],"tags":["Armidale","Mun Hing","lunch"]},{"id":"4-pj-thai.md","slug":"4-pj-thai","base":"/armidale-2022/","collection":"post","body":"Found a Thai restaurant in Armidale - [PJ Thai](https://www.pjthai.com.au/). The proprietor is hilarious (in a good way). Our fried rice was accidentally served onto a different table, and when he realised he nearly freaked out. I think he was going to force the other table to give the rice to us, but they have already started eating it. We overheard him asking the kitchen to cook another batch of fried rice quickly.\n","trip":"Armidale 2022","place":"Australia","timezone":"Australia/NSW","location":"PJ Thai","title":"Day 4: Armidale (Dinner at PJ Thai)","description":"We decided to try a Thai restaurant in Armidale.","date":"2022-02-27T07:00:00.000Z","image":{"src":"/armidale-2022/_astro/PJ Thai.de4fed6e.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1},"map":[-30.51591,151.66811,19],"tags":["Armidale","PJ Thai","dinner"]},{"id":"4-st-peters.md","slug":"4-st-peters","base":"/armidale-2022/","collection":"post","body":"In 1850 the small timber church of St Peter was built on the northern side of\nCentral Park. Horbury Hunt was engaged to design and supervise construction\nof a cathedral in Armidale in 1869. The foundation stones were laid on\n22 May 1873 when a parchment describing the proceedings was placed in a\nmetal cylinder between the stones which are under the flying buttress on the\nnorth side of the building. The Cathedral was opened on 3 June 1875 and later\nadditions have been the lower belfry, chapter house and vestry. Memorial\nstained-glass windows recall many parishioners and a small museum contains\necclesiastical memorabilia. A ring of eight bells was installed and dedicated in\nOctober 1996. Open for general access Monday-Friday, 9.00am-12.30pm.\n","trip":"Armidale 2022","place":"Australia","timezone":"Australia/NSW","location":"St Peter's Anglican Cathedral","title":"Day 4: Armidale (St Peter's Anglican Cathedral)","description":"Part of the Armidale Heritage walk.","date":"2022-02-27T04:00:00.000Z","image":{"src":"/armidale-2022/_astro/St Peter's Anglican Cathedral.929f55aa.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1},"map":[-30.51514,151.66519,19],"tags":["Armidale","St Peter's Anglican Cathedral","church"]},{"id":"4-une.md","slug":"4-une","base":"/armidale-2022/","collection":"post","body":"[UNE](https://www.une.edu.au/about-une) was formed in 1938 as the New England University College, a College of the University of Sydney. The University became fully independent in 1954 and pioneered teaching to external students by correspondence, making UNE Australia's most experienced provider of distance and now online education — UNE is now Australia's second-largest online university.\n\nI did a few days of consulting here 10 years ago, assisting in writing a business case for their online expansion. The deer park is now inhabited by kangaroos.\n\nThe main Armidale campus is comprised of the Academic Campus and Bellevue Campus. The Academic Campus (also known as 'up top') is the centre for teaching and research, and is located in the northern section of the Armidale campus. The Bellevue Campus, located in the southern section includes most of the residential colleges, and sporting facilities.\n\nWe started at the Academic Campus and stopped at Booloominbah, the main administration building and Great Hall.\n\n![Booloominbah](../../assets/gallery/5-une/Booloominbah_11.jpeg)\n\nBooloominbah was the 1880’s White family homestead designed by noted architect John Horbury Hunt (who also designed the Anglican cathedral). The building is now the administrative heart of the University of New England, the ﬁrst rural university in NSW (established as a college of Sydney University in 1938 and proclaimed an independent university in 1954).\n\nThe University campus and many charming heritage buildings across the region are home to museums and collections that reveal myriad colourful stories about the history of the New England.\n\nThen we walked towards Dixson Library.\n\n![Dixson Library](../../assets/gallery/5-une/Dixon_Library.jpeg)\n\nWe saw quite a few kangaroo sculptures around.\n\n![kangaroo](../../assets/gallery/5-une/Kangaroo.jpeg)\n\nThe Shop\n\n![The Shop](../../assets/gallery/5-une/TheShop.jpeg)\n\nLewis Lecture Theatre\n\n![Lewis Lecture Theatre](../../assets/gallery/5-une/Lewis_Lecture_Theatre.jpeg)\n\nThe Mathematics and Computer Science building\n\n![Mathematics and Computer Science building](../../assets/gallery/5-une/Mathematics,Computer_Science.jpeg)\n\nThe Psychology building\n\n![Psychology building](../../assets/gallery/5-une/Psychology_1.jpeg)\n\nMary White College, where Lyn resided in during her uni years.\n\n![Mary White College](../../assets/gallery/5-une/Mary_White_College_8.jpeg)\n\nLyn identified her old dorm room at Mary White College.\n\nOutside Mary White, we saw two kangaroos, a mother and her joey, who were very curious about us and I took a few photos.\n\n![mother and her joey](../../assets/gallery/5-une/Mother_and_joey_1.jpeg)\n\nAfter that, we drove around the campus and saw the Old Ground Shed and Oorala Centre.\n\n![Old Ground Shed](../../assets/gallery/5-une/Old_Ground_Shed.jpeg)\n\n![Oorala Centre](../../assets/gallery/5-une/Oorala_Centre_2.jpeg)\n\nWe then drove to the Bellevue Campus where we saw Austin College and Robb College.\n\n![Austin College](../../assets/gallery/5-une/Austin_College.jpeg)\n\nOur final stop was the UNE Business School and the Sports Centre.\n\n![UNE Business School](../../assets/gallery/5-une/Economics,business_and_law_1.jpeg)\n","trip":"Armidale 2022","place":"Australia","timezone":"Australia/NSW","location":"UNE","title":"Day 4: Armidale (UNE)","description":"In the morning, we decided to visit the University of New England for nostalgia sake.","date":"2022-02-26T23:00:00.000Z","image":{"src":"/armidale-2022/_astro/Booloominbah_11.da9f31d1.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[-30.4903,151.6397,15],"tags":["Armidale","University of New England"]},{"id":"5-armidale.md","slug":"5-armidale","base":"/armidale-2022/","collection":"post","body":"The main locations we have not visited are Martins Gully School and the Arboretum, plus a few others\n\n![Martins Gully School](../../assets/gallery/5-armidale/Martins_Gully_School_1.jpeg)\n\nArmidale Bicentennial Arboretum is a heritage listed park bounded by Kentucky, Butler and Galloway streets.\n\n![Bicentennial Arboretum](../../assets/gallery/5-armidale/Arboretum.jpeg)\n\nIt contains thousands of native and imported shrubs and trees, walking tracks, a north-facing lookout, picnic shelters, a toilet block and aquatic gardens with a waterfall and footbridge.\n\nThere is also a sensory garden near the entrance and a new children's playground was erected in 2016.\n\nAfter that, we went to the the Whitebull Hotel for dinner. I noticed some street art in an alleyway opposite the hotel.\n","trip":"Armidale 2022","place":"Australia","timezone":"Australia/NSW","location":"Armidale","title":"Day 5: Armidale","description":"We returned back to Armidale late in the afternoon and completed the Heritage Drive.","date":"2022-02-28T06:00:00.000Z","image":{"src":"/armidale-2022/_astro/Arboretum (2).6af76544.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1},"map":[-30.5139,151.6681,16],"tags":["Armidale","historic"]},{"id":"5-cows.md","slug":"5-cows","base":"/armidale-2022/","collection":"post","body":"Today the weather was good so we decided to venture a little further afield. We decided we will revisit Gara Gorge since the last time we were not able to walk far because of the wet conditions.\n\nOn the way there, we encountered a set of very stubborn cows on Blue Hole Rd. They absolutely did not want to give way, and I had to inch the car forward slowly until they yielded.\n","trip":"Armidale 2022","place":"Australia","timezone":"Australia/NSW","location":"Blue Hole road","title":"Day 5: Armidale (Cows)","description":"We encountered cows blocking the Blue Hole road.","date":"2022-02-27T22:00:00.000Z","image":{"src":"/armidale-2022/_astro/Cows.64a2f6e2.jpeg","width":2560,"height":1710,"format":"jpg","orientation":1},"map":[-30.5933,151.7881,16],"tags":["Armidale","cows","road"]},{"id":"5-dangar-gorge.md","slug":"5-dangar-gorge","base":"/armidale-2022/","collection":"post","body":"We parked at the [picnic area](https://www.nationalparks.nsw.gov.au/things-to-do/picnic-areas/dangars-falls-picnic-area), then did the [walk](https://www.nationalparks.nsw.gov.au/things-to-do/walking-tracks/mcdirtys-walking-track) to the lookout. A series of steps took us to a viewing platform right over the cascades of Dangers Falls.\n\nDangar Falls is a cascade waterfall located across the Bielsdown River about 1.2 km north of Dorrigo. The falls are small, picturesque, and are a popular photographic subject. For a short time after rain, they are quite spectacular. We were lucky to see them flowing strongly.\n\nFrom the lookout, we went along to the the Rock Wallaby lookout along [McDirtys Walk](https://www.nationalparks.nsw.gov.au/things-to-do/walking-tracks/mcdirtys-walking-track). From the spectacular Rock Wallaby lookout, we saw unending scenic views of the deep river gouged ravines.\n\nThe scenery looked like something out of Tolkien. We were last here over 25 years ago, and all I had was a film SLR with a 35-80mm zoom lens, and I really wished I had an ultra wide angle lens to capture the full perspective of the long falls, the pool at the bottom and the horseshoe gorge. Luckily I am a little better equipped these days. Some of these shots were captured at 12mm. Once again butterflies accompanied us on the walk.\n","trip":"Armidale 2022","place":"Australia","timezone":"Australia/NSW","location":"Dangar Gorge","title":"Day 5: Dangar Gorge and Falls","description":"We visited Dangar Gorge in the late 1980s so it was worthwhile revisiting.","date":"2022-02-28T03:00:00.000Z","image":{"src":"/armidale-2022/_astro/Dangar Gorge.84ea76b0.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1},"map":[-30.32326,152.71426,18],"tags":["Waterfall Way","Dangar Gorge"]},{"id":"5-dangarsleigh.md","slug":"5-dangarsleigh","base":"/armidale-2022/","collection":"post","body":"The [monument](https://monumentaustralia.org.au/themes/conflict/ww1/display/97050-dangarsleigh-war-memorial) commemorates those who died in service or were killed in action during World War One.  It is a substantial, multi-element concrete and stone monument set in a large concrete circle edged with stones.\n\nCorporal Alfred Perrott was killed in action on the 28th of October 1917 while serving in the 6th Field Artillery of the Australian Imperial Force. Alfred Perrott senior dedicated a portion of his property ‘Chevy Chase’, and proceeded to design and construct a memorial to his son and his fellow soldiers.  The final plan for the monument was a composite based on concepts drawn up by Mr Perrott, Architect Mr Hickson, Shire Engineer Mr Montague Smith and the builder Mr Mark Roberts\n\nThe large circle surrounding the monument represents the world, with the inlaid stones showing the rough path of life.  Due north is marked into the circle with points of the compass and on the southern side a groove indicates where the shadow of the monument falls at noon on midsummer`s day.  Five pillars, each with fives sides represent the \"children\"of the former British Empire - Australia, Canada, India, New Zealand and South africa.  The three-sided obelisk represents \"Mother\" England with Ireland and Scotland.\n\nThe entrance to the monument in the form of an Eastern temple invites people to \"Nirvana\", the place of peace and is surmounted by a bell, which calls souls to rest.   The turnstile of the entrance has handles fashioned into the shapes of a military bugle, service rifle, Naval bosun`s whistle and a cannon.\n\nSixteen men are named on the western face of the monument  and families and friends paid sixpence per lead letter to record the names. An unveiling ceremony was held on Empire Day 1921, after having taken eight months to construct.  On 21st February 1921, memorabilia was placed in the chamber and the laying of the foundation stone was undertaken by Mrs Elizabeth Holloway of 'Mount Pleasant' at Kelly`s Plains who was the oldest resident in the district to have lost a sone in World War One.\n\nThe monument remained in the private ownership of the Perrott family until it was handed over to the Dumaresq Shire in a ceremony on 16th March 1991.  It passed to the Armidale Dumaresq Council following amalgamation in 2000. The community still undertake the general maintenance and care of the site.\n","trip":"Armidale 2022","place":"Australia","timezone":"Australia/NSW","location":"Dangarsleigh War Memorial","title":"Day 5: Dangarsleigh War Memorial","description":"Dangarsleigh War Memorial is a heritage-listed World War I memorial.","date":"2022-02-28T01:00:00.000Z","image":{"src":"/armidale-2022/_astro/Dangarsleigh War Memorial (5).ca9d060d.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1},"map":[-30.59263,151.68484,19],"tags":["Armidale","Dangarsleigh War Memorial"]},{"id":"5-deeargee-woolshed.md","slug":"5-deeargee-woolshed","base":"/armidale-2022/","collection":"post","body":"After Dangar Gorge, we decided to drive to the picturesque Gostwyck Chapel. Along the way, we passed through the well known landmark called Deeargee Woolshed.\n\nOriginally part of Gostwyck Station, Deeargee Station and its unique octagonal woolshed gained their name from the old Gostwyck wool brand, DRG, which stood for \"Dangar, Gostwyck\". The woolshed was built in 1872 replacing an earlier shearing shed that had been destroyed by fire.\n\nDesigned and erected by Alexander Mitchell, who also built McCrossin's Mill in Uralla, the woolshed is erected on brick pillars with successive roofs of galvanised iron. The side walls contain large amounts of glass. The woolshed has all facilities required for shearing, pressing, bailing, sorting and other operations. It even has a lightning conductor.\n\nThe Deeargee Woolshed is still in use today and, although not open to visitors, it is easily viewed from the roadside.\n\nToday the Gostwyck and Deeargee properties are known for producing some of Australia's finest wool. Both are 11 kilometres from Uralla on the Gostwyck Road.\n","trip":"Armidale 2022","place":"Australia","timezone":"Australia/NSW","location":"Deeargee Woolshed","title":"Day 5: Deeargee Woolshed","description":"This octagonal woolshed is a famous landmark around the area.","date":"2022-02-28T04:00:00.000Z","image":{"src":"/armidale-2022/_astro/Deeargee Station (1).1dcc591a.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1},"map":[-30.69922,151.58865,17],"tags":["Armidale","Deeargee Woolshed"]},{"id":"5-gara-gorge.md","slug":"5-gara-gorge","base":"/armidale-2022/","collection":"post","body":"This time, we parked at the [Blue Hole](https://www.nationalparks.nsw.gov.au/things-to-do/picnic-areas/blue-hole-picnic-area) picnic area.\n\n[Threlfall walking track](https://www.nationalparks.nsw.gov.au/things-to-do/walking-tracks/threlfall-walking-track) in Oxley Wild Rivers National Park takes in the spectacular Gara Gorge wilderness area, with scenic views and a chance to see the historic hydro-electric scheme.\n\nThis medium length track traces the gorge ridge and combines an historic walk with jaw-dropping views.\n\nGara Gorge follows the route of the historic 1894 hydro-electric scheme, along old embankments and through ancient cuttings of granite. At Gara Gorge lookout high above Gara River, with a backdrop of majestic blackbutt and spotted gums, gaze across the rugged wilderness.\n\nIt's amazing how a few days of rain has completely transformed the river and one of the bridges is now uncrossable. We walked along the flume line of the old dam, with butterflies following us. There's spectacular views of the gorge, including the mushroom rock (which looks like something out of Tolkien), as well as the river itself. We also saw a lot of ant holes, and granite rocks.\n","trip":"Armidale 2022","place":"Australia","timezone":"Australia/NSW","location":"Blue Hole picnic area","title":"Day 5: Gara Gorge","description":"Revisiting Gara Gorge to do the full Threlfall walk.","date":"2022-02-27T23:00:00.000Z","image":{"src":"/armidale-2022/_astro/Gara Gorge (60).94eed82d.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1},"map":[-30.59523,151.79838,19],"tags":["Waterfall Way","Gara Gorge"]},{"id":"5-gostwyck-chapel.md","slug":"5-gostwyck-chapel","base":"/armidale-2022/","collection":"post","body":"All Saints Anglican Church or better known as Gostwyck Chapel is part of Gostwyck Station only 11km east of Uralla along Tourist Drive 19. This quaint little church can also be accessed from the Waterfall Way east of Armidale.\n\nEdward Gostwyck Cory settled this holding of 80,000 acres in 1832 and named it Gostwyck. In 1934 he sold his grazing rights to William Dangar who subsequently sold them to his brother Henry. The Dangars are quite a renowned family in Newcastle and the Hunter Valley area.\n\nBy 1841 the community at Gostwyck had grown to forty-eight, comprising mostly of shepherds and their families. When the various properties were fenced, boundary riders were employed and fewer shepherds were needed and as a result the population declined. Following both World Wars the government reclaimed portions of the property for Soldier Settlement blocks. By 1970 only 13,000 acres remained of the original holding and this was divided between the two granddaughters of Henry Dangar each receiving 6,500 acres. The western side, or homestead area, retained the name “Gostwyck”, while the eastern side on which stands the historic wool shed was renamed “Deeargee.” This name came from the old “Gostwyck” wool brand DRG which stood for “Dangar,Gostwyck”.\n\nThe Chapel at Gostwyck was officially named All Saints Anglican Church and erected on Gostwyck Station. The chapel was built in memory of Major Clive Dangar who died of injuries sustained during World War 1. He made it back to Australia but died in Melbourne as a result of these wounds received during the war and is buried in Waverely Cemetery in Sydney.\n","trip":"Armidale 2022","place":"Australia","timezone":"Australia/NSW","location":"Gostwyck Chapel","title":"Day 5: Gostwyck Chapel","description":"This very picturesque small church is a photographer's delight.","date":"2022-02-28T05:00:00.000Z","image":{"src":"/armidale-2022/_astro/Gostwyck Chapel.af49896a.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1},"map":[-30.69504,151.58497,18],"tags":["Armidale","Gostwyck Chapel"]},{"id":"5-whitebull.md","slug":"5-whitebull","base":"/armidale-2022/","collection":"post","body":"[The Whitebull](https://www.whitebull.net.au) is a traditional country hotel, redeveloped into a steakhouse. There is the beautiful rope room with a mix of high and low seating to enjoy that casual dining experience. This is complimented by the old world lounge area with a traditional bar and beautifully restored fireplaces for those classic New England winters.\n\nWe had the sirloin steak and chicken schnitzel here and it was an enjoyable meal to celebrate the end of our trip to Armidale.\n","trip":"Armidale 2022","place":"Australia","timezone":"Australia/NSW","location":"Whitebull Hotel","title":"Day 5: Armidale (Dinner at Whitebull Hotel)","description":"For our last night in Armidale, we chose this hotel because we heard the steaks are good here.","date":"2022-02-28T07:00:00.000Z","image":{"src":"/armidale-2022/_astro/Whitebull.9607df9b.jpeg","width":2560,"height":1440,"format":"jpg","orientation":1},"map":[-30.51448,151.66955,18],"tags":["Armidale","Whitebull Hotel","dinner"]},{"id":"6-chaffey-dam.md","slug":"6-chaffey-dam","base":"/armidale-2022/","collection":"post","body":"[Chaffey Dam](https://www.waternsw.com.au/nsw-dams/regional-nsw-dams/chaffey-dam) is unique in inland NSW for its distinctive brick-red rock wall made of semi-precious stone and its unusual morning glory spillway. The lake and its foreshores are a popular destination for water sports and fishing enthusiasts, nature lovers, bushwalkers, campers and picnickers. The main purpose of the dam is to supply irrigation and stock needs in the Peel River Valley of northern NSW, and to supply water to the city of Tamworth.\n\nChaffey Dam is situated on the Peel River, 43 kilometres south-east of Tamworth in the New England region of NSW. The dam is about 400 kilometres north of Sydney.\n","trip":"Armidale 2022","place":"Australia","timezone":"Australia/NSW","location":"Chaffey Dam","title":"Day 6: Chaffey Dam","description":"After Urallla, we decided to make a detour and stop at yet another dam.","date":"2022-03-01T02:00:00.000Z","image":{"src":"/armidale-2022/_astro/Chaffey Dam (13).1066ccaa.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[-31.3639,151.1269,14],"tags":["Chaffey Dam","dam"]},{"id":"6-dumaresq-dam.md","slug":"6-dumaresq-dam","base":"/armidale-2022/","collection":"post","body":"Dumaresq dam was built between 1896 and 1898 and was Armidale’s water supply until the 1968, when Malpas Dam was completed. It is now set aside as a recreation reserve. A 2.5 km walking track passes through eucalypt woodland on its way around the dam. It is an easy walk, though rock-hopping is required for one section. A new mountain biking track links to nearby Mount Duval. Both the woodland and the dam offer excellent opportunities for bird watching, and for anglers, the dam is stocked with trout, and occasionally bass.\n","trip":"Armidale 2022","place":"Australia","timezone":"Australia/NSW","location":"Dumaresq Dam","title":"Day 6: Dumaresq Dam","description":"We are leaving Armidale today, and on our way back stopped at Dumaresq Dam.","date":"2022-02-28T23:00:00.000Z","image":{"src":"/armidale-2022/_astro/Dumaresq Dam (3).18ecd870.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[-30.4281,151.5996,16],"tags":["Dumaresq Dam","dam"]},{"id":"6-peel-river.md","slug":"6-peel-river","base":"/armidale-2022/","collection":"post","body":"The river looked picturesque at the bridge crossing, so we stopped the car briefly and took some photos.\n","trip":"Armidale 2022","place":"Australia","timezone":"Australia/NSW","location":"Peel River","title":"Day 6: Peel River","description":"On leaving Chaffey Dam, we crossed Peel River on Nundle Rd.","date":"2022-03-01T03:00:00.000Z","image":{"src":"/armidale-2022/_astro/Peel River (4).bcd0656f.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[-31.3864,151.1367,15],"tags":["Peel River"]},{"id":"6-uralla.md","slug":"6-uralla","base":"/armidale-2022/","collection":"post","body":"[Uralla](https://www.uralla.com) is a prosperous rural service town surrounded by the rich, fertile soils of the New England district. Today the prosperity of the town relies on its proximity to Armidale (it has a number of commuters); the superfine wool and cattle which is produced on the surrounding properties; and its location as a tourist destination - it is almost exactly halfway between Sydney and Brisbane. Uralla describes itself as ‘Thunderbolt Country’ and this is demonstrated by the town's chief claim to fame - the bushranger Captain Thunderbot. He is one of the main features at the local museum; his body lies in the local cemetery; he has a statue in the main street; and Thunderbolt Rock, the place which he reputedly used for many of his robberies, lies only 7 km south of the town.\n\nGold was discovered at Rocky River, near Uralla, in 1851 and soon 3400 miners were there searching for the precious ore. By 1855, this number had grown to 5000.\n\nUp until 1870, bushrangers were notorious for disrupting the rustic pastoral scene.\n\nThe antics of Frederick Ward (alias Captain Thunderbolt), for instance, are legendary. Ward’s stellar career in highway robbery came to an end when he was shot by police at Kentucky Creek in 1870. Or was he? Controversy about who was actually killed on that day has been hotly debated ever since.\n\nIt is believed that \"uralla\", in the language of the local Anaiwan Aborigines, was the name given to the district - specifically to a ceremonial meeting place and lookout which was situated on the top of a hill or the two hills at the town's north-western boundary.\n\nWe walked around the town and admired the historic buildings.\n","trip":"Armidale 2022","place":"Australia","timezone":"Australia/NSW","location":"Uralla","title":"Day 6: Uralla","description":"Our next stop on the return journey is the historic town of Uralla.","date":"2022-03-01T00:00:00.000Z","image":{"src":"/armidale-2022/_astro/Uralla motorcycle parking.738215fc.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[-30.6434,151.4962,15],"tags":["Uralla","historic"]}]