[{"id":"cowra-2022.md","slug":"index.html","base":"/undefined/","collection":"trip","body":"\nWe decided to combine a visit to Cowra (for the Sakura Matsuri - Cherry Blossom Festival at the Cowra Japanese Garden) with a visit to Canberra (for the Floriade festival). This is the first time since the COVID-19 pandemic that both festivals have returned to full force.\n\n| Day | Date             | Location | Hotel                                                | Itinerary                               |\n| --: | :--------------- | :------- | :--------------------------------------------------- | :-------------------------------------- |\n|   1 | Fri 23 September | Cowra    | [Cowra Motor Inn](https://www.cowramotorinn.com.au/) | Bathurst, Canola, Japanese War Cemetery |\n|   2 | Sat 24 September | Cowra    | Nicholls                                             | Sakura Matsuri Festival                 |\n|   3 | Sun 25 September | Canberra | Nicholls                                             | Floriade, Connections                   |\n|   4 | Mon 26 September | Home     | Tulip Top Gardens                                    |\n","trip":"Cowra 2022","place":"Australia","timezone":"Australia/NSW","location":"Cowra","title":"Cowra 2022","description":"Girls road trip (23-26 September 2022) to Cowra Japanese Garden Matsuri Spring Festival and Canberra for the Floriade.","date":"2022-09-26T06:00:00.000Z","image":{"src":"/undefined/_astro/trip.DGAwbb6Y.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/cowra-2022/src/assets/trip.jpeg"},"tags":["Cowra","Matsuri","Canberra","Floriade","Connections","Tulip Top Gardens"]},{"id":"1-bathurst.md","slug":"1-bathurst","base":"/undefined/","collection":"post","body":"\nKings Parade, with its Carillon, Evans and Boer War Memorial monuments, forms an important focal point for the city.\n\nThe Carillon was built in 1933 as a memorial to the men and women of Bathurst and District who served in World War 1. It has 35 bells and, while it can still be played manually, it is connected to a computer and is programmed to play 40 different tunes. It plays every day at noon and 1.00pm.\n\nNearby is Machattie Park which was formally opened in December 1890. The park is built on the site of the old Bathurst Gaol, which was demolished in 1888 to make way for the park.\n\nMachattie Park is an historically significant example of a late 19th century Victorian country town park. It exhibits the principal elements typical of the Victorian period in terms of the form and layout and is particularly valuable because of the quality of the decorative features. Features include the Bandstand, the Caretakers Cottage, Crago Fountain, Fernery, Lake Spencer and the Munro Drinking Fountain.\n\nAdditionally, the park has a valuable collection of mature and majestic trees that are used either informally or formally as avenue plantings. Most of these trees are not natives of Australia. Particularly important are the avenues of Huntington Elms bordering the park as well as a unique layered elm hedge. Some of the fine specimens of exotic trees include, Bunya Pine, Atlas Cedar, Deodar Cedar, Red Beech, English Oak, Pin Oak, Wellingtonia, Chinese Elm and Silver Elm. Together, they contrive to make it one of the prize examples of a Victorian Park within New South Wales.\n\nWe saw many blossoms around here took quite a few photos.\n\nNearly is the majestic Bathurst Courthouse - one of the finest Victorian Court House buildings in New South Wales. Built as part of a precinct of Victorian public buildings, it is a landmark building prominently sited in the town centre of Bathurst.\n","trip":"Cowra 2022","place":"Australia","timezone":"Australia/NSW","location":"Bathurst","title":"Day 1: Bathurst","description":"After lunch, we stopped by briefly to take photos of the cherry blossoms around Kings Parade.","date":"2022-09-23T03:00:00.000Z","image":{"src":"/undefined/_astro/Kings Parade (7).CJjpMkmo.jpeg","width":2560,"height":1710,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/cowra-2022/src/assets/gallery/1-bathurst/Kings Parade (7).jpeg"},"map":[-33.41773,149.57921,17],"tags":["Bathurst","Kings Parade","Machattie Park","Bathurst Courthouse"]},{"id":"1-canola.md","slug":"1-canola","base":"/undefined/","collection":"post","body":"\nEvery spring, the canola fields around Cowra turn a beautiful golden yellow and they are an amazing sight to see and to photograph. Although we are not supposed to step into a canola field for biological risk reasons, we stopped the car and took some photos from the roadside.\n","trip":"Cowra 2022","place":"Australia","timezone":"Australia/NSW","location":"Cowra","title":"Day 1: Canola","description":"On the way to Cowra, we stopped by at the roadside to admire the Canola fields.","date":"2022-09-23T05:00:00.000Z","image":{"src":"/undefined/_astro/Canola (10).C3ep1qeA.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/cowra-2022/src/assets/gallery/1-canola/Canola (10).jpeg"},"map":[-33.8505,148.6402,12],"tags":["Cowra","Canola"]},{"id":"1-dinner.md","slug":"1-dinner","base":"/undefined/","collection":"post","body":"\nWe had dinner at the Imperial Hotel Cowra - wow the serving sizes here are gigantic. I could barely finish half my steak and couldn’t have any of the chips. Each meal could easily be shared by 2 people. It was delicious. Afterwards we tried to paint the town pink by walking down main street. Two publicans came out to chat with us - I think they were intrigued to see a group of Asian ladies.\n","trip":"Cowra 2022","place":"Australia","timezone":"Australia/NSW","location":"Imperial Hotel","title":"Day 1: Cowra (Dinner)","description":"We had dinner at the Imperial Hotel in Cowra.","date":"2022-09-23T08:00:00.000Z","image":{"src":"/undefined/_astro/Imperial Hotel (1).-DxAd5Ht.jpeg","width":2560,"height":1920,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/cowra-2022/src/assets/gallery/1-dinner/Imperial Hotel (1).jpeg"},"map":[-33.83398,148.68769,18],"tags":["Cowra","dinner","Imperial Hotel"]},{"id":"1-japanese-war-cemetery.md","slug":"1-japanese-war-cemetery","base":"/undefined/","collection":"post","body":"\nAt 1.50 am on the clear moonlit night of August 5, 1944, the largest Prisoner of War breakout in modern military history occurred at Cowra. More than 1000 Japanese prisoners launched a mass 'suicide attack' on their guards, Australian soldiers of the 22nd Garrison. To the Japanese, the disgrace of capture could finally be overcome by dying in armed battle.\n\nArmed with crude weapons, four groups each of approximately 300 Japanese threw themselves on to barbed wire fences and into the firing line of Vickers machine guns. Protected only by baseball mitts, blankets, and coats and using their comrades as a human bridge to cross the tangled barbed wire, more than 350 Japanese clawed their way to freedom.\n\nAll escapees were captured during the following week. A total of 107 POWs were wounded, 234 prisoners died along with 5 Australian soldiers.\n\n## JAPANESE WAR CEMETERY\n\nEstablished in 1964, this is the only Japanese War Cemetery to be retained in Australia. There are 523 graves at the Japanese War Cemetery, containing the remains of the 231 Japanese soldiers who were killed in the 1944 Cowra Breakout and all Japanese Nationals who died on Australian soil during World War II.\n\nPrior to 1964, the Japanese Cemetery had been cared for in an informal way by members of the Cowra RSL Sub-Branch, who kept the lawns mowed and the weeds in check.\n\nThis was done as a mark of respect for the fallen soldiers at a time when there were mixed feelings concerning the Japanese.\n\nIt is now designated as an official Japanese war cemetery and those buried here numbered over 500 including those who died of other causes during internment and those who died elsewhere (for example during the Darwin bombing).\n\nI noticed the number of graves have lessened over the years, possibly due to repatriation by their families.\n\n## AUSTRALIAN WAR CEMETERY\n\nThe Cowra War Cemetery is the resting place for four of the Australian Soldiers killed in the Cowra Breakout, as well as other service personnel from Cowra who lost their lives in training or from illness. The Cemetery is beautifully maintained and considered a showpiece for modern military cemeteries.\n\nThe Australian War Cemetery and the Japanese War Cemetery are maintained by the Commonwealth War Graves Commission through the Australian Government’s Department of Veterans Affairs.\n\nOver 200 Japanese prisoners died whilst attempting the Cowra Breakout in August 1944 have been buried here and members of the RSL maintained the cemeteries post war as a sign of respect which touched the Japanese people.\n\n## SAKURA AVENUE\n\nIn 1988, as a bicentennial project, Cowra Shire Council planted 1988 cherry blossom trees between the Cowra War Cemetery, the site of the Prisoner Of War Camp, and the Japanese Gardens as a sign of peace and reconciliation with the Japanese people.\n\nA highlight of spring for locals and visitors alike is a drive from the Cowra Japanese Garden up Sakura Avenue, or Avenue of Cherry Trees. Brilliant blossoms line the way along the Avenue, which links the Japanese Garden with the site of the POW Camp, and continues on to the Australian and Japanese War Cemeteries. Each tree is sponsored by Japanese businesses and citizens as well as Australian school children.\n","trip":"Cowra 2022","place":"Australia","timezone":"Australia/NSW","location":"Japanese War Cemetery","title":"Day 1: Cowra (Japanese War Cemetery)","description":"We arrived in Cowra in the afternoon, and there was just enough time to look at the Japanese war cemetery.","date":"2022-09-23T06:00:00.000Z","image":{"src":"/undefined/_astro/Japanese War Cemetery (3).oo1KUguz.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/cowra-2022/src/assets/gallery/1-japanese-war-cemetery/Japanese War Cemetery (3).jpeg"},"map":[-33.80119,148.69182,18],"tags":["Cowra","Japanese War Cemetery"]},{"id":"1-pantanos.md","slug":"1-pantanos","base":"/undefined/","collection":"post","body":"\nWe started in the morning, stopped by at McDonalds in Blaxland for a coffee break, and arrived in Bathurst in time for lunch. We decided to choose [Pantano's Bar and Grill](https://www.pantanosbarandgrill.com.au/).\n","trip":"Cowra 2022","place":"Australia","timezone":"Australia/NSW","location":"Pantanos","title":"Day 1: Lunch in Bathurst","description":"We had lunch at Pantano's Bar and Grill.","date":"2022-09-23T02:00:00.000Z","image":{"src":"/undefined/_astro/Pantano's Bar and Grill.CD6ztH9y.jpeg","width":2560,"height":1920,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/cowra-2022/src/assets/gallery/1-pantanos/Pantano's Bar and Grill.jpeg"},"map":[-33.41731,149.58126,18],"tags":["Bathurst","Pantanos","lunch"]},{"id":"2-cowra.md","slug":"2-cowra","base":"/undefined/","collection":"post","body":"\nThe Cowra Bridge Pylons are situated beneath the Lachlan River Bridge and feature Aboriginal murals. The murals were painted by local Aboriginal artist, Kym Freeman and depict the history of the Wiradjuri people who inhabited the Cowra area before English settlement. The size of the murals and the attention to fine detail make them a must-see when visiting Cowra. They are just a short walk from the Visitor Information Centre down towards the river.\n","trip":"Cowra 2022","place":"Australia","timezone":"Australia/NSW","location":"Cowra Bridge","title":"Day 2: Cowra (morning)","description":"I woke up early in the morning and explored the murals on Cowra Bridge before buying breakfast at McDonalds.","date":"2022-09-23T21:00:00.000Z","image":{"src":"/undefined/_astro/Cowra Bridge (6).Dy3SngSb.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/cowra-2022/src/assets/gallery/2-cowra/Cowra Bridge (6).jpeg"},"map":[-33.83433,148.68376,17],"tags":["Cowra","Cowra Bridge","murals","art"]},{"id":"2-dinner.md","slug":"2-dinner","base":"/undefined/","collection":"post","body":"\n[SoupStone 汤食](https://soupstone.business.site) is a Cantonese restaurant located near ANU in Canberra. We discovered the owner is actually from Malaysia. The food here is surprisingly good and tasty.\n\nAfterwards we walked around the district of Acton and stepped into a beautifully decorated [85&deg;C Cafe](https://www.85cafe.com.au) with a flower wall. Here we posed for photos as well as bought some buns and sweets for tomorrow's breakfast.\n","trip":"Cowra 2022","place":"Australia","timezone":"Australia/NSW","location":"Soup Stone","title":"Day 2: Dinner (Soup Stone)","description":"Dinner at SoupStone in Acton followed by dessert and breakfast provisions at 85 Cafe.","date":"2022-09-24T08:00:00.000Z","image":{"src":"/undefined/_astro/Soupstone.BwDYx35H.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/cowra-2022/src/assets/gallery/2-dinner/Soupstone.jpeg"},"map":[-35.2762,149.12577,18],"tags":["Canberra","dinner","Soup Stone","85 bakery"]},{"id":"2-ironbark.md","slug":"2-ironbark","base":"/undefined/","collection":"post","body":"\nThis place seemed promising, serving a variety of American inspired meals using a smoked barbeque. They have a hand written menu on the chalkboard. However, we were probably a bit disappointed by the serving size and also the taste. It wasn't bad, but it was ordinary and we were expecting greatness.\n\nThe building itself is an old mill that looks quite rustic but the decor was a bit plain.\n","trip":"Cowra 2022","place":"Australia","timezone":"Australia/NSW","location":"Ironbark","title":"Day 2: Cowra (Lunch at Ironbark)","description":"We had an American lunch at The Ironbark Smoked Barbecue at the Mill.","date":"2022-09-24T02:00:00.000Z","image":{"src":"/undefined/_astro/Ironbark Smoked BBQ at the Mill.mY7cu_vj.jpeg","width":2560,"height":1920,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/cowra-2022/src/assets/gallery/2-ironbark/Ironbark Smoked BBQ at the Mill.jpeg"},"map":[-33.8355,148.6874,16],"tags":["Cowra","Ironbark","lunch"]},{"id":"2-one-tree-hill.md","slug":"2-one-tree-hill","base":"/undefined/","collection":"post","body":"\nThe One Tree Hill Water Tank can be found in the new subdivision of Taylor in Canberra.\n\nIt was painted by Geoff Filmer in July 2021.\n\nIn Geoff's own words, he hopes as the new suburb of Taylor grows and matures, this iconic piece of art will stand the test of time and becomes something that is really treasured by the Taylor Community as a thing that is so uniquely theirs.\n\nThe mural is a balance of native birds and fauna, some of which are endangered in the areas that surround Taylor. These creatures in particular were specifically chosen to be highlighted in the project and include the sun moth and some of the legless lizards local to Taylor. Also featured is a wedge tailed eagle because of the many eagles found in the area.\n\nThe overall concept was designed to be seen from a distance as the tanks are set high into the hill overlooking the suburb of Taylor. They wanted something interesting, that fitted in and was readable from a very long distance, so that's why the birds and animals are very large.\n\nGeoff hopes that mural will become an iconic part of the Taylor suburb and give the residents a sense of pride, that they have such a striking piece of art right in their own suburb.\n\nWe found it was quite difficuly to get close access to the mural, since it was protected by fencing and locked gates. In the end, we just took pictures outside the fence.\n","trip":"Cowra 2022","place":"Australia","timezone":"Australia/ACT","location":"One Tree Hill","title":"Day 2: One Tree Hill","description":"We reached Canberra in the afternoon and stopped by at One Tree Hill to admire the water tank mural.","date":"2022-09-24T06:00:00.000Z","image":{"src":"/undefined/_astro/One Tree Hill (9).DX7kE7_-.jpeg","width":2560,"height":1920,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/cowra-2022/src/assets/gallery/2-one-tree-hill/One Tree Hill (9).jpeg"},"map":[-35.14385,149.0954,17],"tags":["Canberra","One Tree Hill","art","Taylor"]},{"id":"2-sakura-matsuri.md","slug":"2-sakura-matsuri","base":"/undefined/","collection":"post","body":"\nFollowing 2 years of cancellations due to the pandemic, Sakura Matsuri (Cherry Blossom Festival) wil be returning to the Cowra Japanese Garden and Cultural Centre in 2022! To mark the occasion, we visited the garden wearing kimonos and hauris.\n\n## Cowra Japanese Garden & Cultural Centre\n\nThe Cowra Japanese Garden & Cultural Centre is a tangible monument to peace and reconciliation between two countries. The principal object and purpose of the Cowra Japanese Garden and Cultural Centre is the promotion of Japanese design including; landscape, garden and built form design, Japanese crafts, Japanese movable cultural heritage and to support and advance the cultural relations between the people of the Cowra Shire in New South Wales and the people of Japan.\n\nKen Nakajima, created the Kaiyushiki (strolling) garden, to symbolise the Japanese landscape. The rocky hillside, manicured hedges, waterfalls, streams and the two lakes provide a serene and secure environment for a myriad of local birdlife. Special features of the Garden include a traditional Edo Cottage, an authentic open-air Tea house and a Bonsai House. The Cultural Centre adjoins the main building, with the first gallery showcasing exhibitions from a variety of local and regional artists. The next two galleries feature an extensive collection of beautiful Japanese artworks and artefacts. An Educational & Multi-purpose Centre is available for functions ranging from seminars to theatrical performances.\n\nThe 5 hectares of garden opened in 1979. Koi carp can be seen from the viewing platforms overlooking the lakes.\n\n## Sakura Matsuri\n\nSakura Matsuri is the highlight of the year at the Cowra Japanese Garden, a huge festival celebrating the coming of spring, the beauty of the seasonal cherry blossoms, and Japanese culture itself.\n\nVisitors have the chance to experience traditional Japanese culture and performance in this day of joyful celebration.\n\nThe festival shows off the best of Japanese culture with displays and demonstrations including music, dance, martial arts and sumo, arts and crafts, tea ceremonies and more. The Taiko Drummers are always particularly popular, with heart-thumping rhythms reverberating through the garden. There is also the market, with stall holders offering a range of Japanese food, drinks and products.\n\nSakura Matsuri is celebrated annually in September when the cherry blossoms are at their peak. The blossoms are usually in flower from late mid September until mid October, depending on weather each year. The Garden also includes apricot, apple and plum blossoms along with magnolia.\n","trip":"Cowra 2022","place":"Australia","timezone":"Australia/NSW","location":"Cowra Japanese Garden","title":"Day 2: Cowra (Sakura Matsuri)","description":"The highlight of our trip was visiting the Cowra Japanese Garden during the Sakura Matsuri festival.","date":"2022-09-24T01:00:00.000Z","image":{"src":"/undefined/_astro/Sakura Matsuri (30).XwdOjmvp.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/cowra-2022/src/assets/gallery/2-sakura-matsuri/Sakura Matsuri (30).jpeg"},"map":[-33.82677,148.69719,17],"tags":["Cowra","Cowra Japanese Garden","Sakura Matsuri","Spring","festival"]},{"id":"3-canberra.md","slug":"3-canberra","base":"/undefined/","collection":"post","body":"\n[Ms Ba Co](https://www.msbaco.com) means “three girls” – a name that represent the three daughters of the owner. We had a selection of Vietnamese dishes here - I had the roast pork banh mi which I've always liked.\n\nAfterwards, some of us went shopping at [Canberra Centre](https://canberracentre.qicre.com/) and we ended up having afternoon tea at [Via Dolce](https://www.viadolce.com.au/).\n","trip":"Cowra 2022","place":"Australia","timezone":"Australia/ACT","location":"Canberra","title":"Day 3: Canberra (lunch)","description":"After Floriade, we walked to Civic and had lunch at Ms Ba Co.","date":"2022-09-25T02:00:00.000Z","image":{"src":"/undefined/_astro/Sam sek fan.B0LIbAgm.jpeg","width":1712,"height":1284,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/cowra-2022/src/assets/gallery/3-canberra/Sam sek fan.jpeg"},"map":[-35.27821,149.13292,17],"tags":["Canberra","lunch","Ms Ba Co","Via Dolce"]},{"id":"3-connection.md","slug":"3-connection","base":"/undefined/","collection":"post","body":"\nGrande Experiences, creators and producers of the most visited multi-sensory exhibition in the world, Van Gogh Alive, developed **Connection** to celebrate the spirit of Indigenous Australia.\n\nConnection brings to life the stories, art and culture of Australia’s First Peoples through multi-sensory projections and dynamic immersion.\n\nCutting-edge visual, audio and aroma technologies transform original artworks from First Nations artists – including Emily Kame Kngwarreye, Albert Namatjira, Tommy Watson, Gabriella Possum Nungurrayi, Anna Pitjara and Lin Onus – into a powerfully rich and interactive celebration of Country, culture and community.\n\nThe artistic line-up showcases work from emerging and established artists, mainly from remote regions. It features a magnificent soundtrack by Indigenous musicians including William Barton, Yothu Yindi, Dr G Yunupingu, Emily Wurramara and Archie Roach.\n","trip":"Cowra 2022","place":"Australia","timezone":"Australia/ACT","location":"National Museum of Australia","title":"Day 3: National Museum of Australia (Connection)","description":"Songlines from Australia’s First Peoples in a spectacular immersive experience at the National Museum.","date":"2022-09-25T05:00:00.000Z","image":{"src":"/undefined/_astro/Connections (23).CgoJNsOY.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/cowra-2022/src/assets/gallery/3-connection/Connections (23).jpeg"},"map":[-35.29294,149.12083,17],"tags":["Canberra","National Museum","museum","Connection","event"]},{"id":"3-floriade.md","slug":"3-floriade","base":"/undefined/","collection":"post","body":"\n[Floriade](https://floriadeaustralia.com/) also returns back to normal after the COVID-19 lockdown! This year's theme is entitled \"The Sounds of Spring\".\n\nFloriade is a flower and entertainment festival held annually in Canberra's Commonwealth Park on the shores of Lake Burley Griffin. It features extensive displays of flowering bulbs with integrated sculptures and other artistic features.\n\nFloriade started in 1988 as a one off celebration of Canberra's 75th birthday and Australia's Bicentenary of European settlement. Due to the success and popularity of the event it has run with a new theme every year.\n\nDuring 2020, the Floriade festival was changed to a distributed event (with the bulbs spread over 100 separate sites across Canberra in an event dubbed _Floriade: Reimagined_) so this is the first time the festival is returning to it's traditional home Commomwealth Park.\n\nWe came in early and had no problems finding parking at a \"secret location\" very close to the park that I've discovered and very few people seem to know about.\n\nThe festival was really enjoyable although it was smaller than previous years. The highlight was meeting a group of Vietnamese ladies all dressed identically in yellow kaftans. They took me in as a long lost sister and we took a number of group photos together.\n","trip":"Cowra 2022","place":"Australia","timezone":"Australia/ACT","location":"Floriade","title":"Day 3: Canberra (Floriade)","description":"Floriade, Australia’s Biggest Celebration of Spring, returns to Commonwealth Park in Canberra.","date":"2022-09-24T23:00:00.000Z","image":{"src":"/undefined/_astro/Floriade 2022 (2).CtPhI1rW.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/cowra-2022/src/assets/gallery/3-floriade/Floriade 2022 (2).jpeg"},"map":[-35.2891,149.1333,16],"tags":["Canberra","Floriade","festival","flowers","Spring"]},{"id":"3-national-museum.md","slug":"3-national-museum","base":"/undefined/","collection":"post","body":"\nThe [National Museum of Australia](https://www.nma.gov.au) is about the rich and diverse stories of Australia through compelling objects, ideas and events. It focuses on Indigenous histories and cultures, European settlement and our interaction with the environment.\n\nAlthough it is one of Australia’s newest cultural institutions, the National Museum of Australia was almost 100 years in the making. Over the course of the 20th century, proposals for a national museum were intermittent, interrupted by wars and financial crises and stifled by government inaction.\n\nIn December 1996 the building of the Museum was announced as the key Centenary of Federation project, and Acton Peninsula was chosen as the site, with funding confirmed in 1997. The National Museum of Australia opened on 11 March 2001.\n\nI liked the 1955 FJ Holden Special sedan displayed with a pink caravan. This Holden Special Sedan was built in July 1955 and purchased new from Beazley & Bruce in Canberra. The original owner drove it regularly between Tharwa and Queanbeyan in NSW until, reportedly, she encountered new traffic lights in Queanbeyan, prompting her to return home, cancel her licence and never drive again. The pink Propert 'Trailaway' touring caravan was a unique example built by the company in 1956 for advertising purposes.\n\nThere is also a display of a classic 1970s synth - the Prophet 5 by Sequential Circuits. This was designed by Dave Smith and John Bowen in 1977, who used microprocessors, then a new technology, to create the first polyphonic synthesizer with fully programmable memory. It was used extensively by Michael Jackson in the _Thriller_ album and also Madonna in _Like A Virgin_.\n","trip":"Cowra 2022","place":"Australia","timezone":"Australia/ACT","location":"National Museum of Australia","title":"Day 3: National Museum of Australia","description":"After lunch we visited the National Museum of Australia, mainly to see Connection.","date":"2022-09-25T04:00:00.000Z","image":{"src":"/undefined/_astro/National Museum (4).BwTveyTw.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/cowra-2022/src/assets/gallery/3-national-museum/National Museum (4).jpeg"},"map":[-35.29294,149.12083,17],"tags":["Canberra","National Museum"]},{"id":"3-parliament-garden.md","slug":"3-parliament-garden","base":"/undefined/","collection":"post","body":"\nTill recently, the gardens surrounding Parliament House were not well known, even by Parliament House staff, let alone locals. When we first visited it, we were directed by security guards and we met a member of staff there who had worked for several years visiting it for the first time.\n\n[Parliament House](https://www.aph.gov.au/Visit_Parliament) is designed to be a part of the surrounding landscape. Its 33-hectare site includes 23 hectares of landscaping, ranging from areas evoking the Australian bush to turfed areas, and formal and semi-formal gardens with native and exotic plants—much of which you are welcome to explore.\n\nNine hectares of native gardens surround the eastern, southern and western side of Parliament House outside Parliament Drive. There are 4,500 trees and 135,000 shrubs and groundcovers growing in the landscape, many of which are indigenous to the Australian Capital Territory.\n\nThe design for the formal garden on the eastern side of Parliament House is inspired by English and French formal garden designs. In the centre is a traditional water feature, which creates gentle sound and movement in the space. The gardens surrounding the water feature displays of annuals with approximately 3,500 plants, which are changed in spring and autumn.\n\nThe Chinese lions can be found at the entrance to the formal gardens. Statues of guardian lions were traditionally installed at the entrances of imperial and government buildings in China. They are usually found in pairs, the male resting a paw on a ball and the female restraining a playful cub on its back.\n\nWhen we were there, the formal garden appeared to be under reconstruction.\n\nAfter that we saw lots of Indian people dressed colourfully for a festival. Mahalaya is an auspicious occasion observed seven days before the Durga Puja, and it heralds the advent of Durga, the goddess of supreme power. It's a kind of invocation or invitation to the mother goddess to descend onto earth, \"Jago Tumi Jago.\" This is done through the chanting of mantras and singing devotional songs.\n","trip":"Cowra 2022","place":"Australia","timezone":"Australia/ACT","location":"Parliament House","title":"Day 3: Canberra (Parliament House Garden)","description":"Our final stop of the day is the relatively little known Parliament House Garden.","date":"2022-09-25T06:00:00.000Z","image":{"src":"/undefined/_astro/Parliament House Garden (2).DoIeOJ2Z.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/cowra-2022/src/assets/gallery/3-parliament-garden/Parliament House Garden (2).jpeg"},"map":[-35.3076,149.1246,16],"tags":["Canberra","Parliament House","garden"]},{"id":"4-mcdonalds.md","slug":"4-mcdonalds","base":"/undefined/","collection":"post","body":"\nMcDonalds at Sutton Forest Northbound is a mandatory pit stop for us on the way back from Canberra. It is a good place to break the journey, and to have a much needed cup of coffee to revive the body.\n\nLooks like spring blossoms are here too and they represent a fitting end to our trip.\n","trip":"Cowra 2022","place":"Australia","timezone":"Australia/NSW","location":"McDonalds","title":"Day 4: McDonalds","description":"We stopped by at McDonalds Sutton Forest on the way home for a much needed cup of coffee.","date":"2022-09-26T04:00:00.000Z","image":{"src":"/undefined/_astro/McDonalds (2).Dt-pTP5I.jpeg","width":2560,"height":1920,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/cowra-2022/src/assets/gallery/4-mcdonalds/McDonalds (2).jpeg"},"map":[-34.60738,150.22607,18],"tags":["McDonalds","Sutton Forest"]},{"id":"4-tulip-top.md","slug":"4-tulip-top","base":"/undefined/","collection":"post","body":"\nFinal stop on the trip is a visit to beautiful [Tulip Top Gardens](https://www.tuliptopgardens.com.au/).\n\nThis place is a popular attraction, particularly for Asian tourists, during springtime. It features acres of stunning garden beds framed by weeping willows, and thouands of blossoms. Every year, almost a million tulips, daffodils and other flowers creatively planted providing a stunning and colourful vista for all garden lovers.\n\nThe garden was in full bloom and it’s such a joy to visit this after a 2 year hiatus due to COVID-19 lockdowns! Took so many photos, every corner and turn of the eye yielded an amazing view. The place was already packed when we arrived and this is without the usual busloads of Chinese tourists.\n","trip":"Cowra 2022","place":"Australia","timezone":"Australia/NSW","location":"Tulip Top Gardens","title":"Day 4: Tulip Top Gardens","description":"Last day of the trip! Some of us went outlet shopping, but we chose to go to Tulip Top Gardens","date":"2022-09-26T01:00:00.000Z","image":{"src":"/undefined/_astro/Tulip Top Gardens (58).4a9nkxue.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/cowra-2022/src/assets/gallery/4-tulip-top/Tulip Top Gardens (58).jpeg"},"map":[-35.1744,149.2726,15],"tags":["Tulip Top","garden","Spring"]}]