[{"id":"japan-2018.md","slug":"index.html","base":"/japan-2018/","collection":"trip","body":"We returned to Japan in 5-15 March 2018, mainly because Qantas was opening a route to Osaka and was offering a sale. Once again, the trip was organised by [Dan Campbell][1] of [InsideJapan Tours][2]. This time, we asked Dan to create an itinerary for us starting from Osaka, but then travelling south to Kyushu visiting Nagasaki, then returning back to Osaka with a day trip to Himeji.\n\nThe weather on this trip was a lot colder than on our previous trip because we visited slightly earlier before the cherry blossom season, but we still managed to see a few buds and on the last few days the weather warmed up a bit.\n\n| Day | Date | Location | Hotel | Itinerary |\n| ---: | :---- | :-------- | :----- | :--------- |\n| 0 | Mon 5 Mar | Sydney to Osaka | [Cross Hotel Osaka][3] | - Qantas QF33 SYD-KIX<br />- Train from Kansai Airport to Osaka (Nanba Nankai)|\n| 1| Tue 6 Mar | Osaka | [Cross Hotel Osaka][3] | - Amerikamura<br />- Shinsaibashi<br />- LEGO Piece of Peace Exhibition<br />- Dotonbori |\n| 2 | Wed 7 Mar | Osaka | [Cross Hotel Osaka][3] | - Namba Walk<br />- Namba Parks |\n| 3 | Thu 8 Mar | Osaka to Nagasaki| [Richmond Hotel][4] | - Subway Midosuji Line Namba to Shin Osaka<br />- Shinkansen from Shin Osaka to Hakata<br />- Limited Express from Hakata to Nagasaki<br />- Nagasaki |\n| 4 | Fri 9 Mar | Nagasaki| [Richmond Hotel][4] | - Gunkanjima<br />- Dejima Harbour<br />- Nagasaki Peace Park<br />- Atomic Bomb Hypocentre<br />- Peace Museum |\n| 5 | Sat 10 Mar | Nagasaki| [Richmond Hotel][4] | - Glover Garden<br />- Dutch Slope<br />- Historic Quarter<br />- Dejima<br />- Spectacles Bridge<br />- Teramachi<br />- Shianbashi |\n| 6 | Sun 11 Mar | Nagasaki to Huis Ten Bosch | [Hotel Nikko Huis Ten Bosch][5] | - Seaside Express from Nagasaki to Huis Ten Bosch<br />- Huis Ten Bosch |\n| 7 | Mon 12 Mar | Huis Ten Bosch | [Hotel Nikko Huis Ten Bosch][5] | Huis Ten Bosch |\n| 8 | Tue 13 Mar | Huis Ten Bosch to Osaka | [The Ritz-Carlton Osaka][6] | - Seaside Express from Huis Ten Bosch to Nagasaki<br />- Limited Express from Nagasaki to Hakata<br />- Shinkansen from Hakata to Shin-Osaka<br />- JR train from Shin-Osaka to Osaka<br />- Osaka |\n| 9 | Wed 14 Mar | Himeji | [The Ritz-Carlton Osaka][6] | - JR train from Osaka to Shin-Osaka<br />- Shinkansen from Shin-Osaka to Himeji<br />- Himeji |\n| 10 | Thu 15 Mar | Osaka to Sydney | Home | Qantas QF34 from Kansai International Airport to Sydney |\n\n [1]: https://www.insidejapantours.com/about-us/staff-profiles/travel-consultants/139/dan-campbell/\n [2]: https://www.insidejapantours.com\n [3]: https://osaka.crosshotel.com/\n [4]: http://nagasaki.richmondhotel.jp/\n [5]: https://www.okura-nikko.com/japan/nagasaki/hotel-nikko-huis-ten-bosch/\n [6]: http://www.ritzcarlton.com/en/hotels/japan/osaka\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Japan","title":"Japan 2018","description":"We returned to Japan in 5-15 March 2018, and started from Osaka, then south to Kyushu visiting Nagasaki, ending with a day trip to Himeji.","date":"2018-03-15T22:00:59.000Z","image":{"src":"/japan-2018/_astro/trip.0092a5f1.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"tags":["Oceania"]},{"id":"01-dotonbori.md","slug":"01-dotonbori","base":"/japan-2018/","collection":"post","body":"In the afternoon, we mainly wandered around the Dotonbori (道頓堀) area. This is a&nbsp;popular nightlife and entertainment area characterized by its eccentric atmosphere and large illuminated signboards.\n\nWe saw most of the famous attractions here, including the Glico running man billboard, the kani doraku crab, and the blowfish lantern.\n\nWe lso walked along another covered shopping street 相合橋筋商店街 which was very reminiscent of Blade Runner &#8211; lots of cyclists wearing black whizzed past us and the shops all looked a bit seedy and run down.\n\nHad dinner at Chibo which is an okonomiyaki restaurant but we didn&#8217;t really feel like eating okonomiyaki so we ordered pork omelette and mixed yakisoba.\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Dotonbori","title":"Day 1: Osaka (Dotonbori)","description":"The Dotonbori (道頓堀) area is a popular nightlife and entertainment area with an eccentric atmosphere and large illuminated signboards.","date":"2018-03-06T07:00:53.000Z","image":{"src":"/japan-2018/_astro/Chris_ bicycle.c495308f.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[34.669,135.5016,16],"tags":["dinner","Dotonbori","Japan","Osaka"]},{"id":"01-lego-piece-of-peace.md","slug":"01-lego-piece-of-peace","base":"/japan-2018/","collection":"post","body":"Whilst we were at the Daimaru department store at Shinsaibashi, we noticed it was hosting an exhibition called LEGO Piece of Peace World Heritage Exhibition, so we decided to visit it. It&#8217;s basically a collection of LEGO models of World Heritage sites and buildings, including the Sydney Opera House but also featuring many models from neighbouring Asian countries including the Great Wall of China and the Taj Mahal but also the bandstand from Singapore Botanic Gardens. I had a chat with one of the exhibition attendees and told her I would love to visit all the sites in real life (in my best Japanese).\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"LEGO Exhibition","title":"Day 1: Osaka (LEGO Piece of Peace Exhibition)","description":"We attended the LEGO Piece of Peace World Heritage Exhibition at Daimaru. It showcases LEGO models of World Heritage sites and buildings.","date":"2018-03-06T03:00:47.000Z","image":{"src":"/japan-2018/_astro/The Earth.3f273b58.jpeg","width":2560,"height":1921,"format":"jpg","orientation":1},"map":[34.67319,135.50095,18],"tags":["exhibition","Japan","LEGO","Osaka","Shinsaibashi"]},{"id":"01-shinsaibashi.md","slug":"01-shinsaibashi","base":"/japan-2018/","collection":"post","body":"We arrived the previous day having from on Qantas business class (yes, we splurged out) from Sydney to Kansai International Airport. The plane departed late because of a sick passenger. When we arrived, the immigration hall was full of people and there was a large queue. The immigration officer was impressed when I said in my best Japanese &#8220;宜しくお願いいたします&#8221; I did notice a body temperature scanner so I was quite relieved when I got through as I didn&#8217;t feel too well (but I probably didn&#8217;t have a fever).\n\nOnce we exited baggage and customs, we were greeted by a representative from InsideJapan tours. She guided us to the train station where she purchased tickets on the Nankai Airport Line. She said it was too late for the Rapi:t Express so we just went on the normal Airport Express train which stops at 12 stations. The journey did not take too long, but the train was quite crowded and I had to stand most of the way.\n\nOnce we reached Namba (難波) Station, we walked along the Midosuji (御堂筋), Osaka&#8217;s famous boulevard that connects all the major central shopping districts. It was freezing cold and we were shivering but fortunately The Cross Hotel wasn&#8217;t too far and was on our right pretty soon after crossing Dotonbori (道頓堀) Bridge which crosses the famous canal. The hotel is fairly modern and the rooms are quite pleasant.\n\nWoke up 6:30am really hungry. The breakfast at the Cross Hotel was really impressive, with a good selection of Japanese vegetable dishes. I particularly liked the octopus linguine and sausage.\n\nWe then headed out along Midosuji towards Amerikamura (literally, &#8220;American village&#8221;). According to the itinerary, we are actually supposed to be visiting the Tezuka Osamu Manga Museum, but I wasn&#8217;t feeling so well, so we decided just to walk around the neighbourhood.\n\nWe visited the Apple Store, then walked to Triangle Park. A lot of the stores were still closed as it was too early. We then headed to the underground mall connecting the Shinsaibashi and Nagahoribashi stations (called Crysta Nagahori).&nbsp;Discovered a good 100 yen shop called Seria, also visited 3coins+ &#8211; a 300 yen shop. Bought some stockings and underwear from a lingerie shop.\n\nWe had lunch at Tenya Akasuka Tendon &#8211; a chain of restaurants serving delicious but cheap tempura with rice or udon. We have eaten at the original store in Asakusa, Tokyo, in our Japan 2017 trip so I knew the food was good. I had the All Star which consists of fish, prawn, green bean, mushroom, scallop together with rice and miso soup.\n\nAfter Crysta Nagahori, we walked down Sakaisuji Avenue, bought some water from Family Mart convenience store. I always love visiting Family Mart because it was featured in Whisper of the Heart, a Studio Ghibli anime film.\n\nWe then walked along Suomachi-dori (Europe-dori) but it was quite boring most of the shops were closed. Discovered a cat cafe and astrological themed manholes here. Of course I had to take a photo of the Leo manhole.\n\nWe then walked along Shinsaibashisuji shopping street. This is basically a covered lane way with shops on both sides. There is a Sanrio Gallery here as well as Uniqlo. I also discovered a pachinko parlour called surprisingly Atariya.\n\nWe then walked all the way to Semba Centre which is a mall under the Chuo-odori elevated freeway and returned back to Shinsaibashisuji and stepped into the Daimaru department store (see next post).\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Shinsaibashi","title":"Day 1: Osaka (Amerikamura, Shinsaibashi)","description":"Day 1 in Osaka. We walked around the Shinsaibashi area, starting from Midosuji towards Amerikamura, then Europe-dori and the shopping street.","date":"2018-03-06T01:00:30.000Z","image":{"src":"/japan-2018/_astro/Atariya.6ba9b3d4.jpeg","width":2560,"height":1921,"format":"jpg","orientation":1},"map":[34.6745,135.5004,14],"tags":["Amerikamura","city","Japan","Osaka","Shinsaibashi","shopping"]},{"id":"02-namba-parks.md","slug":"02-namba-parks","base":"/japan-2018/","collection":"post","body":"We then visited Namba City, the shopping mall attached to Namba Station. There is a large Uniqlo and a large bookshop here. We then walked to Namba Park, another huge (and rather posh) shopping centre with an interesting architecture &#8211; there&#8217;s a terraced rooftop garden and you can literally walk down one side of the mall. The centre of the mall is a large artificial canyon. We had an early dinner upstairs at a restaurant specialising in fried rice called Canton Fried rice restaurant or 広東茶華店. We ordered two fried rice, which is basically their two most popular dishes &#8211; a bacon and cheese fried rice, a prawn and vegetables fried rice in some sort of gravy (very similar to Hokkien fried rice) and a Ma Po tofu mini pot. The meal was quite filling.\n\nAfter dinner, we wanted down the floors of Namba Park. There is a good stationery shop here. We then walked back to the hotel but stopped to take a few pictures at Dotonbori bridge along the way.\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Namba Parks","title":"Day 2: Osaka (Namba Parks)","description":"We visited Namba City, next to Namba Station, and then walked to Namba Parks, another huge shopping centre with an interesting architecture.","date":"2018-03-07T07:00:40.000Z","image":{"src":"/japan-2018/_astro/Canyon (2).b54430a9.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[34.66168,135.50194,17],"tags":["city","Japan","Namba","Namba Parks","Osaka","shopping"]},{"id":"02-namba-walk.md","slug":"02-namba-walk","base":"/japan-2018/","collection":"post","body":"Woke up late &#8211; around 7:30. We are still not feeling too well, so we decided to spend most of the day shopping indoors in shopping centres to avoid the cold weather outside.\n\nTopped up our Manaca cards, and did a trial run from Namba station to Shin-Osaka on the Midosuji subway line to exchange our Japan Rail pass vouchers and reserve Shinkansen tickets. There&#8217;s not much to see in Shin Osaka apart from restaurants, so returned back to Namba station, and had lunch at Tenya Akasuka Tendon again (another shop very close to Dotonbori Bridge). This time had the tendon, which consists of whitebait, prawn, green bean, pumpkin\n\nAfter lunch, we visited Namba Walk &#8211; an underground mall that looks like it has seen better days. They have a Hello Kitty spring promotion, but it hasn&#8217;t started yet, and most of the shops are closed. We took some photos anyway around the Hello Kitty signage.\n\nAfter that we visited Bic Camera, which has 14 floors and a pachinko parlour in the basement. Despite the name, Bic Camera is more like an electronics superstore (actually, they even sell food, cosmetics, even whitegoods). Yes, they actually still do sell cameras, but they only occupy a small section of one floor. Bought some goodies here, including bicycle lights from Cateye, a pink bicycle lock, Hello Kitty luggage tag, Hazuki reading glasses, Artisan and Artist camera strap.\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Namba Walk","title":"Day 2: Osaka (Namba Walk)","description":"Namba Walk is an underground mall that looks like it has seen better days. They have a Hello Kitty spring promotion so we took photos.","date":"2018-03-07T02:00:54.000Z","image":{"src":"/japan-2018/_astro/Chris_ dog.16d6d3a6.jpeg","width":2560,"height":1921,"format":"jpg","orientation":1},"map":[34.66707,135.50231,17],"tags":["city","Japan","Namba","Namba walk","Osaka","shopping"]},{"id":"03-osaka-to-nagasaki.md","slug":"03-osaka-to-nagasaki","base":"/japan-2018/","collection":"post","body":"Today is a rainy day, which is perfect for travelling. We woke up early at 5am to ensure we don&#8217;t miss the train, had breakfast at 7am when the restaurant opened, and checked out by 8:30am.\n\nWe caught the Midosuji subway from Namba station to Shin Osaka and it was packed. We went via the womens carriage. We arrived quite early at Shin Osaka, around 9am and tried to change to an earlier train but was told it was full so we just waited for the 10:09 train.\n\nWe spent a pleasant journey on the Shinkansen and glad we were not outdoors because it was bleak and wet outside. We originally wanted to stop at Hakata and do a quick walk around the station but because of the weather we decided to continue our journey on the next available train. We went through the transfer gate to the JR limited express line to Nagasaki.\n\nThe scenery on the coastal rail line from Hakata to Nagasaki was really beautiful. On the left side I can see the sea and the right consisted of rolling hills, farmland and beautiful villages with the traditional Chinese style roofs.\n\nWe arrived at Nagasaki close to 3pm and the rain has stopped. We went on a pedestrian overpass to catch the No. 1 streetcar to the hotel.\n\nWe noticed that Nagasakians look more &#8220;Chinese&#8221; than in other Japanese cities, perhaps because of the long history of Chinese trading and settlement in the city.\n\nOur hotel is called the Richmond Hotel and is located at Shianbashi (思案橋), which is a historical district and originally a red light district but is now full of nightclubs, liquor shops and karaoke bars. The hotel is very posh, and gave us everything we need (including a full complement of skincare including facial masks)\n\nWe were hungry as we did not have lunch so we ventured out for a walk to find a place to eat. Everything is closed during the day around the hotel but we eventually discovered Hamanomachi &#8211; another covered shopping street similar to the one in Osaka.\n\nFound a fantastic stationery shop selling a lot of fountain pens. Perved over all the different models, and bought two pen cases.\n\nFor dinner we debated whether to have pasta or try a local dish called トルコライス (Turkish rice). We decided to go for the latter. It was very unusual &#8211; a combination of Neapolitan spaghetti, curried pilaf fried rice, and your choice of topping (hamburg meat, tonkatsu etc.). I chose the mix platter consisting of hamburg, boiled egg and ebi fry.\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Richmond Hotel","title":"Day 3: Osaka to Nagasaki","description":"Today is a rainy day, which is perfect for travelling from Osaka to Nagasaki. We arrived at 3pm and checked in to the Richmond Hotel.","date":"2018-03-08T07:00:50.000Z","image":{"src":"/japan-2018/_astro/Inside tram.ceb3b3a8.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[32.74185,129.87985,18],"tags":["Japan","Nagasaki","Osaka","Shinkansen","train"]},{"id":"04-dejima-harbour.md","slug":"04-dejima-harbour","base":"/japan-2018/","collection":"post","body":"We walked through the [Nagasaki Seaside Park][1]. This offers views of Dejima Harbour and incoming boats, plus open space for walking, jogging and picnics. The Japanese name for this park is a mouthful: mizubenomorikouen (長崎水辺の森公園). The [Nagasaki Prefectural Art Museum][2] is also nearby.\n\nWe finally ended up in [Nagasaki Dejima Wharf][3], which has a number of restaurants. We had champon for lunch at [Ringer Hut][4], a chain of restaurants originated from Nagasaki and specialising in two Nagasaki dishes: champon (Chinese soupy noodles) and saraudon (Chinese style fried noodles). The name Ringer Hut supposedly is an amalgamation of Ringer House (now part of Glover Garden &#8211; a popular tourist attraction) and Pizza Hut. Ringer House was the residence of Frederick Ringer, a British merchant and founder of the Nagasaki Press. The lunch was absolutely delicious and filling.\n\n [1]: http://www.mizubenomori.jp\n [2]: https://www.nagasaki-museum.jp\n [3]: http://dejimawharf.com/\n [4]: http://www.ringerhut.co.jp","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Dejima Harbour","title":"Day 4: Nagasaki (Dejima Harbour)","description":"We walked through the Nagasaki Seaside Park. This offers views of Dejima Harbour and incoming boats, plus open space.","date":"2018-03-09T03:00:04.000Z","image":{"src":"/japan-2018/_astro/Chris Dejima Harbor.98b03664.jpeg","width":2560,"height":1920,"format":"jpg","orientation":1},"map":[32.7437,129.8698,16],"tags":["Dejima Harbour","Japan","Nagasaki"]},{"id":"04-gunkanjima.md","slug":"04-gunkanjima","base":"/japan-2018/","collection":"post","body":"Today we had a nice breakfast at the hotel. Highlights in the breakfast selection included grilled horse mackerel, siu mais, steamed gyozas and even mini saraudon bowls (皿うどん).\n\nWe bought a day pass for the streetcar, and caught the No 1, followed by No 5 cars to Ourakaigandori (大浦海岸通り), which is close to Nagasaki Port, and we queued up for the cruise boat to Gunkanjima.\n\nWe were told that the seas were rough today and the boat may not be able to land on the island, but the captain will make a decision once we reach there.\n\nThe tour commentary was in Japanese, which I barely understood. An English audio guide via a headset was available, but I didn&#8217;t really bother listening to it as my unit was only functioning intermittently. I am afraid I got into some trouble with the staff as I kept getting up to take photos and they kept asking me to sit down. We left Nagasaki port, and the commentary focused on describing the historical sites around Nagasaki (such as the crane, the dock and the guest house), as well as the Mitsubishi plant.\n\nWe passed through two bridges, one is the beautiful Megame Ohashi or Megamio Bridge (女神大橋), the other is Iojimao bridge (伊王島大橋).\n\nWe eventually reached Gunkanjima, and the boat circumnavigated across the island whilst everyone took photos and videos. Eventually, the waves magically settled down and the captain decided to attempt a landing. We got off the boat, and walked to the southern tip of the island along a concrete pathway.\n\nGunkanjima (Battleship Island) was originally called Hashima and lies around 4.5km west of the Nagasaki peninsula, 2.5km southwest of the Mitsubishi Mining Company&#8217;s main coalmine on the island of Takashima, and 19km southwest of Nagasaki harbor. It is a tiny island with a seabed coalmine. It measures 480m north to south and 160m east to west, with a circumference of 1,200m and an area of 63,000m2. The island is surrounded by a sea wall, and has multi-storey reinforced concrete apartments, giving it the appearance of the warship Tosa. For this reason it has become known as &#8220;Gunkanjima&#8221; (Battleship Island). After the mine was closed, the island was deserted and fell silent for many years.\n\nIn recent years, the island has gained notoriety as it was featured in the James Bond film Skyfall. As a result, boatloads of tourists visit it everyday.\n\nGunkanjima is beautiful in a sort of haunting eerie way and I took lots of photos. I didn&#8217;t really like the enforced gaiety of the commentary from the tour guides and I would have preferred a more contemplative and reflective tone.\n\nWe didn&#8217;t spend that long on the island but there wasn&#8217;t much to see anyway as they did not allow us to veer off the pathway. I would have liked to explore the abandoned living quarters in the north of the island but I understand it&#8217;s a safety issue and they don&#8217;t really want thousands of tourists trampling all over the place.\n\nThe boat eventually returned back to the port, and I discovered my pocket Wi Fi battery has drained completely, so we were forced to navigate without Apple Maps.\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Gunkanjima","title":"Day 4 Gunkanjima","description":"Gunkanjima (Battleship Island) was originally called Hashima with a seabed coalmine. After the mine was closed, the island fell into ruin.","date":"2018-03-09T01:00:33.000Z","image":{"src":"/japan-2018/_astro/Gunkanjima (2).dc3f6828.jpeg","width":2560,"height":1440,"format":"jpg","orientation":1},"map":[32.6277,129.7383,16],"tags":["attraction","Gunkanjima","historic","island","Japan"]},{"id":"04-nagasaki-atomic-bomb-hypocentre.md","slug":"04-nagasaki-atomic-bomb-hypocentre","base":"/japan-2018/","collection":"post","body":"We also visited the atomic bomb hypocentre, which had concentric circles marked around it like a bullseye target, and the nearby remains of the Urakami church which was destroyed by the blast. On the 9th of August 1945, at 11:02 A.M., a B29 airplane dropped the nuclear bomb. It exploded 500m above the hypocentre. Looking at it now, it is hard to imagine the destruction that must have happened on that day.\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Atomic Bomb Hypocentre","title":"Day 4: Nagasaki (Atomic Bomb Hypocentre)","description":"The Atomic Bomb Hypocentre has concentric circles marked around it like a bullseye target, next to the nearby remains of the Urakami church.","date":"2018-03-09T05:00:36.000Z","image":{"src":"/japan-2018/_astro/Hypocenter.d5f8ed4d.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[32.7732,129.8632,16],"tags":["Atomic Bomb Hypocentre","attraction","historic","Japan","Nagasaki"]},{"id":"04-nagasaki-peace-museum.md","slug":"04-nagasaki-peace-museum","base":"/japan-2018/","collection":"post","body":"We also visited the Peace Museum, which was similar to the one in Hiroshima but on a smaller scale. I liked the animated reenactment of the bombing, and also the replica of the Fatman bomb that destroyed the area around the Mitsubishi Arms factory north of Nagasaki (but fortunately left most of the city centre intact).\n\nWe returned back to Shianbashi via streetcar No. 1 and had dinner at Doutour in Hamanomachi (two rolls &#8211; mine was prawn and avocado).\n\n![Doutour](../../assets/gallery/04-nagasaki-peace-museum/Doutour.jpeg)\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Nagasaki Peace Museum","title":"Day 4: Nagasaki Peace Museum","description":"We also visited the Nagasaki Peace Museum, which was similar to the one in Hiroshima but on a smaller scale.","date":"2018-03-09T06:00:14.000Z","image":{"src":"/japan-2018/_astro/National Peace Memorial Hall (1).8fca07cf.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[32.77252,129.86438,18],"tags":["attraction","Japan","museum","Nagasaki","Peace Museum"]},{"id":"04-nagasaki-peace-park.md","slug":"04-nagasaki-peace-park","base":"/japan-2018/","collection":"post","body":"After lunch, we took the No. 1 streetcar to visit the Nagasaki Peace Park.\n\nNagasaki Peace Park is built on a low hill to the north of the hypocenter of the atomic bomb blast. It was created to represent the wish for world peace and a vow that such a tragic war would never be repeated. The park features the 9.7-meter-high impressive Peace Statue symbolizing the Nagasaki citizens&#8217; wish for peace. Sculptor Seibou Kitamura, a Nagasaki native, created this statue as a symbol of the divine love and mercy of Buddha. The raised right hand points to the heavens to signify the threat of atomic weapons while the left arm is raised horizontally to represent the wish for peace. The figure&#8217;s eyes are lightly closed in prayer for the souls of the atomic bomb victims. Every year on August 9, the anniversary of the atomic bombing, a peace memorial ceremony is conducted in front of this statue and a peace declaration is made to the people of the world. The park also features the Fountain of Peace, which was built in remembrance of a little girl who wandered in search of water. There are many monuments, statues and sculptures in the park donated by various cities around the world.\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Nagasaki Peace Park","title":"Day 4: Nagasaki Peace Park","description":"Nagasaki Peace Park is built on a low hill to the north of the hypocentre of the atomic bomb blast, and features the Peace Sculpture.","date":"2018-03-09T04:00:30.000Z","image":{"src":"/japan-2018/_astro/Peace Statue.9b670e48.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[32.77593,129.86364,17],"tags":["attraction","Japan","Nagasaki","park","Peace Park"]},{"id":"05-dejima.md","slug":"05-dejima","base":"/japan-2018/","collection":"post","body":"Dejima was (and has since been reconstructed) as an artificial island built using reclaimed land from the port of Nagasaki. It was used to quarantine foreign traders (Portuguese, then Dutch) during the Edo period of the Tokugawa Shogunate. Later on, it was integrated into Nagasaki through land reclamation and became land-locked and the original boundaries completely obscured.\n\nMore recently, extensive restoration works have tried to recreate the original island and restore or rebuild the original buildings. When we visited, we were impressed by the amount of work done. There is a mini-Dejima scale model of the island so we can have a good understanding of what the island looked like during it&#8217;s heyday, and the current version contains many of the same elements. Many of the buildings were open and are effectively museums containing many artefacts from the trading history of Nagasaki.\n\nAll in all, I really enjoyed the visit.\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Dejima","title":"Day 5: Nagasaki (Dejima)","description":"Dejima was used to quarantine foreign traders (Portuguese, then Dutch) during the Edo period of the Tokugawa Shogunate.","date":"2018-03-10T04:00:46.000Z","image":{"src":"/japan-2018/_astro/Miniature Dejima (6).7ab459d7.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[32.74334,129.8729,18],"tags":["Dejima","historic","island","Japan","Nagasaki"]},{"id":"05-dutch-slope.md","slug":"05-dutch-slope","base":"/japan-2018/","collection":"post","body":"After Glover Garden, we visited the Dutch slope. This strangely named &#8220;tourist attraction&#8221; really is what it seems &#8211; it&#8217;s just a sloping road leading up to a hill where there are many historical Western style houses belonging to foreign traders.\n\nThe area is actually called Higashi-Yamate Machi and contains the Kwassui Gakuin School and Kaisei Gakuen School.\n\nOne of the buildings that was open to the public is the former Latin Divinity School. A Japanese man spent a long time explaining the history of the building to us in Japanese which I only understood partly.\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Dutch Slope","title":"Day 5: Nagasaki (Dutch Slope)","description":"The strangely named \"Dutch Slope\" is a sloping road leading up to a hill where there are historical Western style houses.","date":"2018-03-10T01:00:54.000Z","image":{"src":"/japan-2018/_astro/Japan 2018 Day 5 - Dutch Slope (1).763c089b.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[32.73823,129.87312,18],"tags":["Dutch Slope","historic","Japan","Nagasaki"]},{"id":"05-glover-garden.md","slug":"05-glover-garden","base":"/japan-2018/","collection":"post","body":"After breakfast, we took the streetcar to Ouratenshudoshita stop to visit the historical foreign settlement sites of Nagasaki. The biggest and most famous attraction in this area is Glover&#8217;s Garden.\n\nDespite the name, this is less of a formal garden and more a collection of historical houses. We really enjoyed it and it gave us a sense of the history of foreign trading in Nagasaki.\n\nGlover Garden is situated on the southern slope of the Minamiyamate hillside and offers a superb and extensive view of Nagasaki Harbour. The gardens feature the former Glover Residence, which, in addition to the gardens, was donated to the city of Nagasaki in 1957 by the Nagasaki Shipyard of Mitsubishi Heavy Industries and opened to the public. Eventually, six other Western-style residences from the Meiji era that had been built throughout the city were dismantled, moved, reconstructed and restored as important national cultural properties on this site of former foreign settlements. They joined the former Glover Residence, the former Ringer Residence (built for Frederick Ringer), and the former Alt Residence (built for William Alt) on the site.\n\nInside the gardens, one can tour the Thomas Blake Glover Residence, Japan&#8217;s oldest wooden Western-style residence. Through his trading businesses, Glover contributed much to Japan&#8217;s modernisation in shipbuilding, coal mining, and other fields. It was built by Hidenoshin Koyama of Amakusa island and completed in 1863. The house and garden evokes Puccini&#8217;s opera Madama Butterfly and the house is sometimes called Madame Butterfly House. There is a statue of Puccini in the park.\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Glover Garden","title":"Day 5: Nagasaki (Glover Garden)","description":"Glover Garden is situated on the southern slope of the Minamiyamate hillside and offers a superb and extensive view of Nagasaki Harbour.","date":"2018-03-09T23:00:17.000Z","image":{"src":"/japan-2018/_astro/Glover House (16).9e918013.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[32.73336,129.86925,17],"tags":["garden","Glover Garden","historic","Japan","Nagasaki"]},{"id":"05-nagasaki-historic-quarter.md","slug":"05-nagasaki-historic-quarter","base":"/japan-2018/","collection":"post","body":"In addition to Glover Garden and the Dutch Slope, we also explored various places around Oura Machi and Minami Yamate-Machi. This included the former Hong Kong and Shanghai Bank Nagasaki Branch Building &#8211; an imposing three storey building with an imposing staircase and distinct Chinese architecture style &#8211; its&#8217; constructed in 1904.\n\n![Hong Kong and Shanghai Bank](../../assets/gallery/05-nagasaki-historic-quarter/Hong_Kong_and_Shanghai_Bank_7.jpeg)\n\nInteresting buildings around the Glover Garden includes:\n\n- the Inori-no-oka Picture Book Museum\n  ![Inori-no-oka Picture Book Museum](../../assets/gallery/05-nagasaki-historic-quarter/Chris,Inori_no_oka_Picture_book_museum.jpeg)\n- a &#8220;Penny and Dime&#8221; shop\n  ![Penny and Dime shop](../../assets/gallery/05-nagasaki-historic-quarter/Zippo.jpeg)\n- Glover&#8217;s House\n  ![Glover's House](../../assets/gallery/05-nagasaki-historic-quarter/Glovers_House.jpeg)\n- St. Kolbe&#8217;s (first house in Nagasaki)\n  ![St. Kolbe](../../assets/gallery/05-nagasaki-historic-quarter/St_Kolbes.jpeg)\n- a magnificent Koban (police box).\n  ![Koban](../../assets/gallery/05-nagasaki-historic-quarter/Koban.jpeg)\n\nWe also visited the Oura Cathedral (although the church exterior was in restoration whilst we were there).\n\n![Oura Cathedral](../../assets/gallery/05-nagasaki-historic-quarter/Oura_Cathedral.jpeg)\n\nWe had a quick look at the exterior of the Confucian Shrine but didn&#8217;t want to pay the admission fee.\n\n![Confucian Shrine](../../assets/gallery/05-nagasaki-historic-quarter/Confucian_Shrine_and_museum.jpeg)\n\nWe then passed through the interestingly shaped Showa Kai Hospital, as well as the former British Consulate building (now derelict).\n\n![Showa Kai Hospital](../../assets/gallery/05-nagasaki-historic-quarter/Showakai_Hospital.jpeg)\n\n![former British Consulate](../../assets/gallery/05-nagasaki-historic-quarter/Former-British_Consulate_1.jpeg)\n\nWe ended up in Chinatown where we had delicious saraudon at one of the oldest restaurants there, Kairakuen (会楽園).\n\n![Chinatown](../../assets/gallery/05-nagasaki-historic-quarter/Chinatown_Gate.jpeg)\n\n![Kairakuen](../../assets/gallery/05-nagasaki-historic-quarter/Kairakuen.jpeg)","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Nagasaki Historic Quarter","title":"Day 5: Nagasaki (historic quarter)","description":"We also explored various places around the Nagasaki historic quarter including Oura Machi and Minami Yamate-Machi.","date":"2018-03-10T02:00:31.000Z","image":{"src":"/japan-2018/_astro/Hong_Kong_and_Shanghai_Bank_7.ac3685ce.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[32.7406,129.8717,16],"tags":["city","historic","Japan","Nagasaki"]},{"id":"05-shianbashi.md","slug":"05-shianbashi","base":"/japan-2018/","collection":"post","body":"For dinner we took the streetcar to Nagasaki station to the nearby Amu Plaza. I had a simple dish of seafood broth. After that we explored Tokyo Hands and headed back and had a quick stroll around the Shianbashi area before returning to the hotel to pack as we are checking out the following morning.\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Shianbashi","title":"Day 5: Nagasaki (Shianbashi)","description":"Shianbashi is Nagasaki's nightlife area (and former red light district). At night, it comes alive with little restaurants and snack bars.","date":"2018-03-10T09:00:43.000Z","image":{"src":"/japan-2018/_astro/Shianbashi.5fd423db.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[32.74262,129.8806,18],"tags":["city","historic","Japan","Nagasaki","Shianbashi"]},{"id":"05-spectacles-bridge.md","slug":"05-spectacles-bridge","base":"/japan-2018/","collection":"post","body":"After lunch we visited the &#8220;Spectacles Bridge&#8221; &#8211; another popular tourist attraction.\n\nIt is&nbsp;Japan&#8217;s first Chinese-style stone bridge constructed in 1634, by Mokusunyoujo, the second-generation Chinese monk of Kofukuji Temple, Japan&#8217;s oldest Chinese Temple. The bridge gets its name from its resemblance to a pair of spectacles when the arches of the bridges are reflected as ovals on the surface of the river.\n\nThis bridge, along with Edo&#8217;s Nihonbashi Bridge and Iwakuni&#8217;s Kintaikyou Bridge, are considered the three most famous bridges in Japan. Although it is not well known, Spectacles Bridge was the inspiration for the Double Bridge of the Imperial Palace. By the end of the 17th century, following the construction of the Spectacles Bridge, numerous stone bridges were built for many of the roads that join the Nakashima River.\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Spectacles Bridge","title":"Day 5: Nagasaki (Spectacles Bridge)","description":"Spectacles Bridge is Japan's first Chinese-style stone bridge and one of Japan's Top 3 most well known bridges.","date":"2018-03-10T05:00:29.000Z","image":{"src":"/japan-2018/_astro/Spectacles Bridge.4dec6a52.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[32.74724,129.88042,19],"tags":["bridge","historic","Japan","Nagasaki","Spectacles Bridge"]},{"id":"05-teramachi.md","slug":"05-teramachi","base":"/japan-2018/","collection":"post","body":"In the late afternoon, we caught a streetcar to Suwajinjamae and crossed the Nakashima River to visit Teramachi. The name literally means &#8220;Temple town&#8221; and it is a street full of &#8230; temples. Each temple is different, and the experience visiting all of them is almost overwhelming.\n\n![Map](../../assets/gallery/05-teramachi/Map.jpeg)\n\nWe took a stroll through Teramachi to admire the beautiful shrines and temples located there. Some were closed, and only one (Kokufuji) charged admission which we skipped as it was almost closing time.\n\nFor dinner we took the streetcar to Nagasaki station to the nearby Amu Plaza. I had a simple dish of seafood broth. After that we explored Tokyo Hands and headed back and had a quick stroll around the Shianbashi area before returning to the hotel to pack as we are checking out the following morning.","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Teramachi","title":"Day 5: Nagasaki (Teramachi)","description":"In the late afternoon, we caught a streetcar to Suwajinjamae and crossed the Nakashima River to visit Teramachi. The name literally means \"Temple town\" and it is a street full of ... temples. Each temple is different, and the experience visiting all of them is almost overwhelming.","date":"2018-03-10T07:00:51.000Z","image":{"src":"/japan-2018/_astro/Joanji (1).03c72d21.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[32.7472,129.8843,16],"tags":["city","Japan","Nagasaki","temple","Teramachi"]},{"id":"06-amsterdam-square.md","slug":"06-amsterdam-square","base":"/japan-2018/","collection":"post","body":"This evokes the famous Dam Square with a building in the centre that is vaguely reminiscent of the Royal Palace / former Town Hall but is actually the Stut House. In front is a flower clock and on the rear are some tulip beds. Nearby is a shopping centre called The Passage and there is a secondary area with a carrousel, a European village (mainly selling beer) and giant clogs which make good photo opportunities.\n\nWe also saw people cycling around and took a photo with a giant Miffy.\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Huis Ten Bosch","title":"Day 6: Huis Ten Bosch (Amsterdam Square)","description":"The Amsterdam Square in Huis Ten Bosch evokes the famous Dam Square with a European village adjacent to it.","date":"2018-03-11T04:00:39.000Z","image":{"src":"/japan-2018/_astro/Flower windmill.9811b0ab.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[33.0859,129.7889,15],"tags":["attraction","Huis Ten Bosch","Japan","theme park"]},{"id":"06-canal-cruise.md","slug":"06-canal-cruise","base":"/japan-2018/","collection":"post","body":"Our next stop is Canaltown where we boarded a cruiser that takes us on a journey along the artificial canal built around the theme park all the way to Tower City where a replica of the Domtoren is. The cruise passes through some interesting residential areas (all built to resemble European houses) that are actually not part of the theme park itself.\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Huis Ten Bosch","title":"Day 6: Huis Ten Bosch (Canal Cruise)","description":"We boarded a cruiser at Canaltown that took us on a canal cruise all the way to Tower City where a replica of the Domtoren is.","date":"2018-03-11T01:30:05.000Z","image":{"src":"/japan-2018/_astro/Wassenaar (6).08596a27.jpeg","width":2560,"height":1440,"format":"jpg","orientation":1},"map":[33.0859,129.7889,15],"tags":["attraction","boat","Huis Ten Bosch","Japan","river","theme park"]},{"id":"06-domtoren.md","slug":"06-domtoren","base":"/japan-2018/","collection":"post","body":"After the canal cruise, we docked at the base of the replica of Domtoren &#8211; the famous church tower in Utrecht. There is a &#8220;cheap&#8221; food court (by theme park standards) and we had a nice tempura lunch here &#8211; it was just enough after our heavy breakfast.\n\nWe then headed up to the Domtoren observation deck. From here we can see a bird&#8217;s eye view of the entire theme park and it&#8217;s quite amazing how extensive it is and how &#8220;European&#8221; it looks compared to the rest of Japan.\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Huis Ten Bosch","title":"Day 6: Huis Ten Bosch (Domtoren)","description":"The replica of Domtoren (the famous church tower in Utrecht) at Huis Ten Bosch has an observation deck with great 360 degree views.","date":"2018-03-11T02:00:03.000Z","image":{"src":"/japan-2018/_astro/Domtoren (1).6eaf4d40.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[33.0859,129.7889,15],"tags":["attraction","building","Huis Ten Bosch","Japan","theme park"]},{"id":"06-glass-museum.md","slug":"06-glass-museum","base":"/japan-2018/","collection":"post","body":"In the baroque looking Stut House in &#8220;Amsterdam Square&#8221; there is an extensive glass and crystal museum which we visited called &#8220;Gyaman Gallery&#8221;. There is a huge chandelier near the entrance, and there are lots of really interesting displays over three floors.\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Huis Ten Bosch","title":"Day 6: Huis Ten Bosch (Glass Museum)","description":"The Stadhuis replica in \"Amsterdam Square\" in Huis Ten Bosch has a magnificent crystal and glass museum called \"Gyaman Gallery\".","date":"2018-03-11T03:00:16.000Z","image":{"src":"/japan-2018/_astro/Chandelier.3d945b94.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[33.0859,129.7889,15],"tags":["attraction","Huis Ten Bosch","Japan","museum","theme park"]},{"id":"06-huis-ten-bosch-station.md","slug":"06-huis-ten-bosch-station","base":"/japan-2018/","collection":"post","body":"Once we arrived at the tiny but very, very cute JR Huis Ten Bosch station, we walked across a bridge over the Haiki Seto Strait to the Huis Ten Bosch theme park. A very large hotel with a very impressive European style architecture (Hotel Okura JR) dominates the landscape.\n\nHuis Ten Bosch is a fairly unique theme park in that it is modelled after a stylised version of Holland, including windmills, tulips, famous buildings, streets, restaurants etc. so someone living in Japan could imagine they are visiting the Netherlands without the bother of passports, travelling, or having to learn a foreign language. Of course, all the &#8220;buildings&#8221; are fake and house either attractions, galleries, souvenir shops or food outlets. It&#8217;s a concept that I cannot imagine working anywhere else in the world except Japan, hence it was a very unique experience for us.\n\nWe left our luggage at Hotel Nikko Huis Ten Bosch and entered the park. There are a few photo opportunities just after the entrance.\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Huis Ten Bosch station","title":"Day 6: Huis Ten Bosch station","description":"We arrived at the tiny but very, very cute JR Huis Ten Bosch station, walked across a bridge to the Huis Ten Bosch theme park.","date":"2018-03-10T22:00:43.000Z","image":{"src":"/japan-2018/_astro/Huis Ten Bosch station_ Chris.64b6283c.jpeg","width":2560,"height":1920,"format":"jpg","orientation":1},"map":[33.0918,129.7966,16],"tags":["attraction","Huis Ten Bosch","Japan","station","theme park","train"]},{"id":"06-nagasaki-to-huis-ten-bosch.md","slug":"06-nagasaki-to-huis-ten-bosch","base":"/japan-2018/","collection":"post","body":"Had a heavy breakfast and checked out. Took a taxi to Nagasaki Station and waited for the Seaside Liner (no reservations). When the train arrived, it was quite an old train but we didn&#8217;t mind as it was all part of the experience. The train is quite a slow one, and stopped for a relatively long time at each station. The seaside journey towards Sasebo is quite beautiful.\n\nThese pictures are of Nagasaki Station in the morning. The food are from the food court at the bottom of the plaza next to the station.\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Nagasaki Station","title":"Day 6: Nagasaki to Huis Ten Bosch","description":"Today we are travelling on the Seaside Liner from Nagasaki to Huis Ten Bosch. Took a few photos at Nagasaki Station.","date":"2018-03-10T21:00:58.000Z","image":{"src":"/japan-2018/_astro/Nagasaki Station.390f611d.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[32.7525,129.8687,16],"tags":["Japan","Nagasaki","Nagasaki Station","Seaside Express","station","train"]},{"id":"06-night-lights.md","slug":"06-night-lights","base":"/japan-2018/","collection":"post","body":"We headed back to the theme park at dusk at ate saraudon for dinner at a Chinese restaurant at the Domtoren. After that we watched the evening parade and wandered around the park. It&#8217;s a bit like Vivid in Sydney &#8211; a lot of the buildings are lit up and there&#8217;s a spectacular lightshow of a fountain that seem to flow down from the Domtoren onto the Art Garden. We also had fun taking photos around the fountain in Thriller City and along the Flower Road where the windmills are lit up.\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Huis Ten Bosch","title":"Day 6 Huis Ten Bosch (Night Lights)","description":"The Night Lights in Huis Ten Bosch are very colourful with a lot of the buildings lit up, with \"light\" flowing from the Domtoren.","date":"2018-03-11T07:00:41.000Z","image":{"src":"/japan-2018/_astro/Domtoren (1).9cbcf8bd.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[33.0859,129.7889,15],"tags":["attraction","Huis Ten Bosch","Japan","lights","night","theme park"]},{"id":"06-teddy-bear-kingdom.md","slug":"06-teddy-bear-kingdom","base":"/japan-2018/","collection":"post","body":"The first attraction we visited after the theme park entrance is a recreation of Kasteel Nijenrode (a merchant house that has subsequently become a university). This houses the Teddy Bear Kingdom, an extensive collection of teddy bears from around the world.\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Huis Ten Bosch","title":"Day 6: Huis Ten Bosch (Teddy Bear Kingdom)","description":"We visited a recreation of Kasteel Nijenrode containing the Teddy Bear Kingdom, an extensive collection of teddy bears from around the world.","date":"2018-03-10T23:00:54.000Z","image":{"src":"/japan-2018/_astro/Welcome_ Kasteel Nijenrode.cd88d5b6.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[33.0859,129.7889,15],"tags":["attraction","Huis Ten Bosch","Japan","kawaii","museum","teddy bear","theme park"]},{"id":"06-thriller.md","slug":"06-thriller","base":"/japan-2018/","collection":"post","body":"We finished the afternoon exploring the area south of Amsterdam Square, which contains a variety of theme park attractions surrounded by a fountain.\n\nThriller City is full of spooky attractions (even a scary toilet!), including my favourite (Prison Ward &#8211; a walk through the corridors of a horrifying hospital where gruesome experiments were being carried on the inmates), the House of Love and Horror, (which is completely dark and I had to feel my way around) and Mansion of Japanese Ghost Stories (which replicates scenes from famous Japanese Ghost Stories). I also enjoyed the Kingdom of Robots, Muse Hall and the Umbrella Street. There is a fountain in the middle with some interesting photo opportunities.\n\nA few of the attractions here are VR based and since I am not really into VR I skipped those.\n\nWe ended up leaving the theme park via Flower Road (where the tulips and windmills are), and saw some interesting vehicles (part of the evening events) at the park entrance. We finally checked into the hotel and had a brief rest before attending the night parade and light show.\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Huis Ten Bosch","title":"Day 6: Huis Ten Bosch (Thriller and Attraction Cities)","description":"Thriller and Attraction Cities in Huis Ten Bosch contain a variety of theme park attractions surrounded by a fountain.","date":"2018-03-11T06:00:51.000Z","image":{"src":"/japan-2018/_astro/Thriller City.388ed8ab.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[33.0859,129.7889,15],"tags":["attraction","Huis Ten Bosch","Japan","theme park"]},{"id":"07-afternoon-wrap-up.md","slug":"07-afternoon-wrap-up","base":"/japan-2018/","collection":"post","body":"After having tendon for lunch again (we are creatures of habit, and it seems the easiest meal to digest after a heavy breakfast), we wandered around the park to catch any final sights or attractions that we missed on the first day. The Patlabor displays were interesting (giant robots plus an exhibit area outside the Robot Palace). One of the weirdest things we saw was a theatre screening of &#8230; anime boy bands. I must admit, I like anime, I can even be persuaded to like some boy bands, but for the life of me I am not sure what to make of watching an anime of boy bands singing. Clearly aimed at a teenage girl audience, nevertheless I saw an old man in the cinema &#8211; not sure what he thought of the whole thing.\n\nWe finished off by returning back to the hotel of a brief rest before visiting the park again for the evening parade.\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Huis Ten Bosch","title":"Day 7: Huis Ten Bosch (Afternoon wrap up)","description":"We wandered around Huis Ten Bosch in the afternoon to catch any final sights or attractions that we missed on the first day.","date":"2018-03-12T05:00:06.000Z","image":{"src":"/japan-2018/_astro/Japan 2018 Day 7 - Huis Ten Bosch (1).4161f40d.jpeg","width":2560,"height":1920,"format":"jpg","orientation":1},"map":[33.0859,129.7889,15],"tags":["attraction","Huis Ten Bosch","Japan","theme park"]},{"id":"07-evening-parade.md","slug":"07-evening-parade","base":"/japan-2018/","collection":"post","body":"On our last night at Huis Ten Bosch we went back to the Domtoren to try out a ramen place called Meifan. After that we stayed back to watch the night parade and soak up the atmosphere as we are leaving the next day back to Osaka. It&#8217;s been an interesting trip and we are glad to have visited this rather unique theme park. The Dutch setting coupled with the high tech attractions focusing on robots and VR certainly makes an interesting combination!\n\nWe ended up taking some photos at the courtyard garden of the hotel.\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Huis Ten Bosch","title":"Day 7: Huis Ten Bosch (Evening Parade)","description":"On our last night at Huis Ten Bosch we stayed back to watch the evening parade and soak up the atmosphere.","date":"2018-03-12T09:00:15.000Z","image":{"src":"/japan-2018/_astro/Spectacles Bridge.8b627e2d.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[33.0859,129.7889,15],"tags":["attraction","Huis Ten Bosch","Japan","lights","night","theme park"]},{"id":"07-flower-road.md","slug":"07-flower-road","base":"/japan-2018/","collection":"post","body":"We woke up and had the buffet breakfast at the hotel. Not only was it super crowded and we had to queue to get in, but the food wasn&#8217;t very delicious &#8211; definitely the low point in our trip as far as breakfasts are concerned. We headed back to the entrance, converted our vouchers into day passes, took a few photos and headed to the Flower Road. It was still early so not too many people around. We checked out the Cheese Waag &#8211; it was super expensive.\n\nAfter that we slowly made our way past Amsterdam Square back to the Domtoren and headed out towards Harbour Town.\n\nWe saw some people on Segways touring around the park. The women told me she was a bit scared so I shouted out &#8220;気を付けてね&#8221; (Please take care of yourself!)\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Huis Ten Bosch","title":"Day 7: Huis Ten Bosch (Flower Road)","description":"The Flower Road at Huis Ten Bosch features windmills, tulips, the Delftsebrug bridge, and a cheese shop called Cheese Waag.","date":"2018-03-11T23:00:16.000Z","image":{"src":"/japan-2018/_astro/Flower road (1).0072d2fc.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[33.0859,129.7889,15],"tags":["attraction","Huis Ten Bosch","Japan","theme park"]},{"id":"07-game-museum.md","slug":"07-game-museum","base":"/japan-2018/","collection":"post","body":"I must admit, I secretly enjoyed this museum, which contains a display of various gaming consoles past to present as well as various arcade machines. I was surprised that coins still had to be inserted to play, I would have expected the machines to be rigged for free play but never mind.\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Huis Ten Bosch","title":"Day 7: Huis Ten Bosch (Game Museum)","description":"The Game Museum at Huis Ten Bosch contains a display of various gaming consoles past to present as well as various arcade machines.","date":"2018-03-12T02:00:28.000Z","image":{"src":"/japan-2018/_astro/Chris_ motorbike.fd899b02.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[33.0859,129.7889,15],"tags":["attraction","Huis Ten Bosch","Japan","museum","theme park"]},{"id":"07-harbour-town.md","slug":"07-harbour-town","base":"/japan-2018/","collection":"post","body":"“Harbor Town” is an unticketed area of Huis Ten Bosch, so we have to exit via turnstiles and need to show our ticket to get back in, but it contains some theme park attractions, such as the Game Museum and the Porcelain Museum. However, the shops here are open to the public, and there is a marina that also contains the Huis Ten Bosch Floating Hotel. There is a replica of a Dutch ship that sailed into Japan in the 17th century called De Liefde. The Watermark Hotel is also here as well as a replica of the Huis Ten Bosch itself (which we didn’t go in as there was a separate admission fee to see the museum).\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Huis Ten Bosch","title":"Day 7: Huis Ten Bosch (Harbour Town)","description":"Harbor Town in Huis Ten Bosch has theme park attractions, the Huis Ten Bosch castle, and a replica of a Dutch ship called De Liefde.","date":"2018-03-12T00:00:16.000Z","image":{"src":"/japan-2018/_astro/Palace Huis Ten Bosch (1).90f8078c.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[33.0859,129.7889,15],"tags":["attraction","Huis Ten Bosch","Japan","theme park"]},{"id":"07-porcelain-museum.md","slug":"07-porcelain-museum","base":"/japan-2018/","collection":"post","body":"The Porcelain Museum is full of rooms of porcelain displays, a second hall with upholsteries and a third hall with pottery.\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Huis Ten Bosch","title":"Day 7: Huis Ten Bosch (Porcelain Museum)","description":"The Porcelain Museum at Huis Ten Bosch is full of rooms of porcelain displays, a second hall with upholsteries and a third hall with pottery.","date":"2018-03-12T01:00:27.000Z","image":{"src":"/japan-2018/_astro/Mirror hall_ Chris.491b95c8.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[33.0859,129.7889,15],"tags":["attraction","Huis Ten Bosch","Japan","museum","theme park"]},{"id":"07-super-trick-art.md","slug":"07-super-trick-art","base":"/japan-2018/","collection":"post","body":"Super Trick Art is yet another of those 3D art places that you pose in front of. The lighting is a bit dark in places and it has also hard to use bounce flash because the ceiling is high and painted black. So we ended up taking most of the photos using just natural light but unfortunately many of the pictures look a bit dark. Still, we had fun and some of the artwork were a bit weirder than usual.\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Huis Ten Bosch","title":"Day 7: Huis Ten Bosch (Super Trick Art)","description":"TSuper Trick Art is yet another of those 3D art places that you pose in front of. The lighting is a bit dark in places.","date":"2018-03-12T03:00:31.000Z","image":{"src":"/japan-2018/_astro/Chris_ wine glass.0689603f.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[33.0859,129.7889,15],"tags":["art","attraction","Huis Ten Bosch","Japan","museum","theme park"]},{"id":"08-huis-ten-bosch-to-osaka.md","slug":"08-huis-ten-bosch-to-osaka","base":"/japan-2018/","collection":"post","body":"Today we woke up, had breakfast at the hotel again (it hasn&#8217;t really improved, but today we managed to get in before the crowds came in so it was easier getting the food). We checked out of the hotel and made our way back to the Huis Ten Bosch station, before bidding it farewell to board a Seaside Express back to Nagasaki, and then retracing our steps back to Hakata on the Limited Express and then Shinkansen all the way to Shin Osaka. From here we caught a JR train to Osaka then headed to the Ritz Carlton Hotel where we stayed last year (we liked the hotel so much we decided to return).\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Huis Ten Bosch station","title":"Day 8: Huis Ten Bosch to Osaka","description":"We are travelling from Huis Ten Bosch to Osaka. We checked out of the hotel, made our way back to the Huis Ten Bosch station.","date":"2018-03-13T01:00:34.000Z","image":{"src":"/japan-2018/_astro/Chris_ Huis Ten Bosch platform.aec477c0.jpeg","width":2560,"height":1921,"format":"jpg","orientation":1},"map":[33.0918,129.7966,16],"tags":["Huis Ten Bosch","Japan","Osaka","train"]},{"id":"08-osaka-night.md","slug":"08-osaka-night","base":"/japan-2018/","collection":"post","body":"We arrived late to Osaka after a whole day travelling from Huis Ten Bosch through 3 trains. We decided to visit the Umeda Sky Building for dinner, and then afterwards go to the rooftop to experience cityscapes of Osaka at Night.\n\nThe Umeda Sky Building (梅田スカイビル) is the nineteenth-tallest building in Osaka and one of the city’s most recognisable landmarks. It consists of two 40-story towers that connect at their two uppermost stories, with bridges and an escalator crossing the wide atrium-like space in the centre.\n\nThe building features a rooftop observatory, The Floating Garden (Kuchu Teien) Observatory. The views of Osaka at Night from the here are simply stunning. I also found the bridges and escalator amazing.\n\nThe basement contains an underground level mainly full of restaurants. The Showa Retro Shopping Street (Takimi Koji) reproduces a townscape of the Showa period. There are also some heritage items on display here, to further evoke a sense of pre war Osaka.\n\nWe had problems finding an inexpensive place to eat here. We ended up having curry at Curry House CoCo Ichibanya. This is part of a chain of curry houses, originally established in 1978 and now spread around the world. They have an interesting menu, including vegetarian curry options and a mix of omuraisu and curry.\n\nAt the base of the towers is an urban garden with walking trails and water features.\n\nI found out later the original design of the building featured four interconnected towers. Unfortunately, they only managed to construct two of the four towers after the Bubble Burst. The 173m building was completed in 1993.\n\nFor more information, the website has an [English](https://www.skybldg.co.jp/en/) section.\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Umeda Sky Building","title":"Day 8: Osaka at Night (Umeda Sky Building)","description":"We visited the Umeda Sky Building for dinner, and then afterwards go to the rooftop to experience cityscapes of Osaka at Night.","date":"2018-03-13T11:00:00.000Z","image":{"src":"/japan-2018/_astro/Umeda Sky building escalators.37776318.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[34.7053,135.49014,17],"tags":["Huis Ten Bosch","Japan","Osaka","train"]},{"id":"09-himeji-cafe-de-miki.md","slug":"09-himeji-cafe-de-miki","base":"/japan-2018/","collection":"post","body":"On our return back to the station, we couldn’t resist stopping by at a Hello Kitty themed cafe called Cafe de Miki. This is located in the covered shopping street (Miyuki Street).\n\nJust in case you didn’t get that the cafe is Hello Kitty themed, the full name of the cafe is “Cafe de Miki with Hello Kitty”. Satisfied now?\n\nIn addition to buying food, the cafe also sells Hello Kitty items such as cups and plush toys. The food is of course quite sweet, consisting of waffles, scones and pancakes.\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Cafe de Miki","title":"Day 9: Himeji (Cafe de Miki)","description":"On our return back to the station, we couldn't resist stopping by at a Hello Kitty themed cafe called Cafe de Miki.","date":"2018-03-14T07:00:00.000Z","image":{"src":"/japan-2018/_astro/Cafe de Miki.82e638d9.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[34.829,134.69172,19],"tags":["Huis Ten Bosch","Japan","Osaka","train"]},{"id":"09-himeji-castle.md","slug":"09-himeji-castle","base":"/japan-2018/","collection":"post","body":"Himeji Castle (姫路城) is the largest and most visited castle in Japan. It became one of the first UNESCO World Heritage Sites in Japan in 1993. The castle has a brilliant white exterior and supposedly resemble a bird taking flight. Because of this, some call it Hakuro-jō or Shirasagi-jō (“White Egret Castle” or “White Heron Castle”).\n\nHimeji Castle remained intact during World War II, unlike the other castles we have visited in Japan. It is a surviving example of what a “real” Japanese castle looks like, inside and outside. It has 83 rooms, 6 floors, and contains defensive systems dating back from the feudal period. These include loopholes and angled chutes called “stone drop windows.” The castle has three moats. The designers used a few methods to prevent enemy attackers from reaching the main keep. The path to the main keep is maze like and confusing. In addition, the castle originally had over 80 fortified gates. 15 of the dates were named consecutively after the Japanese syllabary (いろは etc.)\n\nThe castle grounds date back to 1333. Subsequently, the castle was significantly extended and remodelled several times. It reached its final form early in the 17th century. The castle reopened in 2015, so we were able to see the castle in it’s glory.\n\nMany foreign and Japanese films have featured the castle, including:\n\n- the James Bond movie “You Only Live Twice” (1967)\n- Akira Kurosawa’s Kagemusha (1980)\n- Akira Kurosawa’s Ran (1985)\n- the television miniseries Shōgun (1980) (as a stand-in for feudal-era Osaka castle).\n\nThe [official website](https://www.city.himeji.lg.jp/castle/index.html) has an autotranslated English section.\n\nWe really enjoyed visiting the castle, exploring the main keep and surrounding buildings. There is also an extensive garden.\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Himeji castle","title":"Day 9: Himeji Castle (姫路城)","description":"Himeji Castle (姫路城) is the largest and most visited castle in Japan, and a UNESCO World Heritage Site. It was fully restored in 2015.","date":"2018-03-14T03:00:00.000Z","image":{"src":"/japan-2018/_astro/trip.0092a5f1.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[34.8393,134.694,16],"tags":["Huis Ten Bosch","Japan","Osaka","train"]},{"id":"09-himeji-kokoen.md","slug":"09-himeji-kokoen","base":"/japan-2018/","collection":"post","body":"Koko-en (好古園) is a Japanese garden located next to Himeji Castle.\n\nThis strolling-landscape-type Japanese garden was built to commemorate Himeji City’s 100th anniversary. It features ponds and springs against the backdrop of Himeji Castle. Actually, the garden consists of 9 separate Japanese traditional gardens. The area used to be the former site of a Himeji Lord’s Residence and his men’s samurai houses. The garden covers an area of 3.5 hectares.\n\nThe 9 gardens featured in Koko-en are:\n\n- **The garden of the Lord’s residence**, the biggest garden, including a pond with carp, a roofed corridor, and the Cho-on-sai guest house\n- **garden of seedlings**, containing plants grown during the Edo era\n- **tea ceremony garden** with Soujo-an tea house\n- **flatly landscaped garden**, a country style garden\n- **garden of summer trees**, with a view of Himeji Castle\n- **the garden of pine trees**\n- **garden of flowers**, with flowers popular during the Edo period\n- **the garden with a hill and pond**, with a tortoise shaped rock in the pond and a Japanese crane shaped stone slab\n- **garden of bamboo**.\n\nThe garden’s passage-ways are traditional mud walls, called “Tsuiji-bei.” The walls have roof-tiles. Flowing streams, waterfalls and ponds join up and connect the distinct gardens.\n\nIn addition, there are also beautiful wooden gates like:\n\n- “Yashiki-mon” (gate to “The Lord’s Residence”)\n- “Nagaya-mon”, a traditional style gate with two guard-rooms.\n\nThe [official website](http://www.himeji-machishin.jp/ryokka/kokoen/en/index.php) has an English section.\n\nWe really enjoyed visiting the garden. I didn’t realise at the time the garden is relatively young. We thought the garden must be centuries old. The garden has been used as a location for a number of Japanese films.\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Kokoen","title":"Day 9: Himeji (Koko-en 好古園)","description":"Koko-en (好古園) is a Japanese garden next to Himeji Castle. It was constructed in 1992 at the site of the lord's west residence.","date":"2018-03-14T06:00:00.000Z","image":{"src":"/japan-2018/_astro/Bridge.661839a9.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[34.83766,134.69001,17],"tags":["Huis Ten Bosch","Japan","Osaka","train"]},{"id":"09-himeji-otemaedori.md","slug":"09-himeji-otemaedori","base":"/japan-2018/","collection":"post","body":"Himeji is located at south western part of Hyogo, and is the second largest city in Hyogo (with population of 530,000). It is sandwiched between the Chugoku Mountains on the north, and the Inland Sea of Japan on the south.\n\nToday we are doing a day trip to Himeji, which is famous for the UNESCO World Heritage Himeji Castle. There is a view of the castle from the station itself.\n\nWe saw a scale model of the castle and a carrying chair at the station. I also saw a cardboard standup poster celebrating the 500 Type EVA Project, a JR Shinkansen decorated with Neon Genesis Evangelion motifs.\n\nThere are artistic statues, manholes, street art located in Otemaedori, the road leading from the station to the castle. Some of the statues depict Shachi, a mythical fish with a tiger face, and used as an ornament on the castle roof.\n\nHimeji is also famous for food, and we certainly saw a lot of restaurants on the way to the castle. One of them is a Hello Kitty cafe, which we hope to visit later.\n\nOne attraction that we didn’t have time to visit is the Shoshazan Engyo-ji Temple. This is the location where the Tom Cruise movie Last Samurai was partially filmed.\n\nThere is a tourist bus that takes you to the castle and back. We found it easy enough to just walk.\n\nFor more information, the [Himeji City website](https://www.city.himeji.lg.jp/) has some pages auto-translated to English. The [tourism site](https://www.himeji-kanko.jp/) also has an English section.","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Otemaedori","title":"Day 9: Himeji (Otemaedori)","description":"Himeji is the second largest city in Hyogo and is famous for Himeji Castle and Kokoen garden. There are many statues on Otemaedori.","date":"2018-03-14T00:00:00.000Z","image":{"src":"/japan-2018/_astro/Street sculpture_ Otemae-dori (12).1ff378f1.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[34.8288,134.6901,15],"tags":["Huis Ten Bosch","Japan","Osaka","train"]},{"id":"09-umeda.md","slug":"09-umeda","base":"/japan-2018/","collection":"post","body":"We had a quick visit to Kiddyland to look at all the plush toys, and then visited the Sony Store.\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Umeda","title":"Day 9: Osaka (Umeda)","description":"On our last night in Japan, we visited the Umeda area for a quick dinner.","date":"2018-03-14T09:00:00.000Z","image":{"src":"/japan-2018/_astro/View from hotel room.ca90b920.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[34.7054,135.498,16],"tags":["Huis Ten Bosch","Japan","Osaka","train"]},{"id":"10-osaka.md","slug":"10-osaka","base":"/japan-2018/","collection":"post","body":"On our last day in Osaka, we wandered around the block from the hotel and ended up in Osaka Station City, a large shopping mall attached to JR Osaka station.\n\nThis is a large mall with a top level full of restaurants, a Daimaru department store, and an under roof open space. We enjoyed browsing through the mall. After that, we reluctantly headed back to the hotel to pack, before heading to Kansai International Airport via a shuttle bus. We are so sad to leave Japan once again and hope to return in the future.\n","trip":"Japan 2018","place":"Japan","timezone":"Japan","location":"Osaka Station City","title":"Day 10: Osaka (Last Day)","description":"On our last day in Osaka, we wandered around the block from the hotel and ended up in Osaka Station City, a large shopping mall.","date":"2018-03-15T03:00:00.000Z","image":{"src":"/japan-2018/_astro/Yodabashi Umeda.922189b0.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[34.7026,135.496,16],"tags":["Huis Ten Bosch","Japan","Osaka","train"]}]