[{"id":"muswellbrook-2022.md","slug":"index.html","base":"/muswellbrook-2022/","collection":"trip","body":"We decided to have a family holiday in between Christmas and New Year in the Upper Hunter Valley. We booked a house in Muswellbrook, and had a relaxing few days\n\n| Day | Date | Itinerary |\n| ---: | :---- | :--------- |\n| 0 | Tue 27 December | Lunch at The Kingfish Honeysuckle |\n| 1 | Wed 28 December | Burning Mountain Walk, Scone, Hunter Belle |\n| 2 | Thu 29 December | Muswellbrook Historic walk |\n| 3 | Fri 30 December | Wineries, lunch and journey home |\n","trip":"Muswellbrook 2022","place":"Australia","timezone":"Australia/NSW","location":"Muswellbrook","title":"Muswellbrook 2022","description":"Family holiday to the Upper Hunter Valley between Christmas and New Year (27-30 December 2022).","date":"2022-12-30T06:00:00.000Z","image":{"src":"/muswellbrook-2022/_astro/trip.c9d74b19.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1},"tags":["Newcastle","Muswellbrook","Burning Mountain","Denman","Pokolbin"]},{"id":"0-kingfish-lunch.md","slug":"0-kingfish-lunch","base":"/muswellbrook-2022/","collection":"post","body":"We started the trip by driving to Newcastle the [The Kingfish Honeysuckle](https://thekingfish.com.au/) for lunch.\n\nThe Kingfish is a family-owned and operated seafood restaurant located on one of the new apartment buildings around Honeysuckle Drive, Newcastle.\n\nThey have an amazing seafood platter here containing the following, so we ordered three platters:\n\n- Garlic Pita Bread,\n- 4 x Sydney Rock Oysters,\n- Chef’s Cured Kingfish,\n- 6 x Fresh Australian Tiger Prawns,\n- 2 x 1/2 Fresh Blue Swimmer Crab,\n- 2 x 1/2 Fresh Balmain Bug,\n- 2 x Chilli Garlic Prawns,\n- 2 x Grilled Scallops (in the shell),\n- 6 x Crumbed Calamari Rings,\n- 3 x Tempura King Prawns,\n- 2 x Battered NZ Hoki Fillets,\n- Hand-cut Chips & Seasonal Fruits\n","trip":"Muswellbrook 2022","place":"Australia","timezone":"Australia/NSW","location":"The Kingfish","title":"Day 0: Lunch at the Kingfish","description":"Huge seafood platter in Newcastle to start off our trip.","date":"2022-12-27T01:00:00.000Z","image":{"src":"/muswellbrook-2022/_astro/Kingfish.a6ec63a4.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[-32.92547,151.76942,17],"tags":["Newcastle","lunch","Kingfish"]},{"id":"0-muswellbrook.md","slug":"0-muswellbrook","base":"/muswellbrook-2022/","collection":"post","body":"The trip from Newcastle to Muswellbrook after lunch was uneventful and we eventually arrived at the house that we have booked. It has 5 bedrooms, so there were plenty to choose from. We were quite full from lunch, so dinner was basically leftovers reheated, and we enjoyed the sunset from the pool.\n","trip":"Muswellbrook 2022","place":"Australia","timezone":"Australia/NSW","location":"Muswellbrook","title":"Day 0: Arrival at Muswellbrook","description":"We arrived in the late afternoon, just in time to unpack, relax and enjoy the sunset.","date":"2022-12-27T06:00:00.000Z","image":{"src":"/muswellbrook-2022/_astro/Muswellbrook (4).9c7431d7.jpeg","width":2560,"height":1920,"format":"jpg","orientation":1},"map":[-32.2627,150.8961,14],"tags":["Muswellbrook","sunset"]},{"id":"1-burning-mountain.md","slug":"1-burning-mountain","base":"/muswellbrook-2022/","collection":"post","body":"Home to Australia’s only naturally burning coal seam, [Burning Mountain Nature Reserve](https://www.nationalparks.nsw.gov.au/visit-a-park/parks/burning-mountain-nature-reserve) is tucked away off New England Highway.\n\nTo traditional Aboriginal owners, it’s the fiery tears of a woman long since turned to stone by Biami, the sky god. Early explorers assumed Burning Mountain's billowing smoke and peak of grey, smouldering ash was an active volcano. It’s actually a combusting coal seam, that’s been smouldering under the surface of the earth for an estimated 5,500 years.\n\nBurning Mountain walk is the best way to discover this unusual nature reserve, with information panels along an accessible 4km return track that has some steep sections.\n\nYou would expect a fire sizzling below ground for 5,500 years to have some fairly dramatic effects on the vegetation, and the remarkable phenomenon of Burning Mountain is reflected in the plants and animals adapted to life around it. We set out from the carpark on a moderate walk to the head of the coal seam, oassing through through eucalypt groves and other types of Upper Hunter woodland. Plenty of dead trees and hollow logs provide homes for lots of wildlife.\n\nAs the fire moves one metre every year, the landscape changes: red gums grow along subsidence cracks, and later we saw narrow-leaved stringy bark, tea trees, and stunted grey gums. There are loads of birds in the area, too. Information panels along the track unpack the story of Burning Mountain, including its science and fascinating Aboriginal heritage. A viewing platform is located at the climax of Burning Mountain walk, providing a safe vantage point to view the exhaust vents and rocks transformed by extreme temperatures.\n","trip":"Muswellbrook 2022","place":"Australia","timezone":"Australia/NSW","location":"Burning Mountain","title":"Day 1: Burning Mountain Walk","description":"Burning Mountain has a naturally burning coal seam that has been smouldering for over 5500 years.","date":"2022-12-28T01:00:00.000Z","image":{"src":"/muswellbrook-2022/_astro/Burning Mountain (39).576629b9.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1},"map":[-31.8689,150.9,15],"tags":["Burning Mountain","walk"]},{"id":"1-hunter-belle.md","slug":"1-hunter-belle","base":"/muswellbrook-2022/","collection":"post","body":"[Hunter Belle Dairy Co](https://www.hunterbelledairy.com) is a family owned and operated business in the\nUpper Hunter Valley of NSW. Headed by husband and wife duo Jason\nand Annie Chesworth, their small team at Scone handmake a wonderful\nrange of dairy products including cheese, milk, butter and yoghurt.\n\nFor over 100 years the Chesworth family have been milking cows along\nthe Hunter River in NSW. In 2009 the 6th generation dairy farmer Geoff\nChesworth and his wife Tania decided it was time to move on from\ntheir 400 cow dairy in Denman, NSW, and into the wonderful world of\ncheese. With son Jason soon joining the business, and wife Annie, the\nChesworths have put their passion for dairy to good use and created the\nHunter Belle Dairy Co. that is today.\n\nEstablished in 2004 the cheese factory began as 'Hunter Belle Cheese'. In 2009 Geoff and Tania Chesworth took over the small cellar door in Muswellbrook NSW, and steadily grew increasing production and sales as well as opening a Hunter Belle Cafe and retail outlet.\n\nAs business boomed, and the second generation became more involved, the launch of Hunter Belle Cheddar by Annie and Jason Chesworth brought with it a new, larger, premises with a cheese factory established in Scone NSW in 2014. With the young couple dubbed as 'Mr and Mrs Cheese' after appearing on My Kitchen Rules in 2013, the business began to get the attention it deserved. \n\nWith both businesses running smoothly side by side, 2017 brought the two together with the collaboration of Hunter Belle Dairy Co.\n","trip":"Muswellbrook 2022","place":"Australia","timezone":"Australia/NSW","location":"Hunter Belle","title":"Day 1: Hunter Belle","description":"Stopping by to buy some cheese before heading back to Muswellbrook.","date":"2022-12-28T04:00:00.000Z","image":{"src":"/muswellbrook-2022/_astro/Hunter Belle (8).8b6c6047.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1},"map":[-32.2418,150.90181,18],"tags":["Hunter Belle","cheese"]},{"id":"1-muswellbrook.md","slug":"1-muswellbrook","base":"/muswellbrook-2022/","collection":"post","body":"We returned back to the house at Muswellbrook in the afternoon, and played billiards as well as swam in the pool.\n\nFor dinner, we decided to order pizza, which was surprisingly yummy. After that, I watched \"Glass Onion\" on TV as the house has a guest Netflix account.\n","trip":"Muswellbrook 2022","place":"Australia","timezone":"Australia/NSW","location":"Muswellbrook","title":"Day 1: Muswellbrook","description":"Afternoon swim plus dinner.","date":"2022-12-28T07:00:00.000Z","image":{"src":"/muswellbrook-2022/_astro/Muswellbrook (16).138b594f.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1},"map":[-32.2627,150.8961,14],"tags":["Muswellbrook","pool","swim","dinner"]},{"id":"1-scone.md","slug":"1-scone","base":"/muswellbrook-2022/","collection":"post","body":"Scone is an important rural centre on the New England Highway. It is known as 'The Horse Capital of Australia' and claims to be the second-largest horse breeding area in the world, after Kentucky in the United States.\n\nThe equine focus of the town is reflected in numerous ways: it is the home to the Australian Stockhorse Association; the Hunter thoroughbred breeding industry which is reputedly the second largest breeding area in the world; the district has some of the country’s longest established pony clubs; there is a thriving polo and polocrosse community; and the bronze sculpture, 'Scone Mare and Foal' by Gabriel Sterk, is prominently situated beside the highway in Elizabeth Park.\n\nThe region is also home to cattle and sheep grazing, cereal cropping, dairies and boutique wineries. The town and the district have a large number of significant historic buildings and there is real pleasure in driving around the district and admiring the huge horse studs.\n\nWe had lunch at Subway because we discovered most of the pubs and restaurants are closed over Christmas.\n","trip":"Muswellbrook 2022","place":"Australia","timezone":"Australia/NSW","location":"Scone","title":"Day 1: Scone","description":"Lunch at Scone after our walk to Burning Mountain.","date":"2022-12-28T02:00:00.000Z","image":{"src":"/muswellbrook-2022/_astro/Scone (5).a7ad4057.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1},"map":[-32.0469,150.867,14],"tags":["Scone","lunch"]},{"id":"2-allan-bridge.md","slug":"2-allan-bridge","base":"/muswellbrook-2022/","collection":"post","body":"We had to stop the car because the bridge looks like it was taken straight out of the film \"Bridges of Madison County.\"\n\nThe Allan Bridge, located between Glenbawn and Segenhoe, is the most significant heritage bridge in the Upper Hunter Shire. It is one of five timber heritage bridges in the Shire. It was constructed in 1937, was washed away in 1955 and reconstructed at a site further downstream.\n\nIn 2021, a truck driver allegedly caused the Allan Bridge to partially collapse, after driving over the bridge in an eight tonne truck carrying a 20 tonne load of hot mix. The bridge is rated for a maximum of four tonnes and is only one of two trussed cable suspension bridges in New South Wales capable of carrying road traffic.\n","trip":"Muswellbrook 2022","place":"Australia","timezone":"Australia/NSW","location":"Allan Bridge","title":"Day 2: Allan Bridge","description":"After breakfast, we took a drive to Glenbawn Dam and passed through a historic bridge along the way.","date":"2022-12-28T23:00:00.000Z","image":{"src":"/muswellbrook-2022/_astro/Allan Bridge.2143806b.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1},"map":[-32.12336,150.92577,19],"tags":["Allan Bridge","historic"]},{"id":"2-glenbawn-dam.md","slug":"2-glenbawn-dam","base":"/muswellbrook-2022/","collection":"post","body":"Glenbawn Dam has one of the largest rock-fill embankment walls in Australia, 100 metres high and 1.1 kilometres long. The main purpose of the dam is to supply water for irrigation, power generation, stock, industry and household needs in the Hunter Valley, and provide flood mitigation and environmental flows.\n\nUnfortunately entry to the dam requires a purchased ticket, so I just walked around and took some photos.","trip":"Muswellbrook 2022","place":"Australia","timezone":"Australia/NSW","location":"Glenbawn Dam","title":"Day 2: Glenbawn Dam","description":"A not so successful visit to Glenbawn Dam.","date":"2022-12-29T01:00:00.000Z","image":{"src":"/muswellbrook-2022/_astro/Glenbawn Dam (10).65c7d6e2.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1},"map":[-32.1166,151.0063,16],"tags":["Glenbawn","dam"]},{"id":"2-muswellbrook-1.md","slug":"2-muswellbrook-1","base":"/muswellbrook-2022/","collection":"post","body":"This morning we decided to do the Muswellbrook Heritage Walk. We couldn't find a map online, so we had to kind of guess where the walk might take us.\n\nMuswellbrook, in the heart of the Upper Hunter is a small town associated with energy, mining and agriculture.\n\nThe 4.5k walk throughout Muswellbrook CBD supposedly includes 40 different items of historical significance. Fine old buildings dating back to the mid-1800s, grand residences, community precincts – testimony to the good times and hard times; all of great importance to the development of Muswellbrook – Roads, Rail, Bureaucracy, Arts and Culture, Entertainment, Business and Community.\n\nWe started at the cemetery, and then passed through Victoria Park. Two dogs were very inquisitive and decided to follow us on the walk down the street.\n\nWe saw quite a few old buildings, including churches, hotels, pubs, the RSL, an abandoned Video EZY store, and the library.\n\nThere is a statue of a dog in the middle of the town (Blue Heeler Country). We also saw a statue of a man on a horse (Charge of the Lighthorse on Beersheba Memorial). St. Alban's heritage listed Anglican Church looks really impressive, and we saw several very long goods trains at the railway crossing on Brook St.\n\nWe decided to stop the walk halfway and walked back to the house for breakfast.\n","trip":"Muswellbrook 2022","place":"Australia","timezone":"Australia/NSW","location":"Muswellbrook","title":"Day 2: Muswellbrook Heritage Walk Part 1","description":"Visiting the historic houses around Muswellbrook.","date":"2022-12-28T22:00:00.000Z","image":{"src":"/muswellbrook-2022/_astro/Muswellbrook (69).ff563ff9.jpeg","width":2560,"height":1920,"format":"jpg","orientation":1},"map":[-32.2627,150.8961,14],"tags":["Muswellbrook","historic","walk","St. Albans","church"]},{"id":"2-muswellbrook-2.md","slug":"2-muswellbrook-2","base":"/muswellbrook-2022/","collection":"post","body":"We started off the second part of our walk after lunch by visiting the St. James' Catholic Church, which was also very impressive.\n\nWe then headed back to St. Alban's for more photos, then walked along Hunter Terrace towards the roundabout. We then explored Fitzgerald Park with Muscle Creek flowing through it. We then explored the railway station. There are some sculptures nearby here. It was fairly late in the evening when we decided to head back.","trip":"Muswellbrook 2022","place":"Australia","timezone":"Australia/NSW","location":"Muswellbrook","title":"Day 2: Muswellbrook Heritage Walk Part 2","description":"After lunch, we resumed our heritage walk to the south of Muswellbrook.","date":"2022-12-29T05:00:00.000Z","image":{"src":"/muswellbrook-2022/_astro/Muswellbrook (2).d288dcf5.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1},"map":[-32.2627,150.8961,14],"tags":["Muswellbrook","historic","walk","St James","church","Muscle Creek","train station"]},{"id":"2-royal-hotel.md","slug":"2-royal-hotel","base":"/muswellbrook-2022/","collection":"post","body":"I had the chorizo and prawn pasta which was quite nice.\n","trip":"Muswellbrook 2022","place":"Australia","timezone":"Australia/NSW","location":"Royal Hotel","title":"Day 2: Dinner at Royal Hotel","description":"We decided to celebrate our last night at Muswellbrook through dinner at the Royal Hotel.","date":"2022-12-29T07:00:00.000Z","image":{"src":"/muswellbrook-2022/_astro/Royal Hotel (7).28d95537.jpeg","width":2560,"height":1708,"format":"jpg","orientation":1},"map":[-32.26512,150.88808,19],"tags":["Muswellbrook","hotel","dinner","Royal Hotel"]},{"id":"3-audrey-wilkinson.md","slug":"3-audrey-wilkinson","base":"/muswellbrook-2022/","collection":"post","body":"[Audrey Wilkinson](https://audreywilkinson.com.au/) has a long history dating back to 1866 when the Wilkinson family acquired the present site. Audrey Wilkinson died at the ripe old age of 85, but the name Audrey Wilkinson Vineyards now perpetuates pioneering winemaking. The Agnew family enters the Australian wine industry with the acquisition of the historic Audrey Wilkinson Vineyard in the Hunter Valley\n\n","trip":"Muswellbrook 2022","place":"Australia","timezone":"Australia/NSW","location":"Audrey Wilkinson","title":"Day 3: Audrey Wilkinson","description":"The cellar door is on top of a hill and offers spectacular views of the Hunter Valley.","date":"2022-12-30T00:00:00.000Z","image":{"src":"/muswellbrook-2022/_astro/Audrey Wilkinson (1).31f40cc3.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1},"map":[-32.7919,151.2757,15],"tags":["Audrey Wilkinson","winery"]},{"id":"3-gigi-and-chix.md","slug":"3-gigi-and-chix","base":"/muswellbrook-2022/","collection":"post","body":"[Gigi & Chix Bonbon Patisserie](https://www.gigichix.com.au) is a contemporary Parisian Patisserie specializing in delicious pastries. A French-inspired brunch menu is available here. There is also a selection of French desserts including handmade tarts, eclairs, entremets, macaroons and cookies.\n\nOwner and Pastry-Creator extraordinaire Angela Joy Mason and her two young daughters, Gigi (four) and Chix (seven), spent some time living in Bordeaux, France, where a local patisserie inspired her with an open kitchen.\n","trip":"Muswellbrook 2022","place":"Australia","timezone":"Australia/NSW","location":"Gigi and Chix","title":"Day 3: Gigi and Chix Bonbon","description":"Lunch in the Hunter Valley Gardens Village at this eclectic patisserie.","date":"2022-12-30T01:00:00.000Z","image":{"src":"/muswellbrook-2022/_astro/Gigi and Chix (3).849adab9.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[-32.77316,151.29779,18],"tags":["Gigi and Chix","lunch","Hunter Valley Gardens village"]},{"id":"3-hvg-village.md","slug":"3-hvg-village","base":"/muswellbrook-2022/","collection":"post","body":"[Hunter Valley Gardens Shopping Village](https://www.huntervalleygardens.com.au/attractions/shopping-village/) is a unique collection of bespoke shops offering everything from delicious meals, lunchtime treats, coffee and wine to stunning glassware, jewellery and unique clothing.\n","trip":"Muswellbrook 2022","place":"Australia","timezone":"Australia/NSW","location":"Hunter Valley Gardens village","title":"Day 3: Hunter Valley Gardens village","description":"After lunch, we explored the shops at Hunter Valley Gardens village before heading home.","date":"2022-12-30T02:00:00.000Z","image":{"src":"/muswellbrook-2022/_astro/Hunter Valley Gardens Village (10).e693281e.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1},"map":[-32.77316,151.29779,18],"tags":["Hunter Valley Gardens village"]},{"id":"3-two-rivers.md","slug":"3-two-rivers","base":"/muswellbrook-2022/","collection":"post","body":"[Two Rivers](https://tworivers.com.au) vineyard is situated in the upper reaches of the Hunter Valley on the banks of the region’s two dominant waterways, the Hunter and Goulburn rivers which flow on the eastern and southern boundaries of the vineyard.\n\nThe ‘Custodians of the Landscape’ sandstone sculptures were carved onsite at Two Rivers in the winter of 2015 by international artist Ben Dearnley. More than 20 tonnes of stone sourced from the vineyard were used to create this unique and compelling project by Ben. His work directly references the ancient art form of stone masonry whilst reflecting the landscape here at Two Rivers. Ben says that the flowing and dynamic nature of the sculptures reflects the ever changing moods and seasons of the vineyard where growing the vines is a labour of love in tune with nature itself.\n\nThere is a lookout point that we went to, which gave good views of the vineyard.\n","trip":"Muswellbrook 2022","place":"Australia","timezone":"Australia/NSW","location":"Two Rivers","title":"Day 3: Two Rivers","description":"We left Muswellbrook on the last day to visit some wineries. First stop is Two Rivers.","date":"2022-12-29T23:00:00.000Z","image":{"src":"/muswellbrook-2022/_astro/Two Rivers (2).df1df139.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1},"map":[-32.4062,150.678,14],"tags":["Two Rivers","winery"]}]