[{"id":"tasmania-2023.md","slug":"index.html","base":"/tasmania-2023/","collection":"trip","body":"\nWe tried to book a trip to Tasmania in 2021 to take advantage of the Government's COVID stimulus program to offer travelers half price domestic flights. Unfortunately, we had to cancel them because of the COVID lockdown later that year.\n\nWe finally rebooked the flights in 2023 to visit Tasmania in early autumn. Unlike previous trips to Tasmania, we decided to base our week long stay in Hobart. Instead of renting a car to travel around Tasmania, we opted to take day trips by coach. Post COVID, renting cars have become very expensive (we were quoted A$200 a day!), so we decided to explore Hobart and surroundings exclusively on this trip.\n\n| Day | Date         | Itinerary                                     |\n| --: | :----------- | :-------------------------------------------- |\n|   0 | Mon 27 March | Qantas SYD-HBA QF1541                         |\n|   1 | Tue 28 March | Explore Hobart CBD                            |\n|   2 | Wed 29 March | Bruny Island tour                             |\n|   3 | Thu 30 March | Tasman Peninsula tour                         |\n|   4 | Fri 31 March | Mt Field tour                                 |\n|   5 | Sat 1 April  | Salamanca Markets and Art Walk                |\n|   6 | Sun 2 April  | Botanic Gardens                               |\n|   7 | Mon 3 April  | Hobart waterfront, then Qantas HBA-SYD QF1540 |\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Tasmania","title":"Tasmania 2023","description":"We returned back to Tasmania after 5 years on 27 March-3 April 2023 to discover what has changed since the COVID lockdown.","date":"2023-04-03T07:00:00.000Z","image":{"src":"/tasmania-2023/_astro/trip.DtCMl9NF.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/trip.jpeg"},"tags":["Hobart","Bruny Island","Tasman Peninsula","Mt Field","Bonorong","kunanyi","Mt Wellington","Cenotaph","Domain","Botanic Gardens","Salamanca","art"]},{"id":"0-journey.md","slug":"0-journey","base":"/tasmania-2023/","collection":"post","body":"\nThis is our first flight since the COVID-19 pandemic of 2020-2021, and we were a bit nervous as we were wondering what had changed. We have heard stories of delays and cancellations and lost baggage.\n\nWe had an early dinner at [Amah by Hojiak](https://www.hojiak.com.au/chatswood/) in Chatswood, before boarding a train to the airport. On the way, we discovered our flight has been delayed by approximately one hour. We spent time near the food court which was surprisingly comfortable.\n\nThe flight, although delayed, was uneventful and we landed safely and caught the airport shuttle bus to our hotel. We are staying at [Best Western Hobart](https://bestwesternhotelhobart.com.au/), which is newly refurbished and conveniently located in the heart of the city. The airport shuttle stopped on Collins St, and we had to walk up two blocks to Bathurst St. We were surprised that the journey was quite hilly, so it was difficult sliding luggage bags on the footpath, but we made it in the end.\n\nThe hotel room was spacious and comfortable, and there were good views of the south of the city from the balcony.\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Best Western Hobart","title":"Day 0: Journey","description":"Early dinner, delayed flight, airport shuttle and hotel check-in.","date":"2023-03-27T10:00:00.000Z","image":{"src":"/tasmania-2023/_astro/Best Western (7).DXqcRVM9.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/0-journey/Best Western (7).jpeg"},"map":[-42.88354,147.32193,18],"tags":["Amah","dinner","flight","Qantas","shuttle","hotel"]},{"id":"1-hobart.md","slug":"1-hobart","base":"/tasmania-2023/","collection":"post","body":"\nThe weather forecast was a few days of rain, clearing up just before we were scheduled to depart. We were hoping the forecast was wrong, but unfortunately it was right for today at least. It pretty much rained the whole day. Which is just as well, since, this was a free day in our itinerary for us to explore the city.\n\nWe had breakfast at McDonalds in the [Cat and Fiddle Arcade](https://www.catandfiddlearcade.com/), which is over 100 years old. We then walked around Elizabeth St north of the mall, and discovered it is located right next to the University of Tasmania city campus. The street is full of cheap restaurants, and has shops catering for the interests of the uni crowd. I saw a music centre, a record shop and a cycling shop.\n\nWe had a vegetarian lunch at the [Thai Veggie Hut](https://thaiveggiehutt.com.au/) which was delicious. I will definitely come back here again.\n\nAfter lunch, we stocked up on food from Woolworths in preparation for our tours over the next 3 days.\n\nIn the afternoon we saw some street art and decided we will do more street art exploration when the weather is better.\n\nOne thing I have noticed in Hobart is the amount of buildings with external fire escape stairs, like the ones we see in American movies.\n\nFor dinner, we walked around the city and discovered no less than 3 Malaysian/Singaporean restaurants:\n\n- Kopitiam Singapore Cafe\n- [Taste of Malaysia](https://www.tasteofmalaysiahobart.com.au/)\n- [Sawak Cafe](https://sawakcafe.com/)\n\nWe were actually quite full and didn't really need to eat, but the owner Caroline from Kopitiam convinced us her food is authentic. So we decided to order the fried prawn mee (also called Singaporean hokkien mee). What can I say, it is definitely the best version of this dish I have eaten in recent times, and we were so greedy we ordered the sambal bee hoon as well (which we couldn't finish, but it was also nice). The owner Caroline and her husband started this business 10 years ago.\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Hobart","title":"Day 1: Hobart CBD","description":"Wandering around Hobart in the rain.","date":"2023-03-28T05:00:00.000Z","image":{"src":"/tasmania-2023/_astro/Eddys.BKetNCo1.jpeg","width":2560,"height":1920,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/1-hobart/Eddys.jpeg"},"map":[-42.8822,147.332,16],"tags":["Hobart","McDonalds","rain","Cat and Fiddle","Elizabeth St","Thai Veggie Hut","Kopitiam Singapore Cafe"]},{"id":"2-adventure-bay.md","slug":"2-adventure-bay","base":"/tasmania-2023/","collection":"post","body":"\nAfter the Mavista walk, we stopped by briefly at the Adventure Bay Store to pick up provisions. There is a sculpture of a globe here. I also saw a pretty Anglican church called St. Pauls.\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Adventure Bay","title":"Day 2: Bruny Island (Adventure Bay)","description":"Stopping by at Adventure Bay for provisions","date":"2023-03-29T00:00:00.000Z","image":{"src":"/tasmania-2023/_astro/Adventure Bay Store.CBmcMbnM.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/2-adventure-bay/Adventure Bay Store.jpeg"},"map":[-43.36104,147.32851,17],"tags":["Bruny Island","Tassie Tours","Mavista","rainforest","walk","wallaby"]},{"id":"2-bruny-island-cheese.md","slug":"2-bruny-island-cheese","base":"/tasmania-2023/","collection":"post","body":"\nFounded by Nick Haddow in 2003, Bruny Island Cheese Co. was started after Nick spent 10 years working with specialist cheese makers in many different countries around the world.\n\nThe types of cheese here include:\n\n- ODO (One Day Old) - a simple curd cheese that is simply drained overnight, lightly salted and then when it is only a day old is marinated in olive oil flavoured with garlic, chilli, black pepper and chives.\n- OTTO - a fresh cheese, wrapped in slices of local prosciutto, that you bake in the oven until the cheese goes all gooey and the prosciutto goes all crispy.\n- SAINT - a complex, richly flavoured soft cheese.\n- 1792 - a pungent washed rind is aged on a slip of Huon pine, giving it a strong smoky character.\n- OEN - washed in local pinot noir before being wrapped in vine leaves and matured for 3-4 weeks.\n- TOM - a simple, fast maturing hard cheese.\n\nA novelty for this place is the RAW MILK C2 - the first raw milk (unpasteurised) cheese in Australia (way back in 2009).\n\nIn 2016 BRUNY ISLAND BEER CO. was started from the same premises, producing craft beer, including some pale ales plus red and dark varieties. I didn't sample the beers, but they looked nice.\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Bruny Island Cheese","title":"Day 2: Bruny Island Cheese","description":"Last stop of the day for gourmet cheese and craft beer.","date":"2023-03-29T04:00:00.000Z","image":{"src":"/tasmania-2023/_astro/Bruny Island Cheese (13).Wvt5hiF0.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/2-bruny-island-cheese/Bruny Island Cheese (13).jpeg"},"map":[-43.20446,147.38573,18],"tags":["Bruny Island","Tassie Tours","cheese","beer"]},{"id":"2-bruny-island-chocolate.md","slug":"2-bruny-island-chocolate","base":"/tasmania-2023/","collection":"post","body":"\nOn the way back along Adventure Bay Road, we briefly stopped at the chocolate company. Apparently they specialise in handmade cream fudges, chocolate products, preserves and gifts.\n\nI like the Peter Rabbit packaging, plus we discovered some mushrooms in a field that looked like they came from a fairy tale!\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Bruny Island Chocolate","title":"Day 2: Bruny Island (Chocolate)","description":"Stopping by at the Bruny Island Chocolate Company","date":"2023-03-29T00:30:00.000Z","image":{"src":"/tasmania-2023/_astro/Bruny Island Chocolate.Babuihro.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/2-bruny-island-chocolate/Bruny Island Chocolate.jpeg"},"map":[-43.31511,147.31523,18],"tags":["Bruny Island","Tassie Tours","chocolate"]},{"id":"2-bruny-island-ferry.md","slug":"2-bruny-island-ferry","base":"/tasmania-2023/","collection":"post","body":"\nWe booked a whole day Bruny Island tour with [Tassie Tours](https://tassietours.com/bruny-island-tours.php). The itinerary includes a mixture of walking, picturesque locations and produce outlets.\n\nAnni, the driver, picked us up in a van at 7:45am and after picking up a number of other passengers, we were off to Bruny Island!\n\nWe boarded the ferry at Kettering and soon were on the way to the island.\n\nFortunately, the day turned out to be bright and sunny, in start contrast to the dull and rainy day yesterday.\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Bruny Island ferry","title":"Day 2: Bruny Island (Ferry)","description":"Beginning our Bruny Island day tour with Tassie Tours","date":"2023-03-28T21:00:00.000Z","image":{"src":"/tasmania-2023/_astro/Bruny Island Ferry (11).BvlUMbHz.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/2-bruny-island-ferry/Bruny Island Ferry (11).jpeg"},"map":[-43.1274,147.2555,15],"tags":["Bruny Island","Tassie Tours","ferry"]},{"id":"2-bruny-island-honey.md","slug":"2-bruny-island-honey","base":"/tasmania-2023/","collection":"post","body":"\nThe Honey Pot and Bruny Island Honey are the houses of honey venues of the Wright family’s proudly-run lifelong collaboration between the family, the bees, and the Tasmanian Wilderness. They have about over 1000 hives which they move year-round to follow the blossoming flower trail so the bees can collect a variety of nectar from different floral sources. They take the bees to Lake Pedder, to Bruny Island, and to the Huon and Derwent Valleys, where they collect Leatherwood and Bush, Prickly Box, and Manuka Honey.\n\nThey extract and package all thei own honey themselves at their facilities in Judbury, Tasmania.\n\nEveryone ordered Leatherwood Honey ice cream, which they are famous for. Tasmanian Leatherwood has a strong, unmistakable flavour sourced from a limited number of hive sites positioned in the South West of Tasmania. The Leatherwood tree itself prefers to be shrouded by a canopy in damper weather.\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Bruny Island Honey","title":"Day 2: Bruny Island Honey","description":"Leatherwood ice cream is delicious here.","date":"2023-03-29T03:00:00.000Z","image":{"src":"/tasmania-2023/_astro/Bruny Island Honey (4).Cjy77VXL.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/2-bruny-island-honey/Bruny Island Honey (4).jpeg"},"map":[-43.2296,147.379,14],"tags":["Bruny Island","Tassie Tours","honey"]},{"id":"2-bruny-island-lighthouse.md","slug":"2-bruny-island-lighthouse","base":"/tasmania-2023/","collection":"post","body":"\nThe heritage-listed 1836 Cape Bruny Lighthouse towers 114m above dramatic cliff tops and coves that form this wild rugged Tasmanian coastline of Cape Bruny.\n\nWhen first lit in March 1838, the Cape Bruny Lighthouse was Tasmania’s third lighthouse, after the Iron Pot Lighthouse at the entrance to the River Derwent and the Low Head Lighthouse at the entrance to the River Tamar. It was Australia’s fourth lighthouse. It is now the country’s second oldest and longest continually staffed extant lighthouse.\n\nApparently to climb the 120 stairs to the lighthouse requires us to book a special tour. I just enjoyed the views of Courts Island, Courts Bay and Quiet Bay.\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Bruny Island Lighthouse","title":"Day 2: Bruny Island (Cape Bruny Lighthouse)","description":"Popular tourist stop with great views.","date":"2023-03-29T01:00:00.000Z","image":{"src":"/tasmania-2023/_astro/Cape Bruny Light Station (14).Cmpwd4O7.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/2-bruny-island-lighthouse/Cape Bruny Light Station (14).jpeg"},"map":[-43.4911,147.1422,15],"tags":["Bruny Island","Tassie Tours","lighthouse"]},{"id":"2-lunch.md","slug":"2-lunch","base":"/tasmania-2023/","collection":"post","body":"\nAfter the lighthouse, we were all hungry, so we stopped at the [Hotel Bruny](https://www.hotelbruny.com.au/) located at Sunset Bay near Alonnah. Along the way, we passed through the beautiful Daniels Bay near Lunawanna.\n\nIncidentally, the two small towns Alonnah and Lunawanna are named after the Aboriginal name for Bruny Island: Lunawanna-alonnah.\n\nWe also passed through the Bruny Baker on the way. The Bruny Baker is a cute little roadside stall on Bruny Island offering freshly baked sourdough for passers-by. Drop your cash in the honesty box, pick up a fresh loaf and enjoy a picnic breakfast on the beach. The sourdough is stored in the very cool vintage fridge on the corner of Sheepwash Road and Main Road. Whilst we were there, we saw the fridge being stocked up and there were a queue of cars waiting to buy the bread!\n\nNearby is Magnetic Island, a privately owned island that is available for rent.\n\nWe saw a general store and luxury accommodation cottages. After lunch, we walked along the beach.\n\nWe also saw an unusually decorated station wagon named \"The Purple People Eaters.\"\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Hotel Bruny","title":"Day 2: Bruny Island (Lunch at Alonnah)","description":"Stopping at the Hotel Bruny at Sunset Bay for lunch","date":"2023-03-29T02:00:00.000Z","image":{"src":"/tasmania-2023/_astro/Sunset Bay (4).0AF-o5uA.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/2-lunch/Sunset Bay (4).jpeg"},"map":[-43.32185,147.24212,17],"tags":["Bruny Island","Tassie Tours","lunch","Sunset Bay","Hotel Bruny"]},{"id":"2-mavista-walk.md","slug":"2-mavista-walk","base":"/tasmania-2023/","collection":"post","body":"\nAfter Truganini Lookout, we went along Adventure Bay Road and then turned into Lockleys Road. We spotted an albino wallaby along the way.\n\nMavista nature walk is along a shaded gully filled with ancient and enchanting wet forest. Towering stringybarks, blackwoods, magnificent treeferns and a variety of understorey species can be enjoyed along the way. A cosy picnic shelter marks the start of the walk.\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Mavista Rainforest walk","title":"Day 2: Bruny Island (Mavista Rainforest Walk)","description":"An ancient rainforest and albino wallaby spotting.","date":"2023-03-28T23:00:00.000Z","image":{"src":"/tasmania-2023/_astro/Mavista Nature Walk.BqvjVqMi.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/2-mavista-walk/Mavista Nature Walk.jpeg"},"map":[-43.37735,147.32218,18],"tags":["Bruny Island","Tassie Tours","Mavista","rainforest","walk","wallaby"]},{"id":"2-truganini-lookout.md","slug":"2-truganini-lookout","base":"/tasmania-2023/","collection":"post","body":"\nOur first stop after disembarking the ferry on Bruny Island is Truganini Lookout on the Bruny Island Neck Game Reserve.\n\nTruganini (also known as Lallah Rookh; c. 1812 – 8 May 1876) was an Aboriginal Tasmanian woman. She was one of the last native speakers of the Tasmanian languages and one of the last individuals solely of Aboriginal Tasmanian descent. She grew up in the region around Bruny Island.\n\nThe Neck is a narrow, long isthmus connecting the north and south ends of Bruny Island. It takes nearly 300 steps up the dunes to the lookout. From here we can see amazing 360 degree views of the water on both sides of the neck, as well as the rest of the island and mainland Tasmania. At the top of the lookout there is a memorial to Truganini (1812-1876) and to the Nuenonne people who inhabited lunawanna-alonnah (Bruny Island) before the European settlement of Bruny.\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Truganini Lookout","title":"Day 2: Bruny Island (Truganini Lookout)","description":"The most spectacular 360 degree lookout on Bruny Island.","date":"2023-03-28T22:00:00.000Z","image":{"src":"/tasmania-2023/_astro/Truganini Lookout.9Mq2Df1Q.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/2-truganini-lookout/Truganini Lookout.jpeg"},"map":[-43.2696,147.349,14],"tags":["Bruny Island","Tassie Tours","Truganini","Neck"]},{"id":"3-crescent-bay.md","slug":"3-crescent-bay","base":"/tasmania-2023/","collection":"post","body":"\nThe highlight of the day is the walk to Crescent Bay. It starts from the car park, then headed east along the coastline to Maingon Blowhole (1 hr 30mins return), Mount Brown (4 hr return) and Crescent Bay​ (4 hr return). ​\n\nCrescent Bay is a sparkling bowl of wild sea cradled by vast sand dunes. The walk traverses a gentle coastal heath. Mt Brown offers 360 degree views including Tasman Island and Cape Pillar before dropping down into this secluded, magical bay.\n\nThe weather continued to rain, so we were pelted by nearly horizontal bullets of rain which made a loud sound on our raincoats. The wind was very strong whenever we were not protected by scrubs, and nearly blew us away. The Blowhole wasn't operating because the tide was too low.\n\nWe were glad when we reached the lookout to Crescent Bay. We contemplated continuing on to climb Mt Brown, but suddenly the weather became a lot worse and the rain became heavy. We decided to walk back to the car pack, and it was really cold and wet. Truly and unforgettable experience.\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Crescent Bay","title":"Day 3: Crescent Bay","description":"Walk along the coastline to view Crescent Bay.","date":"2023-03-30T03:00:00.000Z","image":{"src":"/tasmania-2023/_astro/Crescent Bay walk (32).Bx7UdlEC.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/3-crescent-bay/Crescent Bay walk (32).jpeg"},"map":[-43.1975,147.8718,14],"tags":["Tasman Peninsula","Crescent Bay","Under Down Under Tours"]},{"id":"3-port-arthur-lavender.md","slug":"3-port-arthur-lavender","base":"/tasmania-2023/","collection":"post","body":"\nOur final stop for the day is [Port Arthur Lavender](https://portarthurlavender.com.au/).\n\nNestled within seven hectares (18 acres) of lavender, rainforest and lakes and overlooking the ocean at Long Bay, Port Arthur Lavender’s visitor centre and café showcase millennia-old uses of this fragrant flower alongside modern cuisine and a fully functioning essential oil distillery.\n\nDespite the light rain, I strolled around the lavender trail and took a few photos around the farm. The distillery is where the lavender is processed.\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Port Arthur Lavender","title":"Day 3: Port Arthur Lavender Farm","description":"Short stop at a beautiful lavender farm.","date":"2023-03-30T04:00:00.000Z","image":{"src":"/tasmania-2023/_astro/Port Arthur Lavender Farm (10).D51swRdK.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/3-port-arthur-lavender/Port Arthur Lavender Farm (10).jpeg"},"map":[-43.10727,147.86335,18],"tags":["Tasman Peninsula","Port Arthur Lavender","Under Down Under Tours"]},{"id":"3-remarkable-cave.md","slug":"3-remarkable-cave","base":"/tasmania-2023/","collection":"post","body":"\nWe started from the car park to the Maignon Bay Lookout of the rugged southern coastline before decending the steps to the spectacular Remarkable Cave.\n\nFrom the large viewing platform there are exceptional views of Penguin Rocks and the bay. Wild waves pound away at the coastal rock below to create this dramatic coastline.\n\nWe then descended the 115 steps to view the aptly named Remarkable Cave. Surrounded by steep, ancient sandstone cliffs​, we viewed the cave from the custom-designed platform at the base.\n\nThe tunnel-shaped cave was formed through years of torment from crashing waves, eventually causing a wall of the sandstone cave to collapse and create the tunnel that stands today. Some of the collapsed rock from the cave can still be seen at the base of the cliffs.\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Remarkable Cave","title":"Day 3: Remarkable Cave","description":"A dramatic and narrow sea cave from a secluded beach into Maignon Bay.","date":"2023-03-30T01:00:00.000Z","image":{"src":"/tasmania-2023/_astro/Remarkable Cave (6).D7WYEuEN.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/3-remarkable-cave/Remarkable Cave (6).jpeg"},"map":[-43.18723,147.84418,17],"tags":["Tasman Peninsula","Remarkable Cave","Under Down Under Tours"]},{"id":"3-richmond.md","slug":"3-richmond","base":"/tasmania-2023/","collection":"post","body":"\nToday we are embarking on another day tour, this time to the [Tasman Peninsula](https://tasmanpeninsula.com.au/) operated by [Under Down Under](https://underdownunder.com.au/).\n\nThis scenic and active day out explores the towering sea cliffs and impressive geological features of the Tasman Peninsula. It took us on several short walks to Waterfall Bay, Tasman Arch, and the Devil’s Kitchen to see the magnificent sea stacks, arches, and sea caves of the coastline’s ancient rock formations. From Remarkable Cave we’ll walk to the beautiful moon-shaped Crescent Bay, with its enormous coastal sand dunes and sweeping views to offshore islands and the surging Southern Ocean. All in all, the tour promises a wild and wonderful day of nature, wildlife, and awesome scenery, weather permitting.\n\nHighlights include:\n\n- Richmond Colonial Village\n- Tasman National Park\n- Eaglehawk Neck and Pirates Bay Lookout\n- Tasman Arch and the Devil’s Kitchen\n- Doo Town\n- Remarkable Cave and Crescent Bay\n\nThe tour guide, Keegan, picked us up in a nice Mercedes and drove out past the Tasman Bridge in the direction of Sorell. We soon arrived in [Richmond](https://richmondtasmania.com.au/), a historic village in the Coal River Valley area. Richmond is best known for Richmond Bridge.\n\nThe Richmond Bridge can lay claim to being the oldest existing stone arch bridge in Australia. It was originally named Bigge’s Bridge after the Royal Commissioner John Thomas Bigge who proposed the erection of the Bridge in 1820.\n\nThe two years of construction commenced in 1823. It was built by convict labour (prisoners from the nearby Richmond Gaol), a common trend at the time for developing major building and roads. These convicts were forced to perform the gruelling task of mining the sandstone from the nearby Butchers Hill and then transport it to the site using carts.\n\nThe Richmond Bridge was completed and opened in January 1825. The total length measured 41 metres (135 feet), with a width of 7.5 metres (25 feet). At the time it had the longest span of any bridge in Australia, and held this title until 1836. It was constructed from brown Triassic sandstone. There are six semi-circle arches in total, measuring 4.3, 8.1, 8.3, 8.5 and 4.1 metres in height. Four of these have water flowing underneath.\n\nThe craftsmanship was brilliant – with only minimal maintenance, the bridge has stood for close to 200 years. Constructed with wheat carts in mind, it’s still in use today, supporting automobiles and buses of far greater weight.\n\nThe Richmond Bridge is visited by thousands of tourists annually. Unlike many historic monuments, there’s no fence in place to prevent you from having full access. In fact, you can actually walk over it and underneath the outer arches. There’s no one there to charge an admission fee – the bridge is free to enter and open at all times.\n\nThere are grassy riverbanks on both sides, which make a great spot for having a picnic and feeding the ducks. We found many different varieties of ducks here.\n\nWe did a short loop to the bridge and back again to explore the bakery and other shops before heading back to the bus.\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Richmond","title":"Day 3: Richmond","description":"Historic town with a famous bridge and ... lots of ducks.","date":"2023-03-29T22:00:00.000Z","image":{"src":"/tasmania-2023/_astro/Richmond Bridge (3).dykTL1la.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/3-richmond/Richmond Bridge (3).jpeg"},"map":[-42.73383,147.43998,17],"tags":["Richmond","Under Down Under Tours","historic","bridge"]},{"id":"3-tasman-arch.md","slug":"3-tasman-arch","base":"/tasmania-2023/","collection":"post","body":"\nOur next stop after Richmond is Eaglehawk Neck - the gateway to the Tasman National Park - home to a wide range of land and marine animals, fascinating rock formations and some of the highest and most spectacular cliffs in Australia.\n\nWe started at the Pirates Bay Lookout, but unfortunately by now the weather has turned into rain. Normally we would be able to do a walk here, but it was really windy and wet, so we just walked to Cliff's Lookout, took a few photos, and went back to the car. We skipped the Tessellated Pavement and the Blowhole.\n\nAfter that we stopped at Tasman Arch to take a few photos and then did a short walk to see views of Devil's Kitchen.\n\nWe discovered all the other passengers on the tour bus were visiting the Port Arthur historic site, and we were the only ones scheduled to do the Crescent Bay walk. On the way to Port Arthur, we passed by [Doo Town](https://tasmania.com/points-of-interest/doo-town/). This small community started as a timber station back in the 1830's. It would eventually become a shack community and that’s when the fun began. Somewhere around 1935, a Hobart architect by the name of Eric Round placed a nameplate on his shack. It read “Doo I 99.”\n\nBeing a small community, everyone in town learned of the nameplate quickly. Then a neighbour of Mr. Round responded with a nameplate of his own. It read “Doo Me.” The next neighbour plated his shack with “Doo Us.” And hence the name of Doo Town. The quirky tradition continues today just 79 kilometres southeast of Hobart on Pirates Bay near Eaglehawk Neck.\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Tasman Arch","title":"Day 3: Pirate Bay and Tasman Arch","description":"Various sights and lookout points on the Tasman Peninsula.","date":"2023-03-30T00:00:00.000Z","image":{"src":"/tasmania-2023/_astro/Tasman Arch (1).J4BY_c5N.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/3-tasman-arch/Tasman Arch (1).jpeg"},"map":[-43.0421,147.9509,15],"tags":["Tasman Peninsula","Eaglehawk Neck","Pirate Bay","Doo Town","Tasman Arch","Devil's Kitchen","Under Down Under Tours"]},{"id":"4-bonorong.md","slug":"4-bonorong","base":"/tasmania-2023/","collection":"post","body":"\n[Bonorong Wildlife Sanctuary](https://www.bonorong.com.au/) is a Sanctuary for wildlife run by a passionate team of like-minded people. It's a social enterprise: a little business with a big heart. The skills and funds generated through the Sanctuary allow them to proactively address problems in our surrounding environment and communities.\n\nTassie Devils are close up; wallabies are freely hopping around the park and many more of our local favourites are easily discovered here. Nick timed our visit here for a Tasmanian Devil feeding, a fun and interactive experience with our special endangered Devils.\n\nWe also saw echidnas, and have an all too brief moment to feed the kangaroos roaming around the park.\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Bonorong Wildlife Sanctuary","title":"Day 4: Bonorong Wildlife Sanctuary","description":"Bonorong Wildlife Park is the home to many of our rescued and well-loved wildlife.","date":"2023-03-31T04:00:00.000Z","image":{"src":"/tasmania-2023/_astro/Tasmanian devil (1).DFE4vZzZ.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/4-bonorong/Tasmanian devil (1).jpeg"},"map":[-42.70926,147.27165,17],"tags":["Tours Tasmania","Bonorong","wombat","echidna","Tasmanian Devil","kangaroo"]},{"id":"4-dinner.md","slug":"4-dinner","base":"/tasmania-2023/","collection":"post","body":"\nWe decided to try out another Malaysian restaurant, [Taste of Malaysia](https://www.tasteofmalaysiahobart.com.au/). We had beef rendang laksa and hainan chicken rice. Both were more than acceptable.\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Taste of Malaysia","title":"Day 4: Dinner (Taste of Malaysia)","description":"Dinner at Taste of Malaysia on Elizabeth St.","date":"2023-03-31T07:00:00.000Z","image":{"src":"/tasmania-2023/_astro/Beef rendang laksa.DjAY-qZl.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/4-dinner/Beef rendang laksa.jpeg"},"map":[-42.88106,147.32617,19],"tags":["dinner","Taste of Malaysia"]},{"id":"4-kunanyi.md","slug":"4-kunanyi","base":"/tasmania-2023/","collection":"post","body":"\nTo top off this very Tasmanian day we head to the summit of kunanyi (Mt. Wellington). Amazingly, the rain and clouds cleared for us so we were able to get a great view of Hobart city and surrounds. Standing high above Hobart at 1271m on a clear day is nothing short of spectacular. That’s almost 200 metres taller than the famed Table Mountain in Cape Town.\n\nIt was very very windy and cold, with an apparent temperature taking wind chill into account at -13&deg;C. I was nearly blown away just trying to get to the viewing platform. As a consequence, very few people were willing to spend a long time here, and we all hurried back to the bus.\n\nNick is an excellent photographer and showed us many photos he has taken here, including one of the Australis Borealis, and one of the Disappearing Tarn, a phenomenon that only appears after heavy rainfall. The boulders form a small natural alpine pool (tarn) which is usually aquatic turquoise in colour.\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"kunanyi Mt Wellington","title":"Day 4: kunanyi (Mt Wellington)","description":"We arrived at kunanyi just when the rain cleared but it was very windy and cold.","date":"2023-03-31T05:00:00.000Z","image":{"src":"/tasmania-2023/_astro/kunanyi Mt Wellington (8).DB2bVUby.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/4-kunanyi/kunanyi Mt Wellington (8).jpeg"},"map":[-42.89601,147.23731,18],"tags":["Tours Tasmania","Bonorong","wombat","echidna","Tasmanian Devil","kangaroo"]},{"id":"4-mt-field.md","slug":"4-mt-field","base":"/tasmania-2023/","collection":"post","body":"\nMt. Field offers a variety of walks in one of Tasmania’s oldest National Parks. Most famous for Russell Falls & the Tall Trees track we explored the great short walks within this diverse Park which is just a short 1.5 hour drive from Hobart.\n\nThe Three Falls Circuit and Tall Trees Walk form a loop of the lower rainforest section of Mount Field National Park. The full circuit walk of 6kms, over reasonably easy terrain covers the parks highlights of Russell Falls, Horseshoe Falls, Lady Barron Falls & the Tall Trees Track. We chose to complete the whole circuit.\n\nWe began with the walk to Russell Falls which is easily Tasmania’s most recognisable waterfall with its 3-tiered drop. It is an easy and enjoyable walk along a beautiful forest track among mixed forest and temperate rainforest species. This is Tassie’s most photographed waterfall, and we soak up the awesome view before continuing our walk.\n\nJust beyond Russell Falls we climb the stairs to Horseshoe Falls, a majestic waterfall snuggled in the forest, which some regard as even more impressive than Russell Falls! We continue along the Three Falls Circuit and enter the section known as the Tall Trees Track. High above us stand the giant Swamp Gums around 80 metres tall, the world's tallest flowering plant​. It started raining at this point and I forgot to bring my hat or raincoat. Fortunately, a fellow traveller (from Canada) graciously lent me his hat, otherwise I would have been soaked.\n\nWe continued onto Lady Barron Falls. The return walk involves climbing a lot of steps. Luckily I paced myself and was able to complete the entire climb without stopping or exceeding about 140 bpm heart rate.\n\nWe saw a lot of tree stumps in interesting shapes here, and also a huge variety of fungi and mushrooms, some of which are multi-tier which someone pointed out are very rare.\n\nWe enjoyed our lunch break in a picnic shelter near the Visitor's Centre.\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Mt Field","title":"Day 4: Mt. Field","description":"We completed the Three Falls circuit at the Mt Field National Park.","date":"2023-03-31T01:00:00.000Z","image":{"src":"/tasmania-2023/_astro/Visitor centre.iAdZ73Gs.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/4-mt-field/Visitor centre.jpeg"},"map":[-42.664,146.6052,12],"tags":["Tours Tasmania","Mt Field","Three Falls","Russell Falls","Horseshoe Falls","Tall Trees","Lady Barron Falls"]},{"id":"4-on-the-road.md","slug":"4-on-the-road","base":"/tasmania-2023/","collection":"post","body":"\nToday we venture further afield with [Tours Tasmania](https://www.tourstas.com.au/tours/mt-field-mt-wellington-devils/) on their \"Mt field, Wildlife & Mt Wellington\" day tour.\n\nThis tour encompasses Wilderness, Waterfalls & Wildlife! We get to walk among the giants on the Tall Trees track, see spectacular Russell Falls, visit the local Tassie Devils at feeding time and finish the day with expansive views of Hobart & beyond from kunanyi/Mt. Wellington.\n\nMt. Field National Park offers a variety of short walks and is one of Tasmania’s oldest National Parks. Most famous for the beautiful Russell Falls & the Tall Trees, we explore the park with a series of short walks, before moving onwards to a wildlife park and making a side-trip to the top of Mt. Wellington/kunanyi above Hobart.\n\nThese photos are taken along the trip from the bus, which is driven by tour guide Nick. We mostly travelled following the River Derwent and crossed it several times.\n\nWe saw quite a lot of poppy seed and hemp farms along the road. As we all know, poppy seed is used for making opium amongst other things and hemp can be used to make marijuana, so with the right resources and chemical processes this could be a great place to live!\n\nOn the way back we passed through Bowen Bridge returning back to Hobart.\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"New Norfolk","title":"Day 4: On The Road","description":"On the Mt Field, Wildlife and Mt Wellington tour","date":"2023-03-30T22:00:00.000Z","image":{"src":"/tasmania-2023/_astro/Derwent river.BZSSTD8Y.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/4-on-the-road/Derwent river.jpeg"},"map":[-42.7822,147.0559,11],"tags":["Tours Tasmania","Mt Field"]},{"id":"4-street-eats.md","slug":"4-street-eats","base":"/tasmania-2023/","collection":"post","body":"\nThis event, which is run every Friday during daylight savings (from December to around Easter) at Franklin Square, is billed as \"a hyperactive inner-city night food+drink market with a rotating cast of eclectic musical acts to keep you fed, watered + grooving.\"\n\nWe saw quite a few food stalls and a musician performing.\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Franklin Square","title":"Day 4: Street Eats @ Franko","description":"We returned to Hobart just in time to visit Franko.","date":"2023-03-31T06:00:00.000Z","image":{"src":"/tasmania-2023/_astro/Street Eats at Franko (3).B8Ze0Obc.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/4-street-eats/Street Eats at Franko (3).jpeg"},"map":[-42.88338,147.33032,18],"tags":["event","Street Eats","Franklin Square"]},{"id":"5-art-walk.md","slug":"5-art-walk","base":"/tasmania-2023/","collection":"post","body":"\nWe discovered there is quite a lot of street scattered around Hobart streets, with a lot located at Bidencopes Lane.\n\nIncidentally, my basic faith in human nature was reaffirmed whilst I was taking these photos. I was in a very quiet alley, Lyn had moved on to the next street, no one was around me. Suddenly this stranger came up right next to me whilst I was taking a photo and said hello. I was a bit shocked, and I could have been scared or run away, but I trusted my instincts and gave him a friendly smile and said hello back. We chatted for a little bit, then he moved on. As he waved goodbye, he had the most angelic smile on his face.\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Bidencopes Lane","title":"Day 5: Urban Art Walk","description":"Discovering street art in the middle of Hobart.","date":"2023-04-01T05:00:00.000Z","image":{"src":"/tasmania-2023/_astro/Chooka (2).BTedCjKY.jpeg","width":2560,"height":1441,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/5-art-walk/Chooka (2).jpeg"},"map":[-42.88317,147.32593,18],"tags":["Hobart","street art","Bidencopes Lane"]},{"id":"5-hobart.md","slug":"5-hobart","base":"/tasmania-2023/","collection":"post","body":"\nAfter Battery Point, we were hungry and walked back to the city centre for lunch.\n\nAlong the way, we passed through the finish line for the [Hobart Airport Marathon](https://hobartmarathon.com.au/), which was scheduled for tomorrow. I pretended to cross the finish line and had a number of photos taken here.\n\nLunch was at another vegetarian restaurant called [Heartfood](https://heartfood.page/) and the food here was also delicious.\n\nAfter lunch we wandered around Hobart to capture street art (next post) but I also took some photos of various buildings in Hobart.\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Hobart","title":"Day 5: Hobart","description":"Lunch, plus walking around Hobart","date":"2023-04-01T03:00:00.000Z","image":{"src":"/tasmania-2023/_astro/Heartland (2).M3e0fbzo.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/5-hobart/Heartland (2).jpeg"},"map":[-42.88087,147.32784,19],"tags":["Hobart","lunch","Heartfood"]},{"id":"5-salamanca-market.md","slug":"5-salamanca-market","base":"/tasmania-2023/","collection":"post","body":"\nWe decided to spend the weekend exploring Hobart, as we are tired after three consecutive days of day tours.\n\n[Salamanca Market](https://www.salamancamarket.com.au) is Tasmania's most visited tourism attraction and runs each Saturday from 8.30 am to 3 pm, rain, hail or shine.\n\nThe market extends the full length of Hobart's historic Salamanca Place, from the silos end to the top of Davey Street. There is a huge selection of locally made products and one can meet the makers, the artisans, the designers and producers.\n\nWith over 300 stallholders, the market includes fresh produce from local growers, hot coffee, delicious breakfast and lunch options, lots of gift ideas and plenty of handmade products.\n\nThe market is one of those special places where there are plenty of handmade and home grown produce, mingle with the locals, enjoy the vibrancy and atmosphere, and discover the heart of a creative island.\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Salamanca Market","title":"Day 5: Salamanca Market","description":"Visiting the famous Saturday market in Hobart.","date":"2023-03-31T22:00:00.000Z","image":{"src":"/tasmania-2023/_astro/Salamanca Markets (2).Dij8z5R-.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/5-salamanca-market/Salamanca Markets (2).jpeg"},"map":[-42.8866,147.33231,18],"tags":["Salamanca Market","Saturday"]},{"id":"5-sculpture-walk.md","slug":"5-sculpture-walk","base":"/tasmania-2023/","collection":"post","body":"\nThe Battery Point Sculpture Trail is an easy stroll linking nine large numerical sculptures that provide a fascinating introduction to Hobart’s history. Each sculpture along this international-award winning trail represents a weight, measure, time, quantity, date or distance linked to a story about that place. There is a sculpture afloat in the river, one cut from a hedge and another that glows all night. The trail winds past some of the city’s oldest surviving residences and through locations where many of Tasmania’s first industries were established. Following around Battery Point and along the shore of the river, there are views of both the port and the lower Derwent Estuary.\n\nThe trail was developed by Futago with artists Judith Abell and Chris Viney.\n\nThe first stop on the trail is 1833, a large caged rock sculpture. It represents the work of chained convicts who chiselled away cliff faces to build Salamanca’s giant sandstone warehouses and the new wharf of 1833.\n\nStop two, sculpture 12.43, is just a hundred meters and a right turn along Castray Esplanade from 1833. The concrete and blue resin sculpture discusses tides, surveying and the importance of accuracy in measurement in Victorian times. The number derives from a small square socket 12.43 feet above sea level which was the base point for all levels surveyed in Tasmania.\n\nSculpture 628, featuring detailed geographical images sandwiched between two large panels of glass, sits beside the time keeper’s box which marks the finish line of the 628 nautical mile Sydney to Hobart Yacht Race.\n\nContinuing along the waterfront walkway stop 4 is folded over a red retaining wall at a local fishing spot. 2000 sculpture is a tribute to the thousands of Salamanca workers whose hard labour once ran the city. Upon close inspection you’ll find etchings of women who once worked in the jam factories.\n\nThe 1923 Hedge not only reflects the extravagant hedges of Battery Point’s most affluent homes, but also marks where in 1923 a proposal for natural parkland was knocked down in favour of 26 lots of Hobart’s most expensive real estate. Unfortunately when we visited it no longer exists and only the sign is left.\n\nSculpture 313 represents where new vessels were launched through the 1800s. We took a stroll along the jetty and looked out to sea. Floating on the river there is a white fibreglass sculpture.\n\n1 250 features a giant corroded steel plate with small rivets making up four digits. The plate, viewable from high above along Napoleon Street, lies in an excavated ditch, once the home of a winch capable of hauling 1 250 tonne vessels from the water.\n\nThe penultimate sculpture lies at the bottom of Napoleon Street Park overlooking Battery Point’s ship chandlers and the river Derwent. Although visible by day, 24 is a creature of the night featuring a solar illuminated red number 24 beneath a very thick, dark layer of resin that creates an eerie image similar to a sunken ship. This one was very difficult for us to find, we kept wandering around looking for it.\n\nErrol Flynn Reserve marks the end of the trail with the large white Hollywoodesque 1909 sculpture a tribute to our most famous expat born in the year 1909.\n\nWe also discovered many other interesting features of Battery Point, including historic buildings, Arthur's Circus, and even a house claiming to be the birthplace of the [Piranha Bros](https://en.wikipedia.org/wiki/Piranha_Brothers) (familiar to Monty Python fans).\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Batttery Point","title":"Day 5: Battery Point Sculpture Trail","description":"An often elusive trail of nine numerical sculptures scattered along historic Battery Point.","date":"2023-04-01T01:00:00.000Z","image":{"src":"/tasmania-2023/_astro/1833.BlsheJ8Z.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/5-sculpture-walk/1833.jpeg"},"map":[-42.8901,147.3322,16],"tags":["Battery Point","sculpture","walk"]},{"id":"6-art-gallery.md","slug":"6-art-gallery","base":"/tasmania-2023/","collection":"post","body":"\nTasmanian Museum and Art Gallery (TMAG) is Tasmania's leading natural and cultural heritage organisation. It is a combined museum, art gallery and herbarium which safeguards the physical evidence of Tasmania's natural and cultural heritage, and the cultural identity of Tasmanians.\n\nTMAG is Australia's second-oldest museum and has its origins in the collections of Australia's oldest scientific society, the Royal Society of Tasmania, established in 1843. The first permanent home of the museum opened on the corner of Argyle and Macquarie streets in 1863 and the museum has gradually expanded from this corner to occupy the entire city block.\n\nThe TMAG precinct is one of Australia's most historically significant sites. Included in the precinct is Tasmania's oldest surviving public building, the 1808-10 Commissariat Store; the Private Secretary's Cottage, built prior to 1815 and originally adjacent to old Government House; and Tasmania's first federal building, the 1902 Custom House.\n\nWe did not have much time to visit the museum - as it was close to closing time, so we did a quick blitz through and mainly admired the artwork of old Hobart Town.\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Tasmanian Museum and Art Gallery","title":"Day 6: Tasmanian Museum and Art Gallery","description":"Australia's second oldest museum and featuring the collections of Australia's oldest scientific society.","date":"2023-04-02T05:00:00.000Z","image":{"src":"/tasmania-2023/_astro/Tasmanian Museum and Art Gallery (16).BnpgfP8p.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/6-art-gallery/Tasmanian Museum and Art Gallery (16).jpeg"},"map":[-42.88169,147.3277,17],"tags":["Tasmanian Museum and Art Gallery","art gallery","museum","historic","Hobart"]},{"id":"6-banjos.md","slug":"6-banjos","base":"/tasmania-2023/","collection":"post","body":"\n[Banjo’s Bakery Cafe](https://banjos.com.au/hobart) was founded in Tasmania in 1984 and has operated successfully since, growing to over 40 stores across Australia. The idea, unique at that time, was to provide a place which offered customers the opportunity to sit down and enjoy freshly baked breads and cakes or handmade treats for breakfast, lunch or a snack with a perfectly made coffee.\n\nThe food still is hand crafted, fresh each day and served in an environment which provides a comfortable and relaxing atmosphere. We bake a superior loaf and our bread is still made the traditional way, preservative free, fresh, soft and delicious. From day one, customers were quick to respond to the Banjo’s experience – now, with more than 6.3 million customers visiting a Banjo’s store each year.\n\nWe had delicious hot cross buns, toasties and coffee here.\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Banjo's","title":"Day 6: Breakfast at Banjos","description":"Delicious breakfast at Banjos Bakery Cafe.","date":"2023-04-01T23:00:00.000Z","image":{"src":"/tasmania-2023/_astro/Banjos Bakery Cafe (8).EtYxz8xR.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/6-banjos/Banjos Bakery Cafe (8).jpeg"},"map":[-42.88097,147.32677,19],"tags":["Banjos Bakery Cafe","breakfast","Hobart"]},{"id":"6-botanic-gardens.md","slug":"6-botanic-gardens","base":"/tasmania-2023/","collection":"post","body":"\nThe [Royal Tasmanian Botanical Gardens](https://gardens.rtbg.tas.gov.au/) is Australia’s cool climate garden, with a number of unique collections including Australia’s only Subantarctic Plant House. With a total of 14 hectares to explore, visitors can take time to relax and explore or tailor a walk based on personal interest. Established in the early years of the colony of Hobart, the rich history of the gardens is evident throughout the site, and it is Australia’s second oldest Botanic Gardens, established just two years after Sydney.\n\nWe didn't have much time, so we focused on the top ten locations as described by the guide brochure. The following information is taken from their website.\n\n## The Entrance\n\n![Entrance Gates](../../assets/gallery/6-botanic-gardens/Gate_1.jpeg)\n\nThe old entrance was a simple green door, allowing one person at a time. The (new) cast-iron entrance gates were installed in 1878. The avenue in front of the gates (now a car park) enlarges to a rough circle of 80 feet – the turning circle of a coach and pair of horses. The double gates were made wide enough to enable carts to pass through. The old green door (still green), remains in place and is used with surprising frequency.\n\nEven by Victorian standards the gates are imposing in height and solidity: the cast-iron has been decorated with what seems like a Bacchanalia; gods and grapes being in liberal supply. The coat of arms of the Royal Society decorates the top of the paired main gates, and there is a smaller pedestrian entrance: a much more recent and simpler iron fence flanks either side, joining with the Arthur Wall and the main fence by the road. Painted currently a dark maroon, they certainly improve the atmosphere as one walks up the avenue.\n\n## Gatekeepers Cottage\n\n![Gatekeepers Cottage](../../assets/gallery/6-botanic-gardens/Gatekeepers_Cottage.jpeg)\n\nDesigned by the Colonial Architect, Porden Kay, this house (originally intended for the Superintendent) was situated near the northern end of the Arthur Wall, and initially had two rooms and kitchen downstairs, with a (very) steep stairway to a small attic.\n\nIt appears never to have been occupied by any of the Superintendents, though it was certainly well-used. In its time it was home to an Overseer / gatekeeper, served as a porter’s Lodge and Tea Rooms. It then received extensions which allowed it to be used by the Board of Trustees and finally as the Administration building, with offices, library, Herbarium and Friends’ shop. It seems unnecessary to add that these extensions transformed an attractive stone cottage into a medley of discordant parts. Thankfully, it was restored to almost original condition in 1999. Today it is heritage listed.\n\n## Lily Pond\n\n![Lily Pond](../../assets/gallery/6-botanic-gardens/Lily_pond.jpeg)\n\nThis area has a long history at the gardens. This popular garden area has evolved from its initial functional use as a reservoir collecting rainfall runoff from the Domain in 1848, to being a display garden largely of water loving perennial plants surrounded by large established conifers from early planting of the Gardens in 1870.\n\nWe marveled at the monstrous leaves of Gunnera manicata, the winter sweet smelling Luculia pinceana, and the water lilies that the ducklings scoot over.\n\nA platform over the pond and the bridge allowed us to get close to the water and enjoy the garden from differing vantage points.\n\n## Tasmanian Plant Collection\n\n![Tasmanian Plant Collection](../../assets/gallery/6-botanic-gardens/Tasmanian_Native_Plants.jpeg)\n\nThis garden was established in 1991 in recognition of the need to develop an area dedicated to the display of Tasmanian Native plants within the RTBG.\n\nThe current Fernery was constructed in 1964, replacing an earlier one on the south side of the lily pond. It was designed by then Gardens Superintendent, Walter Tobias, and modified in 1974 when the cascading watercourse was created.\n\n## Anniversary Arch\n\n![Anniversary Arch](../../assets/gallery/6-botanic-gardens/Anniversary_arch.jpeg)\n\nThis romantic carved arch is set at the base of stone steps surrounded by tall shady trees and shrubs.\n\nThe arch was originally constructed in 1913 to span the entrance of the AMP Society’s original Elizabeth Street building. When that building was demolished, AMP donated the arch to the Gardens. It was re-erected in 1968 in time for celebrations of the Gardens’ 150th Anniversary.\n\n## Floral Clock\n\n![Floral Clock](../../assets/gallery/6-botanic-gardens/Flower_clock_1.jpeg)\n\nThis is an attractive clock decorated with bright flowers.\n\n## The Conservatory\n\n![The Conservatory](../../assets/gallery/6-botanic-gardens/Conservatory_1.jpeg)\n\nThe Conservatory was designed by Superintendent Ira Thornicroft, and completed in 1939. Its walls are built of sandstone salvaged from a demolished section of the Hobart General Hospital. There is a sandstone fountain at the centre.\n\n## French Explorers garden\n\n![French Explorers garden](../../assets/gallery/6-botanic-gardens/French_explorers_garden_4.jpeg)\n\nThe prominent feature of this garden is the French memorial fountain - an “Antipodean Voyage.”\n\nThe French Memorial Fountain is a significant sculptural element in the Gardens. It represents the bow and sails of an early French sailing ship, and was erected in 1972 to mark the bicentenary of the first of a number of French voyages of discovery that visited Tasmania from 1792.\n\nThe fountain was designed and constructed by the well-respected Australian artist Stephen Walker whose many other creative and beautifully detailed works can also be seen in other parts of Hobart and Tasmania, including the well-known bronze Bernacchi Tribute on the Hobart waterfront.\n\n## Japanese Garden\n\n![Japanese Garden](../../assets/gallery/6-botanic-gardens/Japanese_garden_14.jpeg)\n\nThe Japanese garden was designed by Kanjiro Harada, a landscape architect from Yaizu, Japan, Hobart’s sister city. The Garden officially opened in 1987. It emphasises traditional Japanese garden elements of wood, stone and water. This project involved a reciprocal Australian garden design project for Hobart’s Japanese sister city. The plants in the Garden largely consist of species native to Japan and selected cultivars, with Japanese maples a feature, particularly in autumn. The waterway with its associated tea house, waterwheel and bridges, acts as a focal point for the central plantings.\n\nIt’s beautiful in every season, with cherry blossom in spring then irises and water lilies in summer. The stunning Japanese maples put on a dazzling display in autumn, followed by the winter tracery of their bare branches. There are numerous conifers of all shapes, sizes and colours plus a plethora of Camellias and Azaleas.\n\n## Historic Eardley-Wilmot Wall\n\n![Historic Eardley-Wilmot Wall](../../assets/gallery/6-botanic-gardens/Historic_walls.jpeg)\n\nSir John Eardley-Wilmot became Governor in 1843 and with the appointment came the responsibility for the Gardens, which were suffering badly after ten tears of neglect following Davidson’s departure.\n\nThe monument to his tenure is seen in the 4 metre / 12-feet high convict-built brick wall, which stretches 280 metre /400 feet north–south across the Gardens, supported by numerous buttresses. It also extends in an east–west axis and finishes to the rear of the Administration building. The use of convict labour for this project, when unemployed free men were available, caused social unrest, and his reason for construction—“to keep grasshoppers out” — was derided. The wall did however, remain as the eastern marker for the Gardens’ border for many years and for most of this time contained only one opening towards its southern end. There are now five archways through the wall.\n\n## Tasmanian Community Food Garden\n\n![Tasmanian Community Food Garden](../../assets/gallery/6-botanic-gardens/Food_Garden_21.jpeg)\n\nThis area has a long history of cultivation as a food garden and orchard from the original Hangan’s Farm in 1806 to extensions of Government House vegetable beds until the 1950s. In more recent times it was the Economic Garden and Pete’s Vegie Patch. All up an unbroken 200 year history of productive plantings.\nCommunity beds.\n\nThe new Tasmanian Community Food Garden was completed in 2013 on the site of the original ‘Pete’s Patch’. This Garden is a working organic production and display garden, with a multitude of veggie production practices displayed including an example of the original six-bed crop rotation system made famous in the original patch.\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Botanical Gardens","title":"Day 6: Royal Tasmanian Botanical Gardens","description":"Australia’s second oldest Botanic Gardens, established just two years after Sydney.","date":"2023-04-02T03:00:00.000Z","image":{"src":"/tasmania-2023/_astro/Anniversary_arch.Vj9wcKKg.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/6-botanic-gardens/Anniversary_arch.jpeg"},"map":[-42.8654,147.3308,16],"tags":["Botanic Gardens","Domain","Hobart"]},{"id":"6-cenotaph.md","slug":"6-cenotaph","base":"/tasmania-2023/","collection":"post","body":"\nThe Hobart Cenotaph is the main commemorative military monument for Tasmania and is the centre of Anzac Day commemoration services. Hobart's shrine of remembrance, this culturally important area sits close to the city, with commanding views of the river and the mountain.\n\nThe Cenotaph is the centre of Anzac Day commemoration services at dawn and mid-morning, and is the destination of the marching procession. On Anzac Day at the break of dawn, a lone bugler always plays the Last Post.\n\nThe Hobart Cenotaph is an Art Deco reinterpretation of a traditional Egyptian obelisk. The Cenotaph was originally erected to commemorate the war dead of Tasmania from World War I, but has had subsequent additions made for all conflicts since then in which Tasmanian soldiers have served.\n\nThe monument was designed by Hobart architectural firm Hutchinson and Walker, after their entry had won a public competition held in 1923 for the structure's design.\n\nFrom here we can see great views of the city and also the Tasman Bridge.\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Cenotaph","title":"Day 6: Cenotaph","description":"The Cenotaph in Hobart is a great place to get 360 degree views.","date":"2023-04-02T01:00:00.000Z","image":{"src":"/tasmania-2023/_astro/Hobart Cenotaph (3).CRj7OV-n.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/6-cenotaph/Hobart Cenotaph (3).jpeg"},"map":[-42.87701,147.33642,17],"tags":["Domain","Cenotaph","Hobart"]},{"id":"6-domain.md","slug":"6-domain","base":"/tasmania-2023/","collection":"post","body":"\nAfter breakfast, we walked to the east towards the Queen's Domain - the site for a range of sporting venues and grounds. The origin of the name comes from the land formerly owned by the Crown (Government Domain) and the Government House is located here.\n\nHowever, early colonists treated the land as public land and often called it the People’s Paddock. It was the place to put abattoirs, to quarry building materials, to agist animals, to grow food, to build and berth boats and to store munitions. Finally, in 1901, the Governor gives the Domain (except [Government House](https://www.govhouse.tas.gov.au/)) to the people of Tasmania.\n\nThe aim was to make the Domain a people’s park. To bring civilisation to the Domain. At the time the aim was to cover the Domain with parks and formal gardens such as Sydney’s Centennial Park or New York’s’ Central Park. The Domain was to become a venue for the pleasure of the people with the development of carriage drives, botanical gardens, ceremonial spaces and events spaces and facilities.\n\nToday, the Domain is the site of the Botanical Gardens as well as a former Beaumaris Zoo.\n\nWe started by traversing past the Railway Roundabout. This curious landmark looks quite futuristic with a space age design fountain.\n\nWe then visited the University Rose Gardens, where we can see the majestic Domain House in the background. Finally, there is a beautiful pedestrian bridge here called Rose Garden Bridge.\n\nThe Hobart Zoo (also known as Beaumaris Zoo) was an old-fashioned zoological garden located in the Domain. It is most famous for being the location where footage of the last known living Tasmanian tiger or thylacine was taken in 1936. The Zoo was closed in 1937 due to severe financial problems. The site was acquired by the Royal Australian Navy and converted into a fuel storage depot for the nearby HMAS Huon shore base. The Navy used the site from 1943 until 1991, when it reverted to the Hobart City Council and was used as a storage depot. It was sold in 2019 for A$3.9m and is now a 16-room privately owned family home.\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Queen's Domain","title":"Day 6: Queens Domain","description":"The Domain is a public space in Hobart with a lot of history.","date":"2023-04-02T00:00:00.000Z","image":{"src":"/tasmania-2023/_astro/Government House (1).P_b7-GVD.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/6-domain/Government House (1).jpeg"},"map":[-42.8672,147.3271,15],"tags":["Domain","University Rose Garden","Beaumaris Zoo","Government House","Rose Garden Bridge","Railway Roundabout","Hobart"]},{"id":"6-farmgate-market.md","slug":"6-farmgate-market","base":"/tasmania-2023/","collection":"post","body":"\nWe started Sunday morning with a visit to yet another local institution - the [Farm Gate Market](https://farmgatemarket.com.au/).\n\nEvery Sunday, come rain, hail or shine … Farm Gate Market turns Bathurst Street into a bustling farmers’ market.\n\nTwelve years back, the market began with an honest and simple philosophy – that if you couldn’t eat it, drink it, grow it or meet the producer, then you wouldn’t find it at Farmy.\n\nThat ethos has always held true. And now, the little farmers’ market that began with just 12 producers has grown into an essential Sunday ritual for locals and one of the top five farmers’ markets in the country.\n\nTasmania’s distinct growing seasons make for an ever-changing array of produce and that’s what we celebrate every Sunday.\n\nStaying true to what’s in season locally is reflected throughout the market; on fresh produce stalls, in artisan foods and on street food vendors menus.\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Farm Gate Market","title":"Day 6: Farm Gate Market","description":"The Farm Gate is open every Sunday in Hobart.","date":"2023-04-01T22:00:00.000Z","image":{"src":"/tasmania-2023/_astro/Farm Gate Market (4).BLzp1UUo.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/6-farmgate-market/Farm Gate Market (4).jpeg"},"map":[-42.88125,147.32501,19],"tags":["Farm Gate Market","Sunday"]},{"id":"6-hobart-waterfront.md","slug":"6-hobart-waterfront","base":"/tasmania-2023/","collection":"post","body":"\nWe spent the evening walking along Hobart's waterfront. We covered Franklin Wharf, Consitution Dock, Victoria Dock and the replica of Mawson's Hut.\n\nConstitution Dock is home to a portion of Hobart’s fishing fleet and not only used by fishing boats, but by personal yachts and a variety of other vessels. This area in the port of Hobart is famous for being the finishing line for the annual Sydney to Hobart Yacht Race, which begins on Boxing Day (the day after Christmas) and usually wraps up to a cheering crowds on New Year’s Eve.\n\nHistorically, this part of Tasmania was its lifeline to the rest of the world. The harbour was the gateway for trade and commerce and water the key medium for transport. Whether for business or pleasure, visitors and businessmen alike arrived here.\n\nThe Georgian sandstone warehouses that line the waterfront and now serve as restaurants and galleries were once filled with grain, fruit, vegetables, timber, and a plethora of other materials and produce that were delivered by boat. Large piers were built out into Sullivans Cove, complete with mobile cranes that ran on railway tracks and were used to unload ships. Truly a hub of activity, the harbour was the key juncture for large-scale deliveries. In honor of times past, visitors can still view some of the equipment to this day which remains in the harbour.\n\nIn modern times, the harbour is still home to range of vessels (even Antarctic research vessels and cruise ships), but it no longer serves as an entry point for large deliveries and unloading of ships. Most large shipments are now sent via rail from the north of Tasmania.\n\nWe also admired an old institution, [Mures](https://www.mures.com.au/) and the many seafood stalls or waterfront restaurants.\n\nLastly, we posed outside [Mawson’s Hut Replica Museum](https://www.mawsons-huts.org.au/replica-museum/) - a small, true to life museum which duplicates the historic huts used by the team of 18 courageous men who went on the Australian Antarctic Expedition (AAE) of 1911-14 and lived in Cape Denison, Commonwealth Bay. Sadly, we did not have time to visit the actual museum because it was after closing time.\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Constitution Dock","title":"Day 6: Hobart Waterfront","description":"Australia's second oldest museum and featuring the collections of Australia's oldest scientific society.","date":"2023-04-02T06:00:00.000Z","image":{"src":"/tasmania-2023/_astro/Constitution Dock.BLlzzo2S.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/6-hobart-waterfront/Constitution Dock.jpeg"},"map":[-42.88262,147.33314,17],"tags":["Constitution Dock","Mures","Mawson Hut","Hobart"]},{"id":"6-hobart.md","slug":"6-hobart","base":"/tasmania-2023/","collection":"post","body":"\nWe were very tired after visiting the Botanical Gardens and returned back to the city for a very late lunch.\n\nWe passed through the Rose Garden Bridge and took a few photos of the east side of the city, including the [Scots Church](https://www.scotschurch.com.au/), the [Royal Hobart Hospital](https://www.health.tas.gov.au/hospitals/royal-hobart-hospital), [Theatre Royal](https://www.theatreroyal.com.au/) and the [Ronald McDonald House](https://www.rmhc.org.au/programs/houses/tas/ronald-mcdonald-house-hobart).\n\nWe had banh mi for lunch at [Ja and Jon](https://jajonbanhmi.com.au/).\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Hobart","title":"Day 6: Hobart","description":"Returning to the city for a late lunch from the Botanic Gardens.","date":"2023-04-02T04:00:00.000Z","image":{"src":"/tasmania-2023/_astro/Roast pork banh mi.B6PCus_a.jpeg","width":2560,"height":2560,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/6-hobart/Roast pork banh mi.jpeg"},"map":[-42.88169,147.3277,17],"tags":["lunch","Hobart"]},{"id":"7-henry-jones.md","slug":"7-henry-jones","base":"/tasmania-2023/","collection":"post","body":"\nAt [The Henry Jones Art Hotel history](https://www.thehenryjones.com/) and art collide. Located in the Hunter Street precinct, Hobart’s oldest waterfront warehouses have been thoughtfully reimagined as Australia’s first dedicated art hotel.\n\nThrough the rise and fall of industries, including Sir Henry Jones’ IXL jam empire, the harbourside location has been central to Hobart and its people. Today, the precinct hums with galleries, award-winning restaurants, bars and cafes.\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Henry Jones Art Hotel","title":"Day 7: The Henry Jones Art Hotel","description":"Luxury hotel located at the site of a former jam factory.","date":"2023-04-03T02:00:00.000Z","image":{"src":"/tasmania-2023/_astro/Henry Jones Art Hotel (1).Xeq-C9ZJ.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/7-henry-jones/Henry Jones Art Hotel (1).jpeg"},"map":[-42.88132,147.33573,18],"tags":["Henry Jones","Hobart"]},{"id":"7-hobart-waterfront.md","slug":"7-hobart-waterfront","base":"/tasmania-2023/","collection":"post","body":"\n## Princes Wharf\n\n[PRINCES WHARF No1](https://www.princeswharf1.com.au/) is located Hobart’s waterfront in the heart of the historic Salamanca, just 5 minutes walk from the Hobart CBD. It is often used for events. Nearby is the [Spirit of Hobart](https://www.hobarthistoriccruises.com.au/), a ship used for tour cruises.\n\n## The Lady Nelson\n\nBerthed at Elizabeth st Pier on Hobart's waterfront, the [Lady Nelson](https://www.ladynelson.org.au/ship) tallship is one of the most popular attractions for vistors and a much loved icon of Hobart's fascinating maritime history.\n\nBuilt locally and launched in 1988, the current Lady Nelson is a replica of the original Lady Nelson involved in establishing the settlement of Hobart Town in 1804.\n\nWith her twin masts rigged with square sails based on the original ship's plans, the Lady Nelson offers a unique experience to step back in time to when sailing ships first graced the shores of Hobart.\n\n## Brooke St Pier\n\n[Brooke Street Pier](http://www.brookestreetpier.com/) is a four storey floating pier. It is both a building and a boat.\n\nThe concept recreates the former Brooke Street Pier with a modern innovative interpretation - using the maritime heritage and architecture of the precinct to deliver a new, vibrant working cruise/ferry centre.\n\nThe floating terminal is in essence a large floating barge, 80m long by 20m wide, on which sits the new lightweight diaphanous building.\n\nThe terminal thus rises and falls with the tide. This means that the structure will never be affected by global warming, although it will be low and close to the waterline.\n\nThe lightweight translucent/ transparent skin of the upper building acts like a conservatory in creating a passively heated indoor environment, which is augmented by hydronic heating cooling systems utilising the constant water temperatures under the pier itself.\n\nFrom here, one can catch a ferry to [MONA](https://mona.net.au) - an eclectic private museum. We saw one of the ferries, the MR-II (MR stands for MONA ROMA), docked here.\n\n## Bernacchi Tribute Sculptures\n\nThe sculpture by Stephen Walker commemorates the Tasmanian Antarctic explorer Louis Bernacchi (1878 - 1942). The sculpture is titled \"Self portrait, Louis and Joe\", and shows Louis Bernacchi posing with his dog in front of an old-style camera.\n\n### Front Inscription\n\n> Tasmanian Louis Bernachhi (1878 - 1942) was the first Australian to winter in Antarctica.\n>\n> Louis grew up on Maria Island, attended Hobart`s Hutchins School, and from his early years was a strong advocate for Australia`s involvement in Antarctica.\n>\n> A scientist, photographer and writer, Louis left Hobart with the Borchgrevink Antarctic Expedition on the 17th December 1898. Their vessel, \"The Southern Cross\" departed from the point where this tribute now stands.\n>\n> Louis later joined Scotts 1901 - 1904 `Discovery` Expedition as Chief Scientist, taking his favourite Husky \"Joe\" who had Been with him on Borchgrevink`s earlier expedition.\n\n### \"Heading South\"\n\n> Presented to the people of Hobart by James and Margaret Bleasel to commemorate the historic links between the\n> Port of Hobart, the Southern Ocean and Antarctica\n>\n> \"Seals and Penguins: unveiled by the Rt. Hon., the Lord Mayor of Hobart Alderman Dr. J. W. Freeman\n> 7th January, 1998\n>\n> \"The Bernacchi Tribute\" unveiled by Mr. Jim Bacon. M.H.A., Premier of Tasmania\n> 10th September, 2002\n>\n> Sculptor, Stephen Walker A.M.\n\n## 150 Years of the Foundation of Hobart\n\nThe monument commemorates 150 years of European settlement in Hobart which was founded in 1804 by Lieutenant Collins.\n\nA plaque was added in 2004 on the 200th anniversary and lists the names of the first settlers. It also acknowledges the Mouheneenner People as original custodians of the land.\n\nThe first European settlement in the Hobart area began in 1803 as a penal colony and a defensive outpost at Risdon Cove, officially named Hobart on the eastern shores of the Derwent River. This was undertaken under British concerns over the presence of French explorers in the South Pacific. It began as a collection of tents and huts, with a population of 178 convicts, 25 marines, 15 women, 21 children, 13 free settlers and 10 civil officers.\n\nIn 1804 the settlement was moved was moved to a better location which was named \"Hobart's Town\" at the present site of Hobart at Sullivans Cove, making it the second oldest city in Australia.\n\n## School of Creative Arts\n\nThere are some interesting large scale sculptures here in a courtyard inside the \"Centre for the Arts\" building.\n\n## Drunken Admiral\n\n[The Drunken Admiral](https://drunkenadmiral.net/) has been operating as a family run restaurant on Hobart’s Old Wharf since 1979.\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Constitution Dock","title":"Day 7: Hobart Waterfront","description":"We did another walk along Franklin Wharf from Salamanca to the Henry Jones building.","date":"2023-04-03T01:00:00.000Z","image":{"src":"/tasmania-2023/_astro/Constitution Dock (2).BIWRRAST.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/7-hobart-waterfront/Constitution Dock (2).jpeg"},"map":[-42.88262,147.33314,17],"tags":["Franklin Wharf","Brooke St Pier","Bernacchi Tribute Sculptures","Anniversary Memorial","Centre for the Arts","Drunken Admiral","Hobart"]},{"id":"7-hobart.md","slug":"7-hobart","base":"/tasmania-2023/","collection":"post","body":"\nAnd that's it - the end of our trip. We revisited the Thai Veggiel Hut for lunch, then took a few last photos of this beautiful city before we headed back to the hotel to clean up, pack, and then head to the airport via the shuttle bus.\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Hobart","title":"Day 7: Hobart","description":"Ending our trip to Hobart with lunch.","date":"2023-04-03T03:00:00.000Z","image":{"src":"/tasmania-2023/_astro/Thai Veggie Hut (1).DWq-FPFq.jpeg","width":2560,"height":1920,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/1-hobart/Thai Veggie Hut (1).jpeg"},"map":[-42.8822,147.332,16],"tags":["lunch","Hobart"]},{"id":"7-salamanca-place.md","slug":"7-salamanca-place","base":"/tasmania-2023/","collection":"post","body":"\n[Salamanca](https://www.salamanca.com.au/) is located along the edges of the Derwent river just a short 5 min walk from the Hobart CBD. Salamanca is home to some of Tasmania’s most recognisable sandstone buildings and heritage architecture. This area is also the Heart of Hobart’s nightlife being home to a majority of the best Restaurants, Bars and nightclubs. Salamanca is also deeply integrated into Tasmania’s tourism sector with Salamanca’s Weekly Market being held along Salamanca Place every Saturday. Along with Brooke Street Pier home to the Mona Ferry’s and the Peppermint Bay Cruise as well as an indoor shopping market which showcases some of Tasmania’s most unique businesses.\n\n## Salamanca Place\n\nSalamanca Place is a historic docks area of Hobart lined with a long row of simple Georgian sandstone warehouses built in the 1830s. These mellow north-facing buildings once stored grain, wool, whale oil, apples and imported goods from around the world. Rows of Georgian era sandstone warehouses that once serviced the ocean going clippers have been converted into a plaza of restaurants and shop, with pubs, artists, galleries, craft shops and nightlife adding to the relaxed atmosphere of the place after sundown.\n\nThe name Salamanca Place recalls a town in Spain which the Allied army led by the Duke of Wellington took on 17th June 1812 during the Peninsula War (1808-14). Castray Esplanade, which adjoins Salamanca Place, recalls Luke Richard Castray, Hobart's Commissioner General who conceived and designed the roodway as a link between the wharves on Sullivan's Cove and Battery Point.\n\n## Salamanca Arts Centre\n\nWe also wandered around [Salamanca Arts Centre](https://www.sac.org.au/) which hosts artist studios, galleries, venues, retail outlets, arts organisations and public spaces, housed in the historic sandstone warehouses.\n\n## Salamanca Square\n\n[Salamanca Square](https://www.salamancasquare.com.au) began its life as a quarry that dates back to the earliest days of the Sullivan's Cove settlement in the early 19th Century.\n\nThe quarry is still visible behind the modern apartments and shops that line the Square and stands as a significant symbol of Hobart's history and the sweat and toil of our convicts and early settlers.\n\nHundreds of convicts were used to quarry out the cliffs, cut the stone and build the row of beautiful Georgian sandstone warehouses that were built in the 1830 that front the Square.\n\nIn 1995, after considerable opposition from the Battery Point Progress Association and the Salamanca Traders Association, the Hobart City Council approved a development application for the Salamanca Quarry, which resulted in the creation of Salamanca Square.\n\nComprising apartments, shops, restaurants, offices and a public space, the Square was completed in 1997.\n\nToday Salamanca Square offers a piazza space for relaxing and entertainment.\n\n## Happy Birthday Mr President\n\nThis is a large scale [sculpture](https://gillieandmarc.com/blogs/find-our-art/happy-birthday-mr-president-salamanca-square-hobart-tas-australia) of a dog photographer and a rabbit in a Marilyn Monroe pose.\n\nRabbitwoman and Dogman represent a loving friendship between a very unlikely couple. Their very existence helps us become more open-minded. Through sculpture, the humbling of mankind can be further intensified. Portraying Rabbitwoman as the iconic Marilyn Monroe being photographed by one of the artist’s paparazzi dogs, highlights our obsession with celebrities in an amusing way. Using humour is both an accessible and enjoyable way to re-examine our relationship with celebrities.\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Salamanca Place","title":"Day 7: Salamanca Place","description":"Salamanca Place looks very different when the market isn't on.","date":"2023-04-02T23:00:00.000Z","image":{"src":"/tasmania-2023/_astro/Salamanca Place.DWkLaAJI.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/7-salamanca-place/Salamanca Place.jpeg"},"map":[-42.88668,147.33344,18],"tags":["St David","Hobart"]},{"id":"7-st-davids.md","slug":"7-st-davids","base":"/tasmania-2023/","collection":"post","body":"\nToday, unfortunately, is the last day of our trip, we will fly back to Sydney in the afternoon. So we only have about half a day to do a last exploration of the city before we leave.\n\nThe following information is abridged from [On The Convict Trail](https://ontheconvicttrail.blogspot.com/2013/04/st-davids-park-hobart.html).\n\nThe first stop is [St. David's Park](https://www.hobartcity.com.au/Community/Parks-reserves-and-sporting-facilities/Find-a-park-or-sportsground/St-Davids-Park) - one of Hobart's premier classic parks, popular with weddings in the beautiful rotunda and public events, adjacent to the famous Salamanca Markets.\n\nSt David's Park is a formal English style walled park and dates from the beginning of European settlement in 1804. This was the site of the first burial ground in Tasmania, marked out by Lieutenant-Governor David Collins and the Reverend Robert Knopwood in April 1804. At that time the burial ground was ‘a place of real seclusion and rare beauty’, located away from the main settlement and surrounded by an ‘exquisite natural shrubbery’. Information posted on site explains that it was called St David's Cemetery as a mark of respect to the memory of the Colony's founding.\n\nSt David’s was Hobart’s main cemetery and many of its most prominent citizens were buried there. As the town expanded, the land surrounding the burial ground was gradually developed and by the 1850s people were voicing concerns about the health risks associated with burying corpses in such a thickly populated neighbourhood. The Government passed the Cemeteries Act in 1865 and the opening of the Cornelian Bay cemetery in 1872 allowed St Davids and all the other burial grounds within the city to be closed.\n\nIn 1919 it was handed over to the City Council to be used as a recreation ground. A major feature of the park is the memorial wall which is made up of many of the original headstones from the park’s previous life as the Hobart colony’s first cemetery. It contains the names and details of many “First Fleeters” and many of the early settlers of Hobart Town.\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"Constitution Dock","title":"Day 7: St. David's Park","description":"Last day at Hobart! Headed towards St. David's Park for a quick tour of the city before we depart.","date":"2023-04-02T22:00:00.000Z","image":{"src":"/tasmania-2023/_astro/St Davids Park (4).CP7UlcIN.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/7-st-davids/St Davids Park (4).jpeg"},"map":[-42.88637,147.32876,17],"tags":["St David","Hobart"]},{"id":"7-tassal-shop.md","slug":"7-tassal-shop","base":"/tasmania-2023/","collection":"post","body":"\n[The Salmon Shop](https://shop.tassal.com.au/) was created in 2007 as a centre to bring together everything that is Tassal salmon. Located in Salamanca Square, the shop includes a comprehensive range of delicious Tasmanian salmon products, deli stocked with delectable salmon accompaniments along with cook books and cooking utensils.\n","trip":"Tasmania 2023","place":"Australia","timezone":"Australia/Tasmania","location":"The Salmon Shop","title":"Day 7: Tassal - The Salmon Shop","description":"Deep in a heart of Salamanca Square is a shop dedicated to all things salmon.","date":"2023-04-03T00:00:00.000Z","image":{"src":"/tasmania-2023/_astro/Tassal The Salmon Shop.CxYqUJ3V.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/tasmania-2023/src/assets/gallery/7-tassal-shop/Tassal The Salmon Shop.jpeg"},"map":[-42.88718,147.33207,19],"tags":["St David","Hobart"]}]