[{"id":"thailand-2024-2","slug":"index.html","base":"/thailand-2024-2/","collection":"trip","body":"Ever since the COVID-19 pandemic lockdown, a group of us have been dreaming that we will take an overseas trip together once international travel restrictions have been lifted and we enter the brave new world of post-COVID vacations. Our dream is finally realised in 2024 when we are able to plan a trip to Bangkok. We literally spent many days talking about where we would go and what activities we would participate in.\n\nWe quickly agreed some ground rules - we would focus on food, sightseeing and shopping (not necessarily in that order, but that would be my personal priorities). The opportunity came when we realised plane tickets to Bangkok were quite reasonable (not quite pre-COVID sale prices but okay) and we all quickly booked our flights. We then scoured around for properties to rent so that we can stay together as a group.\n\nWe decided initially to just visit Chiang Mai and Bangkok, but then we realised there were a lot of things to see in Chiang Rai and it would be rushed to do it as a day trip. We hired a private tour driver who planned an itinerary for us. Cat, who is half-Thai, took charge of planning our itinerary in Bangkok.\n\nThis trip is so massive for the sake of optimising storage I have broken the trip to two parts. In Part 1, we fly from Sydney and arrive in Chiang Mai via Bangkok. We spent about a week in both Chiang Mai and Chiang Rai, visiting a variety of locations and sampling food from many places.\n\nIn Part 2 the adventure continues in Bangkok as we fly from Chiang Mai to Bangkok and spent a week there including a side trip to Amphawa.","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Thailand","title":"Thailand 2024 Part 2","description":"Part 2 of a long planned and awaited Girl's trip to Thailand, where we conclude the trip by spending 7 days in Bangkok.","date":"2024-11-26T11:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/trip.MGFqZ6Lt.jpeg","width":2560,"height":1707,"format":"jpg"},"tags":["Thailand","Bangkok"]},{"id":"day-08-flight","slug":"day-08-flight","base":"/thailand-2024-2/","collection":"post","body":"We checked out of the house we were staying, and took a van to Chiang Mai airport. We boarded the flight at around 12pm and landed early, around 1:30pm to [Suvarnabhumi Airport](https://www.bangkokairportonline.com) (ท่าอากาศยานสุวรรณภูมิ).\n\nWe had prebooked an airport transfer van through the AirBNB property we are staying in Bangkok so we didn't wait very long at the airport. The trip to the apartment at Mahatun took a lot faster that we anticipated because traffic was quite light at that time.","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Suvarnabhumi Airport","title":"Day 8: Flight from Chiang Mai to Bangkok","description":"We bade goodbye and boarded Thai Airways TG105 from Chiang Mai to Bangkok.","date":"2024-11-21T07:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/06_Group.CE_gnYs8.webp","width":2560,"height":1707,"format":"webp"},"map":[13.682831776210376,100.74692364703516,17],"tags":["Bangkok","Suvarnabhumi","airport","flight"]},{"id":"day-08-apartment","slug":"day-08-apartment","base":"/thailand-2024-2/","collection":"post","body":"We stayed an AirBNB apartment called [Prani Ploenchit](https://www.airbnb.com.au/rooms/843913711884697422). It's quite small (compared to the house we had in Chiang Mai) but quite well appointed with 2 bedrooms, 2 toilets and a living room/kitchen.","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Prani Ploenchit","title":"Day 8: Our Apartment at Khet Pathum Wan","description":"Photos from the apartment we stayed in Bangkok.","date":"2024-11-21T09:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/03_Living_Room.BNSePIPx.webp","width":2560,"height":1707,"format":"webp"},"map":[13.742629090467684,100.54927202512506,17],"tags":["Bangkok","Mahatun Plaza","Prani Ploenchit","accommodation"]},{"id":"day-08-mahatun","slug":"day-08-mahatun","base":"/thailand-2024-2/","collection":"post","body":"The apartment we are staying is located at Mahatun Plaza, very close to the BTS Ploenchit station and within walking distance to quite a few shopping centres.\n\nEven though I had lunch on the plane, we opted for another lunch at Madam Somtum - [Facebook Page](https://www.facebook.com/madamsomtum/). This is an Esan restaurant serving different varieties of somtum along with other Thai dishes, and apparently owned by the same owner as the apartment we are staying in.\n\nThe restaurant has an interesting decor, and the salted egg somtum we ordered was really nice!","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Madam Somtum","title":"Day 8: Lunch at Madam Somtum at Mahatun","description":"We are staying at Mahatun Plaza near Ploenchit BTS Station, and had a late lunch at Madam Somtum.","date":"2024-11-21T08:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/04_Madame_Somtum.C2IawohY.webp","width":2560,"height":1707,"format":"webp"},"map":[13.742629090467684,100.54927202512506,17],"tags":["Bangkok","Mahatun Plaza","Madam Somtum","lunch","food"]},{"id":"day-08-yaowarat","slug":"day-08-yaowarat","base":"/thailand-2024-2/","collection":"post","body":"Yaowarat Rd is the main artery of Bangkok's Chinatown, and every night it is full of food stalls. We saw many interesting stalls selling anything from giant oysters to sculptured 3D ice cream to all kinds of food, even shark fins and bird nests.\n\nWe couldn't help but stop at the famous Plaeng Nam Shark Fin-Bird’s Nest（義福巷燕窩). I was not game enough to try the shark fin soup, but I had the crab fried rice and tasted the fish maw soup.\n\nAfter that we also tried the famous wanton mee at the junction of Yaowarat Road and Yaowa Phanit called Mung Korn Khao Noodle.\n\nAfter that, we walked around Yaowarat Rd and stopped by a Thai dessert stall to have coconut ice cream desserts. All in all it was a very interesting night, and I really wished I could have eaten more.","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Yaowarat Rd","title":"Day 8: Dinner at Yaowarat (Chinatown)","description":"We ventured to famous Yaowarat Rd via BTS and the metro to search for food.","date":"2024-11-21T13:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/02_MRT_station.CgQ9SCdH.webp","width":2560,"height":1707,"format":"webp"},"map":[13.740539816019728,100.50958079393155,17],"tags":["Bangkok","Yaowarat","Chinatown","food","dinner"]}]