[{"id":"thailand-2024-1","slug":"index.html","base":"/thailand-2024-1/","collection":"trip","body":"Ever since the COVID-19 pandemic lockdown, a group of us have been dreaming that we will take an overseas trip together once international travel restrictions have been lifted and we enter the brave new world of post-COVID vacations. Our dream is finally realised in 2024 when we are able to plan a trip to Bangkok. We literally spent many days talking about where we would go and what activities we would participate in.\n\nWe quickly agreed some ground rules - we would focus on food, sightseeing and shopping (not necessarily in that order, but that would be my personal priorities). The opportunity came when we realised plane tickets to Bangkok were quite reasonable (not quite pre-COVID sale prices but okay) and we all quickly booked our flights. We then scoured around for properties to rent so that we can stay together as a group.\n\nWe decided initially to just visit Chiang Mai and Bangkok, but then we realised there were a lot of things to see in Chiang Rai and it would be rushed to do it as a day trip. We hired a private tour driver who planned an itinerary for us. Cat, who is half-Thai, took charge of planning our itinerary in Bangkok.\n\nI tried my best to lose weight before the trip, but unfortunately I completely failed in this endeavour so I boarded the plane feeling heavy.\n\nThis trip is so massive for the sake of optimising storage I have broken the trip to two parts. In Part 1, we fly from Sydney and arrive in Chiang Mai via Bangkok. We spent about a week in both Chiang Mai and Chiang Rai, visiting a variety of locations and sampling food from many places.\n\nIn [Part 2](/thailand-2024-2/) the adventure continues in Bangkok as we fly from Chiang Mai to Bangkok and spent a week there including a side trip to Amphawa.","trip":"Thailand 2024 Part 1","place":"South East Asia","timezone":"Asia/Bangkok","location":"Thailand","title":"Thailand 2024 Part 1","description":"Part 1 of a long planned and awaited Girl's trip to Thailand, where we visit Chiang Rai and Chiang Mai. in Part 2 we continue our trip in Bangkok.","date":"2024-11-19T05:00:00.000Z","image":{"src":"/thailand-2024-1/_astro/trip.CgyoIZQu.jpeg","width":4485,"height":2990,"format":"jpg"},"tags":["Thailand","Chiang Mai","Chiang Rai"]},{"id":"day-02-1-maya","slug":"day-02-1-maya","base":"/thailand-2024-1/","collection":"post","body":"Cat and I both woke up early, around 5AM local time (since that corresponded to 9AM Sydney time), so we decided to explore the neighbourhood.\n\nNearby is an old mansion that looked like it has seen better days:\n\n![Old Mansion](../gallery/day-02-maya/04_Mansion.webp)\n\nWe sneaked out of the house around 7AM and walked out of the quite residential street of Soi Muban Lanna Villa onto the main road (Interestingly named the Super Highway!). Across the Super Highway is [MAYA Lifestyle Shopping Center Chiangmai เมญ่า ไลฟ์สไตล์ ช้อปปิ้ง เซ็นเตอร์ เชียงใหม่](https://mayashoppingcenter.com). This is a big mall with cinemas, concept stores, supermarket, and many dining options, but it was not yet open:\n\n![Maya](../gallery/day-02-maya/19_Maya_Mall.webp)\n\n![Maya](../gallery/day-02-maya/05_Maya_Mall.webp)\n\nNext to the mall is an interesting elephant shrine. In Thailand, the elephant is considered a sacred animal and is closely associated with Buddhism, the predominant religion in the country. The white elephant, in particular, is seen as a symbol of purity and spiritual power. It is believed to be a harbinger of good fortune and prosperity. The image of the elephant can be found in many temples and shrines across Thailand, where they are worshipped and offered food and water as a sign of respect.\n\n![Elephant Shrine](../gallery/day-02-maya/03_Elephant_Shrine.webp)\n\n![Elephant Shrine](../gallery/day-02-maya/04_Elephant_Shrine.webp)\n\n![Chris](../gallery/day-02-maya/10_Elephant_Shrine.webp)\n\nAlso nearby is a shrine full of roosters. The rooster holds a significant place in Thai culture, representing courage, strength, and vigilance. In Buddhism, the rooster symbolizes the dawn, heralding the arrival of a new day and the dispelling of darkness. It is believed making offerings to roosters will bring prosperity and business success.\n\n![Rooster shrine](../gallery/day-02-maya/08_Rooster_Shrine.webp)\n\n![Rooster shrine](../gallery/day-02-maya/09_Rooster_Shrine.webp)\n\nOpposite Maya on Huay Kaew Rd is trendy Think Park, which is a shopping and cafe space.\n\n![Think Park](../gallery/day-02-maya/20_Think_Park.webp)\n\nWe then walked west along Huay Kaew Rd and passed this golden arch:\n\n![Arch](../gallery/day-02-maya/12_Arch.webp)\n\nBeyond this is a trendy cafe called [Tiger TED Cafe](https://www.facebook.com/profile.php/?id=100055000754567). We explored here and Cat ordered a juice drink.\n\n![alt text](../gallery/day-02-maya/15_Tiger_TED_Cafe.webp)\n\n![Sleeping Cat](../gallery/day-02-maya/16_Sleeping_Cat.webp)\n\nAfter the cafe is the Kat Rin Kam night market and food centre.\n\n![Kat Rin Kham](../gallery/day-02-maya/13_Kat_Rin_Kham.webp)\n\n![Food Centre](../gallery/day-02-maya/17_Food_Center.webp)\n\nWandering back to the house via Soi Muban Lanna Villa Rd, we stopped by at Furama Hotel, a local landmark and owned by relatives of one of Cat's friends.\n\n![Furama Hotel](../gallery/day-02-maya/22_Furama_Hotel.webp)\n\n![Furama Hotel](../gallery/day-02-maya/23_Furama_Hotel.webp)\n\n![Furama Hotel](../gallery/day-02-maya/24_Furama_Hotel.webp)","trip":"Thailand 2024 Part 1","place":"South East Asia","timezone":"Asia/Bangkok","location":"Maya Lifestyle Shopping Centre","title":"Day 2: Early morning walk around Maya Mall","description":"Woke up early, and decided to explore our neighbourhood by walking to Maya Lifestyle Shopping Centre.","date":"2024-11-13T00:00:00.000Z","image":{"src":"/thailand-2024-1/_astro/05_Maya_Mall.OTLZ-n_Y.webp","width":2560,"height":1707,"format":"webp"},"map":[18.802458,98.967267,17],"tags":["Chiang Mai","MAYA","Think Park","Huay Kaew Rd","morning","walk","elephant","shrine","rooster","Furama Hotel","Kat Rin Kam","Tiger TED Cafe"]},{"id":"day-01-flight","slug":"day-01-flight","base":"/thailand-2024-1/","collection":"post","body":"## Checkin\n\nMargaret and I took at taxi at 6:30am and arrived at Sydney Airport International Terminal. Fortunately, at this hour of the day, with nearly 3 hours before our flight, the queue at the checkin counter was quite short, plus we had already checked in online the day before so we just needed to drop our bags. The girl behind the counter was Indonesian and she was very helpful and checked our luggage all the way to Chieng Mai. She also assisted us with boarding the lane.\n\n## AMEX Lounge\n\nAfter checkin, we headed to the AMEX Lounge. Unfortunately this was located on the opposite end of the airport relative to our boarding gate, so it's a bit of a walk to the lounge. Luckily Margaret had two spare lounge passes with her AMEX Card so we were able to enjoy the facilities of the lounge. I had my usual breakfast of bacon, scrambled eggs, sausages, baked beans, potatoes and toast plus a cup of coffee.\n\n![AMEX Lounge](../gallery/day-01-flight/02_AMEX_Lounge.webp)\n\n![AMEX Lounge](../gallery/day-01-flight/03_AMEX_Lounge.webp)\n\nWhen it was to boarding we headed towards the gate. Along the way, I saw a Gentle Monster shop at the airport. I saw a similar shop at TRX in Kuala Lumpur recently so I knew they were famous for their gigantic sculptures. I posed in front a giant rotating face and Margaret took a photo just when the face was looking at me.\n\n![Gentle Monster](../gallery/day-01-flight/05_Gentle_Monster.webp)\n\n## Boarding flight to Bangkok\n\nWe all met together as a group at the boarding gate for Thai Airways flight TG 476 to Bangkok. We were lucky in that some of us were in Group 2 boarding, which is the first group to board after the premium passengers, so we entered the plane early and had plenty of cabin luggage space to put our bags.\n\n![Plane](../gallery/day-01-flight/04_Plane.webp)\n\n![Group](../gallery/day-01-flight/06_Group.webp)\n\n![Plane](../gallery/day-01-flight/07_Plane.webp)\n\nThe flight was uneventful and quite pleasant. I was pleasantly surprised that I received all my meals first as I had preordered the \"oriental vegetarian\" option for my meals. I watched two movies:\n\n- [Lovesick Ellie](https://www.dailymotion.com/video/x95s79u): Eriko Ichimura (Nanoka Hara) has an ordinary and unnoticed student life at her high school. Her only joy is to watch popular male student Akira Omi (Nanoka Hara) and imagine them being a couple. She writes down those thoughts on her social media account under the name of Lovesick Ellie. Akira Omi seems like a perfect guy, with good looks and gentle personality. One day, she witnesses Akira Omi spouting vulgar language and she realizes he is kind of like a two-faced person. Making things worse, her fantasy thoughts are discovered by him. He thinks that she is funny and he approaches her. [(AsianWiki)](https://asianwiki.com/Lovesick_Ellie)\n- [Indiana Jones and the Dial of Destiny](https://www.imdb.com/title/tt28194558/): The legendary hero, Indiana Jones, returns in the fifth installment of this beloved swashbuckling series of films. Finding himself in a new era, approaching retirement, Indy wrestles with fitting into a world that seems to have outgrown him. But as the tentacles of an all-too-familiar evil return in the form of an old rival, Indy must don his hat and pick up his whip once more to make sure an ancient and powerful artifact doesn't fall into the wrong hands.\n\n## Bangkok stopover\n\nWe arrived in Suvarnabhumi Airport, Bangkok, in the afternoon and cleared customs. Since we had around three hours before the next flight to Chieng Mai, we wandered around the transit area and decided to have an early dinner at [Thai Street Food by KIN](https://bester-eats.com/en/restaurant/111499/) - อำเภอบางพลี (สมุทรปราการ). I had the tom yum noodle for 231 baht (around A$11) - it was delicious and surprisingly quite filling. The others had Thai chicken rice and BBQ Portk and wantan dry noodles.\n\n![Group](../gallery/day-01-flight/11_Group.webp)\n\n![Thai Street Food](../gallery/day-01-flight/15_Thai_Street_Food.webp)\n\n![Tom yum noodle](../gallery/day-01-flight/12_Tom_yum_noodle.webp)\n\n![Thai chicken rice](../gallery/day-01-flight/13_Chicken_rice.webp)\n\n![BBQ pork wantan noodle](../gallery/day-01-flight/14_BBQ_pork_wantan_noodle.webp)\n\n## Flight to Chieng Mai\n\nWe boarded TG 120 which departed just after 7pm and arrived about one hour later to Chieng Mai. We had no problems disembarking and claiming our baggage. The airport had quite a few lanterns and sculptures celebrating the upcoming festival.\n\n![Chieng Mai airport](../gallery/day-01-flight/21_Chiangmai_airport.webp)\n\n![Chieng Mai airport](../gallery/day-01-flight/22_Chiangmai_airport.webp)\n\nWe arrived at the AirBNB accommodation. I must admit, I was really tired (it is well over midnight Sydney time) and I quickly unpacked, showered and crashed out so no pictures.","trip":"Thailand 2024 Part 1","place":"South East Asia","timezone":"Asia/Bangkok","location":"Chiang Mai","title":"Day 1: Flight to Chiang Mai","description":"We had a pleasant checkin experience, had breakfast at the AMEX lounge, before boarding a flight to Bangkok. We stopped for 3 hours in Bangkok which was enough time, before boarding a flight to Chieng Mai. We arrived safely and checked into an AirBNB house for our stay here.","date":"2024-11-12T00:21:00.000Z","image":{"src":"/thailand-2024-1/_astro/07_Plane.JMJWpWUa.webp","width":2560,"height":1707,"format":"webp"},"map":[18.803261,98.970924,17],"tags":["Sydney Airport","AMEX Lounge","breakfast","Bangkok","dinner","Chieng Mai"]},{"id":"day-02-3-central-festival","slug":"day-02-3-central-festival","base":"/thailand-2024-1/","collection":"post","body":"We used the same songthaew driver to take us from Charoen Prathet Rd to [Central Festival Chiang Mai\nเซ็นทรัลเชียงใหม่](https://www.central.co.th/en/store/central-festival-chiangmai). Actually, he was willing to wait for us for 100 baht so it was a bonus. He was amused once again that we werent aware when we arrived at the destination, and gave us the shrug again. He then gave another gesture after we aligted to let us know we were walking in the wrong direction!\n\nCentral Festival Chiangmai is the largest, most comprehensive, and most modern shopping complex in Northern Thailand, covering an area of 70 rai. It is located on the Superhighway and Chiangmai-Doi Saket Road.\n\n![Central Festival](../gallery/day-02-central-festival/01_Central_Festival.webp)\n\nWe are hungry by now, so we stopped by at the food hall to search for lunch.\n\n![Food Hall](../gallery/day-02-central-festival/02_Food_Hall.webp)\n\nThere's a large variety of dishes here, made fresh.\n\n![Dessert](../gallery/day-02-central-festival/03_Making_Dessert.webp)\n\n![Dessert](../gallery/day-02-central-festival/05_Making_Dessert.webp)\n\n![Snacks](../gallery/day-02-central-festival/06_Thai_Snacks.webp)\n\n![Dessert](../gallery/day-02-central-festival/07_Thai_Desserts.webp)\n\nWe had a selection of dishes for lunch. My favourite was the stir fired squid eggs.\n\n![Crab Cakes](../gallery/day-02-central-festival/08_Crab_Cakes.webp)\n\n![Thai Popiah](../gallery/day-02-central-festival/09_Thai_Popiah.webp)\n\n![Fried Dumplings](../gallery/day-02-central-festival/10_Fried_Dumplings.webp)\n\n![Squid Eggs](../gallery/day-02-central-festival/11_Squid_Eggs.webp)\n\n![Sour Mango](../gallery/day-02-central-festival/12_Sour_Mango.webp)\n\nAfter lunch we went shopping. There are some interesting sculptures located within the mall:\n\n![Flower Sculpture](../gallery/day-02-central-festival/13_Flower_Sculpture.webp)\n\n![Circle Sculpture](../gallery/day-02-central-festival/17_Circle_Sculpture.webp)\n\n![Cone Sculpture](../gallery/day-02-central-festival/18_Cone_Sculpture.webp)\n\nI posed an Under Armour store as one of the classes I teach at university is doing a case study assessment on it.\n\n![Under Armour](../gallery/day-02-central-festival/14_Under_Armour.webp)\n\nThere's a Hello Kitty section in the Central department store!\n\n![Hello Kitty](../gallery/day-02-central-festival/16_Hello_Kitty.webp)\n\nI bought thie very pretty dress by Lolita in Central. I can't belie ve it costs 590 baht (around A$25).\n\n![Dress](../gallery/day-02-central-festival/15_Dress.webp)\n\nAfter Central Festival, we headed to Warorot Market via songthaew to find some traditional Thai costumes to wear for the Loy Krathong Festival. Warorot Market (Thai: ตลาดวโรรส), locally known as Kad Luang (กาดหลวง; lit: \"Big Market\") is a market and one of tourist attractions in Chiang Mai Province, regarded as the largest and most well-known market in the north region of Thailand.\n\n![Warorot Market](../gallery/day-02-central-festival/19_Warorot_Market.webp)\n\nHere, everyone managed to find something to buy, and we also had some delicious soda drinks. By 4pm hwoever, we were pretty exhausted and caught our final songthaew for the day to head back to the AirBNB house. The route back seemed to take forever and I can only assume it was peak hour on the main roads. The cost was still the same though (30 baht per person).","trip":"Thailand 2024 Part 1","place":"South East Asia","timezone":"Asia/Bangkok","location":"Central Festival","title":"Day 2: Central Festival and Warorot Market","description":"We had lunch and did some shopping at Central Festival, and then headed to Warorot Market to buy some traditional Thai costumes for the Loy Krathong Festival.","date":"2024-11-13T09:00:00.000Z","image":{"src":"/thailand-2024-1/_astro/01_Central_Festival.Ns8zuaWQ.webp","width":2560,"height":1707,"format":"webp"},"map":[18.807405,99.018214,17],"tags":["Chiang Mai","Central Festival","Warorot Market","Under Armour","Hello Kitty","lunch","food"]},{"id":"day-02-2-charoen-prathet-rd","slug":"day-02-2-charoen-prathet-rd","base":"/thailand-2024-1/","collection":"post","body":"When we returned from our walk, we waited until the other ladies woke up, and then we had breakfast, dressed and went out to visit [S.K. Sakol Money Exchange](https://www.chiangmailocator.com/chiang-mai-banks-currency-exchange-offices-1664:sk-sakol-money-exchange), a foreign currency exchange office located on Charoen Prathet Rd.\n\nWe were planning to hire a Grab car to take us there, but we found a Songthaew driver right outside Furama Hotel. He was much cheaper. A songthaew (สองแถว, lit. 'two rows') is a passenger vehicle in Thailand adapted from a pick-up or a larger truck and used as a share taxi or bus. Songthaew rides in Chiang Mai are priced at 30 baht per person per ride (around A$1.50).\n\n![Songtghaew](../gallery/day-02-charoen-prathet-rd/04_Songthaew.webp)\n\n![Songthaew](../gallery/day-02-charoen-prathet-rd/01_Songthaew.webp)\n\n![Songthaew](../gallery/day-02-charoen-prathet-rd/02_Songthaew.webp)\n\nWe were not aware that we arrived at our destination when the driver stopped (we thought he was just waiting at the traffic lights). The driver got off the car, went to the back, and gave us a \"Why aren't you getting off?\" shrug.\n\nLyn had already exchanged my money into Thai baht before I left Australia, so I did not need to visit the money exchange office, so I took the opportunity to wander along the street.\n\nCharoen Prathet Road (ถนนเจริญประเทศ) in Chiang Mai is a well-known street that runs along the eastern side of the Ping River, just outside the Old City walls. This road is a vibrant area that blends Chiang Mai's rich history with modern-day attractions. Many old colonial-style buildings and traditional teakwood houses can still be found along the road, reflecting its historical charm. I found a combination of massage parlours, hotels and old teak mansions.\n\n![Teak House](../gallery/day-02-charoen-prathet-rd/05_Teak_House.webp)\n\n![Crystal Club](../gallery/day-02-charoen-prathet-rd/06_Crystal_Club.webp)\n\n![Old Teak Mansion](../gallery/day-02-charoen-prathet-rd/07_Old_Teak_Mansion.webp)\n\n![Scooters](../gallery/day-02-charoen-prathet-rd/09_Scooters.webp)\n\nWhen the ladies have concluded their money changing transactions, we were ready to head to [Central Festival](https://www.central.co.th/en/store/central-festival-chiangmai) for food and shopping!\n\n![MOney changing](../gallery/day-02-charoen-prathet-rd/10_Money_changing.webp)","trip":"Thailand 2024 Part 1","place":"South East Asia","timezone":"Asia/Bangkok","location":"Charoen Prathet Rd","title":"Day 2: Charoen Prathet Rd","description":"We went to a foreign money exchange office in Charoen Prathet Rd, a historic street full of teak mansions beside the Ping River.","date":"2024-11-13T04:00:00.000Z","image":{"src":"/thailand-2024-1/_astro/03_Tuk_Tuk.CWgyYneA.webp","width":2560,"height":2560,"format":"webp"},"map":[18.784107,99.00313,17],"tags":["Chiang Mai","Charoen Prathet Rd","SK Sakol","teak mansions","songthaew"]},{"id":"day-02-4-chefs-together","slug":"day-02-4-chefs-together","base":"/thailand-2024-1/","collection":"post","body":"One of Cat's high school friend has retired in Chiang Mai and decided to take us our for dinner. He and his wife and her friends met us at the AirBNB house and offered us a platter of Thai desserts:\n\n![Pre dinner](../gallery/day-02-dinner/02_Pre_dinner.webp)\n\n![dessert platter](../gallery/day-02-dinner/01_Dessert_platter.webp)\n\nWe went to [Chef's Together by Aod & Dan](https://www.facebook.com/chefstogehter/) via two cars. It is located at Charoen Prathet Rd beside the Ping River (actually I saw it this morning whilst walking along this road).\n\n![Chefs Together](../gallery/day-02-dinner/27_Chefs_Together.webp)\n\n![Dinner](../gallery/day-02-dinner/13_Dinner.webp)\n\nIt is a trendy place with an international menu but we ordered some northern Thai dishes which were amazing. Unfortunately I have forgotten the names of the dishes, but I loved the coconutless curry and the deep fried prawn heads.\n\n![Yum](../gallery/day-02-dinner/06_Yum.webp)\n\n![Curry](../gallery/day-02-dinner/07_Curry.webp)\n\n![Platter](../gallery/day-02-dinner/08_Platter.webp)\n\n![Larb](../gallery/day-02-dinner/09_Larb.webp)\n\n![Sticky rice](../gallery/day-02-dinner/10_Sticky_Rice.webp)\n\n![Pork](../gallery/day-02-dinner/11_Pork.webp)\n\n![Khao Soi](../gallery/day-02-dinner/12_Khao_Soi.webp)\n\n![Prawn heads](../gallery/day-02-dinner/14_Prawn_heads.webp)\n\nBecause it is the Loy Krathong festival, there were fireworks by the river, and also several musical performances, by bands playing a selection of songs including old favourites.\n\n![Fireworks](../gallery/day-02-dinner/03_Fireworks.webp)\n\n![Band](../gallery/day-02-dinner/04_Band.webp)\n\n![Band](../gallery/day-02-dinner/26_Band.webp)\n\nAfter dinner, we walked along the Ping riverbank, and crossed the Iron Bridge. We saw some festivalgoers lighting water lanterns and launching them by the riverside.\n\n![By the Bridfge](../gallery/day-02-dinner/15_By_the_Bridge.webp)\n\n![Chefs Together](../gallery/day-02-dinner/16_Chefs_Together.webp)\n\n![Chefs Together](../gallery/day-02-dinner/20_Chefs_Together.webp)\n\n![Bridge](../gallery/day-02-dinner/17_Bridge.webp)\n\n![Launching Lanterns](../gallery/day-02-dinner/22_Launching_Lanterns.webp)\n\n![Launching Lanterns](../gallery/day-02-dinner/21_Launching_Lanterns.webp)\n\n![Ping River](../gallery/day-02-dinner/23_Ping_River.webp)\n\n![Ping River](../gallery/day-02-dinner/25_Ping_River.webp)\n\nOn the way back, we drove past Tha Pae St which were lit up using many light arches for the festival.\n\n![Tha Pae St lights](../gallery/day-02-dinner/28_Tha_Pae_St_lights.webp)","trip":"Thailand 2024 Part 1","place":"South East Asia","timezone":"Asia/Bangkok","location":"Chefs Together","title":"Day 2: Dinner at Chefs Together","description":"Fabulous dinner at a trendy restaurant by the Ping River called Chefs Together.","date":"2024-11-13T14:00:00.000Z","image":{"src":"/thailand-2024-1/_astro/18_Chefs_Together.D8xiamz2.webp","width":2560,"height":1707,"format":"webp"},"map":[18.783903832802014,99.00349669554622,17],"tags":["Chiang Mai","Central Festival","Warorot Market"]},{"id":"day-03-1-jok-somphet","slug":"day-03-1-jok-somphet","base":"/thailand-2024-1/","collection":"post","body":"Today is the first day of our private tour of Chiang Mai and Chiang Rai, organised by [Chiang Mai Private Tour Guide and Driver](https://www.facebook.com/chiangmaiprivatetourguide). Our tour guide is called Wanchai Yoonuch but he asked us to call him \"Patter\". He picked us up around 8AM in the morning, and the first thing we asked him was to take us to breakfast.\n\nWe all wanted to eat congee, so he took us to a restaurant called [Jok Somphet Restaurant โจ๊กสมเพชร](https://www.facebook.com/joksomphet/).\n\nI had the seafood congee here, it was delicious, and we shared a few plates of dim sims. Nearby was a shop selling fried doughsticks (called Youtiao or yau char kway) and they had a Big Youtiao in front.","trip":"Thailand 2024 Part 1","place":"South East Asia","timezone":"Asia/Bangkok","location":"Jok Somphet","title":"Day 3: Breakfast at Jok Somphet","description":"Congee breakfast on the way to Chiang Rai.","date":"2024-11-14T01:00:00.000Z","image":{"src":"/thailand-2024-1/_astro/17_Jok_Somphet.CQoJ9xXm.webp","width":2560,"height":1707,"format":"webp"},"map":[18.79537032760234,98.98985263972472,17],"tags":["Chiang Mai","breakfast","Jok Somphet","private tour"]},{"id":"day-03-2-thaweesin","slug":"day-03-2-thaweesin","base":"/thailand-2024-1/","collection":"post","body":"Our first stop on the private tour is [Thaweesin Hot Spring น้ำพุร้อนแม่ขะจาน(ตลาดทวีสิน)](https://www.thailandtourismdirectory.go.th/en/attraction/81747), supposedly the highest and most beautiful hot springs in the north of Thailand. Visitors can soak their feet in the bank of the spring for free, and buy various eggs to cook in the shallow pools.\n\nHowever, we were much more interested in shopping than soaking our feet in smelly sulphuric water or boiling eggs. We were attracted by the shops selling various Northern Thai costumes. All of us ended up buying various items here. I bought a traditional dress, a Thai belt and a skort but some of the other ladies bought even more items.\n\nThe vendor told us his prices were cheaper than in Chiang Rai, and this is partially true. Prices at the various tourist locations in town were a little bit more expensive, but they were higher quality.\n\nI did end up doing a quick tour around the place and it was quaint but has obviously seen better times. It's basically just a garden around the hot springs surrounded by shops, with some unfinished constructions at the back. Patter, our tour guide, took pity on us and took a few pictures of us standing next to the hot geyser.\n\nI think we ended up spending over an hour here at what was supposed to be a quick 30 minute comfort stop. After that Patter realised his carefully constructed dense itinerary is in serious jeopardy, so he did some quick improvisation and suggested our next stop should be lunch along the way rather than heading straight to White Temple. We heartily agreed, because breakfast now seemed a long time ago.","trip":"Thailand 2024 Part 1","place":"South East Asia","timezone":"Asia/Bangkok","location":"Thaweesin Hot Springs","title":"Day 3: Thaweesin Hot Springs","description":"First stop on our private tour on the way to Chiang Rai.","date":"2024-11-14T03:00:00.000Z","image":{"src":"/thailand-2024-1/_astro/08_Group.Be76Uww1.webp","width":2560,"height":1707,"format":"webp"},"map":[19.11563467420474,99.46395585637777,17],"tags":["Thaweesin","hot springs","shopping"]},{"id":"day-03-3-wat-replica","slug":"day-03-3-wat-replica","base":"/thailand-2024-1/","collection":"post","body":"I found this abandoned \"temple\" next to the hot springs, and for a moment I thought I was Indiana Jones and I had discovered an ancient ruin. I spent a happy time here exploring the place and imagining I was going to find the Ark, Cup, Skull and Dial tucked away in a corner. Afterwards I discovered it was a fake.\n\nThe origins of this seemingly ancient temple ruin are unclear but [some people](https://motogirlthailand.com/abandoned-buildings/) say it was meant to be a luxury spa but the construction was abandoned (presumably due to lack of funding).\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/XQb76XLptEk?si=uZykQPKbGXDDGYBz\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n\nI found it fascinating, haunting and perhaps a bit sad. It looks beautiful and obvious someone has spared no expense in making it beautiful, including reliefs of women in various poses, intricate Khmer style architecture and symmetrical design with palm trees and water features.\n\nI managed to get inside one of the buildings, and the fakeness becomes apparent, with a modern roof design based on stell trusses and fibreglass and what looks like modern cement slabs used in the construction. The reliefs of the women also look a bit too sexy for this to be a true temple.\n\nStill, it would be a great location for a fashion photo shoot, or perhaps adventure game.\n\nI also found it a bit sad that someone has poured so much money into building this site, and some parts seem almost finished that I would have liked to see an operational version of this site.","trip":"Thailand 2024 Part 1","place":"South East Asia","timezone":"Asia/Bangkok","location":"Wat Replica","title":"Day 3: Wat Replica","description":"Abandoned \"temple\" next to Thaweesin hot springs.","date":"2024-11-14T04:00:00.000Z","image":{"src":"/thailand-2024-1/_astro/16_Wat_Replica.dJCxxZX6.webp","width":2560,"height":1707,"format":"webp"},"map":[19.11590011504812,99.46444166987092,17],"tags":["breakfast","fake","Angkor Wat","temple","abandoned"]},{"id":"day-03-5-white-temple","slug":"day-03-5-white-temple","base":"/thailand-2024-1/","collection":"post","body":"The White Temple, or more formally [Wat Rong Khun วัดร่องขุ่น](https://www.tourismthailand.org/Attraction/wat-rong-khun) is a popular tourist attraction in Chiang Rai created by Chalermchai Kositpipat, a local artist who designed and constructed using his own money, and opened it to visitors in 1997.\n\nAlthough I have seen pictures, they did not prepare me for the real experience. It is so dazzling and bright a lot of the photos came out with dark faces, so these photos all had to be \"enhanced\" to bring out the humans, which seem puny compared to the majesty of the buildings. Even the toilets are golden towers! Even though the photos don't show it - there were a lot of visitors, it was very crowded. Luckily we found a quiet side of the temple where there were not too many people. Margaret and I went on an extended tour of the temple whilst the other ladies went shopping.\n\nWe spent so long here, by the time we left, it was already late afternoon. Patter, our tour guide, decided we will have to skip visiting the Singha Park and head straight to the Blue Temple to catch it in sunset, the best time of the day to visit it. We didn't mind, as it turned out none of us were really that keen to spend a hot day in the park.","trip":"Thailand 2024 Part 1","place":"South East Asia","timezone":"Asia/Bangkok","location":"White Temple","title":"Day 3: White Temple Chiang Rai","description":"The fammous and popular dazzlingly white reflective temple in Chiang Rai.","date":"2024-11-14T08:00:00.000Z","image":{"src":"/thailand-2024-1/_astro/014_White_Temple.DQa889U5.webp","width":2560,"height":1707,"format":"webp"},"map":[19.824457860363186,99.76370627728751,17],"tags":["Chiang Rai","White Temple","temple","Wat Rong Khun"]},{"id":"day-03-4-doi-chaang","slug":"day-03-4-doi-chaang","base":"/thailand-2024-1/","collection":"post","body":"Doi Chaang is a venture partnering with the Akha hill tribe farmers of Northern Thailand in the Doi Chang village producing single origin specialty coffee beans and they have a cafe located next to their premises on the way to Chiang Rai called [DOI CHAANG Caffè - สาขาเชียงราย](https://doichaangcoffee.co.th/en/).\n\nUpon entering, we were greeted with a garden featuring a fountain and the building itself is reminiscent of tribal houses.\n\nThe menu here is international, but we ordered mainly Thai dishes. Mine was a seafood krapao. The coffee here was without surprise delicious.","trip":"Thailand 2024 Part 1","place":"South East Asia","timezone":"Asia/Bangkok","location":"DOI CHAANG Caffè","title":"Day 3: Lunch at DOI CHAANG Caffè","description":"Lunch at a cafe owned by Doi Chaang, a well known Thai mountain coffee producer.","date":"2024-11-14T05:00:00.000Z","image":{"src":"/thailand-2024-1/_astro/14_Doi_Chaang.CJakAFzy.webp","width":2560,"height":1707,"format":"webp"},"map":[19.614553669477477,99.67320390443223,14],"tags":["Chiang Rai","lunch","Doi Chaang"]},{"id":"day-03-6-blue-temple","slug":"day-03-6-blue-temple","base":"/thailand-2024-1/","collection":"post","body":"We spent so much time at the White Temple, by the time we arrived at the Blue Temple, it was very late in the afternoon. Fortunately this turned out to be the best time to see the temple, as the tourist buses have mostly dispersed, and we managed to experience the sight of the temple during sunset. The temple really looks beautiful at night and it was truly magical.\n\nThe Blue Temple, or more formally [Wat Rong Suea Ten](https://www.tourismthailand.org/Attraction/wat-rong-suea-ten) (Thai: วัดร่องเสือเต้น), is a temple in Chiang Rai, Thailand, known for its striking modern artistic design. The temple's construction was initiated by the local community in 1996 to replace an old abandoned temple which previously stood on the site, though construction did not start until 2005. Its final design was realised by local artist Phuttha Kabkaew (พุทธา กาบแก้ว) or Sala Nok (สล่านก, sala being a northern Thai title for an artisan), who learned from Chalermchai Kositpipat while working on his famous Wat Rong Khun (White Temple). It is designed in an unconventional \"neo-traditional\" style of Buddhist art employing lavishly ornamented sculptures and psychedelic visual imagery.\n\nIt is very Instagrammable, and even though we arrived rather late, there were still plenty of tourists taking photos inside and outside the temple. We stepped out just before sunset and was able to obserbe the temple transform from it's daytime look to a truly magnificent iolluminated structure framed by the dying light of the sun.","trip":"Thailand 2024 Part 1","place":"South East Asia","timezone":"Asia/Bangkok","location":"Blue Temple","title":"Day 3: Blue Temple Chiang Rai","description":"Another popular and Instagrammable modern temple at the best time of day - during sunset.","date":"2024-11-14T11:00:00.000Z","image":{"src":"/thailand-2024-1/_astro/27_Blue_Temple.ClVi3HZP.webp","width":2560,"height":1707,"format":"webp"},"map":[19.923637262197804,99.84242066619379,17],"tags":["Chiang Rai","Blue Temple","temple","Wat Rong Suea Ten"]},{"id":"day-03-7-guan-yin","slug":"day-03-7-guan-yin","base":"/thailand-2024-1/","collection":"post","body":"We arrived at [Wat Huay Pla Kang วัดห้วยปลากั้ง](https://www.tourismthailand.org/Attraction/wat-huai-pla-kang) at night, which is famous for the gigantic statue of Guanyin (69m tall), also known as the \"Goddess of Mercy\". Apparently this was built around 2011 on a site formerly occupied by a deserted temple.\n\nInterestingly, Guanyin is sometimes depicted as a man and sometimes as a woman, and often with androgynous features. The Japanese regard Guanyin as a man and call him Kannon (fun fact: Canon camera was named after Kannon). At least one sutra ascribe Guanyin as the creator of the world, and perhaps therefore genderless. My theory is that in order to be truly merciful, one has to embrace both male and female qualities. Anyway, he/she looked beautiful at night, and the adjoining white stucco ubosot was full of reliefs of various Buddhist scenes.\n\nI didn't go into the nine-level \"Pobchoke Dhammachedi\" chedi (pagoda), but it was beautifully lit up.","trip":"Thailand 2024 Part 1","place":"South East Asia","timezone":"Asia/Bangkok","location":"Guan Yin Statue","title":"Day 3: Guan Yin Statue","description":"Fabulous dinner at a trendy restaurant by the Ping River called Chefs Together.","date":"2024-11-14T13:00:00.000Z","image":{"src":"/thailand-2024-1/_astro/11_Guan_Yin.DRtGMFRq.webp","width":2560,"height":1707,"format":"webp"},"map":[19.94862934302784,99.80619733735875,17],"tags":["Chiang Rai","Wat Huay Pla Kang","Guan Yin","night","temple"]},{"id":"day-03-8-lu-lam","slug":"day-03-8-lu-lam","base":"/thailand-2024-1/","collection":"post","body":"[Lulum Restaurant Chiang Rai ร้านอาหาร​ หลู้ลำ เชียงราย](https://www.facebook.com/RanXaharHluLaCheiyngray/) is a well known riverside restaurant serving Northern Thai food located next to the Kok River in Chiang Rai. We arrived there around 8PM, and the staff told us the kitchen was closing in around 30 mins so we had to order quickly.\n\nI found the food here was okay, but maybe a bit too pungent and \"one note\" for my liking, but the riverside view was fantastic and the restaurant glittered at night.","trip":"Thailand 2024 Part 1","place":"South East Asia","timezone":"Asia/Bangkok","location":"Lu Lam","title":"Day 3: Dinner at Lu Lam","description":"Dinner at a popular riverside restaurant in Chiang Rai near to Kok River.","date":"2024-11-14T14:00:00.000Z","image":{"src":"/thailand-2024-1/_astro/01_Stair.BeP3gh8Z.webp","width":2560,"height":1707,"format":"webp"},"map":[19.92225061150142,99.85145184475569,17],"tags":["Chiang Rai","dinner","Kok river","Lu Lam","night"]},{"id":"day-04-1-breakfast-nathaka","slug":"day-04-1-breakfast-nathaka","base":"/thailand-2024-1/","collection":"post","body":"We woke up early, and checked out of the hotel and back on board the van. Patter, our driver, took us to a place called Nanthaka Rice Porridge (โจ๊กหม้อดินเชียงราย - นันทกา) - [Facebook page](https://www.facebook.com/JokeMorDin) สี่แยกขัวดำ เยื้องโรงเรียนสามัคคีฯ, Chiang Rai.\n\nI had the \"Emperor\" porridge here, which contains a bit of everything, so it was a good feed. THe porridge was certainly very tasty!\n\nThe restaurant is across the road from [Wat Ming Muang วัดมิ่งเมือง](https://www.templeseeker.com/wat-ming-muang-elephant-temple-chiang-rai/) temple, which looks almost like a Hindu temple. Unfortunately, we did not have time to visit this temple, so I just took some photos from across the road.","trip":"Thailand 2024 Part 1","place":"South East Asia","timezone":"Asia/Bangkok","location":"Nanthaka Rice Porridge","title":"Day 4: Breakfast at Nanthaka Rice Porridge","description":"We had rice porridge for breakfast in Chiang Rai located opposite the Wat Ming Mueang","date":"2024-11-15T01:00:00.000Z","image":{"src":"/thailand-2024-1/_astro/07_Nanthaka_Rice_Porridge.DXZXxpzr.webp","width":2560,"height":1707,"format":"webp"},"map":[19.90699116100635,99.82872790805857,17],"tags":["Chiang Rai","breakfast","porridge","Wat Ming Muang","Nanthaka","food"]},{"id":"day-04-2-lalitta-cafe","slug":"day-04-2-lalitta-cafe","base":"/thailand-2024-1/","collection":"post","body":"After breakfast we headed to [Lalitta Cafe](https://www.lalittacafe.com) - [Facebook Page](https://www.facebook.com/LalittaTH). We were originally supposed to have breakfast here, but unfortunately our driver discovered they don't open until 10am.\n\nThis cafe feels like it is straight out of a fairy tale, or at least a theme park set in a fairy tale. It features lush greenery, lots of mist and streams, and a \"mountain\" cliff face complete with status of fairies and waterfalls.\n\nThis is a map of the cafe (from the website):\n\n![Map](https://www.lalittacafe.com/wp-content/uploads/2022/11/รวมแผนที่-ล่าสุด-scaled.jpg)\n\nWe spent a happy time wandering around the forest paths - the clever design of intricate curvy paths covered with mist made the place a lot bigger than it actually was. Margaret and I had coffee and cake here whilst the other ladies had foot massages.","trip":"Thailand 2024 Part 1","place":"South East Asia","timezone":"Asia/Bangkok","location":"Lalitta Cafe","title":"Day 4: Lalitta Cafe","description":"Lalitta Cafe is a trendy, Instagrammable fairy-tale cafe set amongst lush greenery and cascading waterfalls.","date":"2024-11-15T04:00:00.000Z","image":{"src":"/thailand-2024-1/_astro/56_Lalitta_Cafe.v0Cu5CNg.webp","width":2560,"height":1707,"format":"webp"},"map":[19.942545757923387,99.81197090065237,17],"tags":["Chiang Rai","Lalitta Cafe","attraction","food","massage"]},{"id":"day-04-3-karen-village","slug":"day-04-3-karen-village","base":"/thailand-2024-1/","collection":"post","body":"After Lalitta cafe, our driver drove us to one of the villages belonging to the long-necked [Karen tribe](http://www.longneckkaren.com) (หมู่บ้านชาวเขากะเหรี่ยงคอยาว).\n\nThere are actually 5 different tribes living in a cluster of villages - altogether there are more than 200 villagers living among the mountains; Akha, Lu Mien, Lahu, Kayaw, and Longneck Karen.\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/9h5VUIjnCBY?si=O5F0i9c8Pcp-VYwy\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n\nOf course we mostly came to see the long-necked Karen tribe, who have had a long and complicated history and relationship with Thailand. They call themselves Padaung, and some say they originally came from Yunnan Province, central China but then migrated to Salween River Basin in Myanmar. In 1995, there were approximately 25,000 Padaungs living in Myanmar. They mainly live on traditional agricultural activities. After political incident against the minorities in Myanmar, Padaungs have evacuated from Myanmar and some of them have reached Thailand. They have no legal status in Thailand and cannot earn a living so they survive by selling their handicrafts to tourists like us.\n\nWe felt obliged to buy some goods from them, and they seemed pleased to sell to us, so I guess it is a fair exchange. I can't help but feel sorry for these people, and that their culture is dying and their way of life is being turned into a tourist attraction. I learnt that the Thai govenment have actually moved all the hill tribes into this place in order to preserve their cultures and traditions for cultural tourism purpose and ultimately to support development of Chiang Rai Province’s tourism industry.","trip":"Thailand 2024 Part 1","place":"South East Asia","timezone":"Asia/Bangkok","location":"Karen Village","title":"Day 4: Karen Village","description":"We visited one of the villages of the Karen tribe, where women wear stacked brass rings on their necks & sell handmade crafts.","date":"2024-11-15T05:00:00.000Z","image":{"src":"/thailand-2024-1/_astro/30_Chris.Bb1eZkmY.webp","width":2560,"height":1707,"format":"webp"},"map":[20.019900597669366,99.89030344981991,17],"tags":["Chiang Rai","Karen village"]},{"id":"day-04-4-loy-krathong","slug":"day-04-4-loy-krathong","base":"/thailand-2024-1/","collection":"post","body":"We arrived in Chiang Mai in the afternoon, which gave us some time to rest before heading out again to experience the Loy Krathong (ลอยกระทง) Festival in Chiang Mai.\n\nThe giant street parade takes place in the evening and features a vibrant procession of illuminated floats, performers, musicians, and dancers moving through the streets of Chiang Mai. We watched the parade around Pratu Tha Phae Park, Tambon Si Phum, Amphoe Mueang near the Tha Phae Gate.\n\nWe saw traditional performances, cultural displays, and various forms of artistic expression in the parade. Afterwards, we sampled some street food. I was surprised the street vendors hurriedly packed up and left after we ordered, and then I realised the street was being reopened after the parade had passed and they were all blocking the road.\n\nBecause the street was so crowded, we had our driver order two tuk tuks to carry us home, but we had to wait a while for them to arrive because of traffic. However, we managed to enjoy some fireworks whilst waiting for the tuk tuks.","trip":"Thailand 2024 Part 1","place":"South East Asia","timezone":"Asia/Bangkok","location":"Loy Krathong Festival","title":"Day 4: Loy Krathong Street Parade","description":"We went out at night to experience the street parade for the Loy Krathong festival in Chiang Mai.","date":"2024-11-15T15:00:00.000Z","image":{"src":"/thailand-2024-1/_astro/05_Street_food.xhGXkWEd.webp","width":2560,"height":1707,"format":"webp"},"map":[18.787703264468593,98.99345950299137,17],"tags":["Loy Krathong","festival","night","Pratu Tha Pae Park"]},{"id":"day-05-1-thai-silk-village","slug":"day-05-1-thai-silk-village","base":"/thailand-2024-1/","collection":"post","body":"In the morning, we visited the Thai Silk Village (บริษัท ไทยซิลค์วิลเลจ จำกัด), 120/27 หมู่3 ถนนเชียงใหม่-สันกำแพง สันกลาง อำเภอสันกำแพง เชียงใหม่ 50130 ([Facebook Page](https://www.facebook.com/thaisilkvillage)) where there is a demonstration of how silkworms are grown, harvested, and boiled to make exquisite silk which is woven into delicate and colourful fabrics.\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/Ca7HyWtiUeM?si=p4DdDRvdx6JfaVvd\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n\nWe stopped by at the entrance to take some photos before venturing inside. I was quite interested in the silkworm exhibit and factory as I have never seen silk being made before. The adjoining shop contained many lovely fabrics and ready made clothes. However, I did not buy anything, even though the prices in the clearance section were actually quite reasonable.","trip":"Thailand 2024 Part 1","place":"South East Asia","timezone":"Asia/Bangkok","location":"Thai Silk Village","title":"Day 5: Thai Silk Village","description":"Thai Silk village is a silk factory located at San Kamphaeng District where is a road of culture, art and traditional way of life.","date":"2024-11-16T03:00:00.000Z","image":{"src":"/thailand-2024-1/_astro/23_Silk.kPGdZy1w.webp","width":2560,"height":1707,"format":"webp"},"map":[18.77551322867484,99.05969701587516,17],"tags":["Chiang Mai","Thai Silk Village","silk","shopping"]},{"id":"day-04-4-lunch-chan-chai","slug":"day-04-4-lunch-chan-chai","base":"/thailand-2024-1/","collection":"post","body":"After vising the long necked Karen village, we were hungry but our driver was keen to make a start heading back to Chiang Mai.\n\nWe ended up stopping for a late lunch at a delightful small restaurant called Chan Chai (ร้านอาหารจันทร์ฉาย อ.เวียงป่าเป้า เชียงราย), 383/2 หมู่ 2 ติดโรงรับจำนำทางทิศเหนือ เวียง Wiang Pa Pao District, Chiang Rai - [Facebook Page.](https://www.facebook.com/pages/ร้านอาหารจันทร์ฉาย-เวียงป่าเป้า-เชียงราย/289378341213035) The owner here is also the head waiter and the chef, so it was a small operation.\n\nWe had some very good dishes, in fact some in the group felt at the end of the trip that it was the best meal we had. We had seafood tom yum, a deep fried fish dish, omelette and stir fried morning glory. I liked the giant teddy bear on the couch as we entered the restaurant.\n\nOn the way back to Chiang Mai after lunch, we passed by a giant golden statue of a famous local Buddhist monk. I am guessing this is Kruba Srivichai, the patron saint of Lanna.","trip":"Thailand 2024 Part 1","place":"South East Asia","timezone":"Asia/Bangkok","location":"Chan Chai","title":"Day 4: Lunch at Chan Chai","description":"We headed back to Chiang Mai and on the way back stopped by to have lunch at this delightful restaurant.","date":"2024-11-15T07:00:00.000Z","image":{"src":"/thailand-2024-1/_astro/03_Chan_Chai.C67IDvwM.webp","width":2560,"height":1707,"format":"webp"},"map":[19.362970108244383,99.50461353078896,17],"tags":["Chiang Rai","Chan Chai","food","restaurant","lunch"]},{"id":"day-03-9-growhome","slug":"day-03-9-growhome","base":"/thailand-2024-1/","collection":"post","body":"Where we stayed in Chiang Rai - it's called [Grow Home-Stay and Space โรงแรมโกรวโฮม](https://www.facebook.com/growhomestayandspace/) and it's a trendy creative boutique hotel with communal living space and a studio and performance area so you can indulge in your creative expression should you have the urge.\n\nDownstairs appeared to be some sort of child care centre, the mid level has the kitchen and small library, the upper floor are where the rooms and, and finally the rooftop contains a studio and performance space.\n\nI shared a large king sized bed with Margaret in the two bedroom apartment, and Cat slept in the separate room with one bed.","trip":"Thailand 2024 Part 1","place":"South East Asia","timezone":"Asia/Bangkok","location":"Grow Home","title":"Day 3: Grow Home","description":"We stayed overnight at this trendy accommodation in Chiang Rai.","date":"2024-11-14T15:00:00.000Z","image":{"src":"/thailand-2024-1/_astro/13_Performance_space.D1UVsoxE.webp","width":2560,"height":1707,"format":"webp"},"map":[19.900977544302958,99.83562656804256,17],"tags":["Chiang Rai","accommodation","Grow Home"]},{"id":"day-05-2-lunch-kao-ba-fuaeng","slug":"day-05-2-lunch-kao-ba-fuaeng","base":"/thailand-2024-1/","collection":"post","body":"After visiting the Thai Silk Village, we headed to the picturesque traditional village of Mae Kampong, nestled amongst the hills at an altitude of 1300m. We stopped at Kao Ba Fuaeng (เก๊าบ่าเฟือง แม่กำปอง) - [Facebook Page](https://www.facebook.com/profile.php?id=100094923366006), which had two storeys. We ate at the upper storey, and had some Thai sausages, chicken wings and thighs to share, and then had bowls of noodles. Mine is a version of kuay chap but with glass noodles. From the upper storey of the restaurant, we could see a good view of the main street below us.","trip":"Thailand 2024 Part 1","place":"South East Asia","timezone":"Asia/Bangkok","location":"Kao Ba Fuaeng","title":"Day 5: Lunch at Mae Kampong","description":"We visited the traditional village of Mae Kampong. First stop was lunch at one of the restaurants in the area.","date":"2024-11-16T05:00:00.000Z","image":{"src":"/thailand-2024-1/_astro/01_Kao_Ba_Fuaeng.BTE87yPs.webp","width":2560,"height":1707,"format":"webp"},"map":[18.865141,99.350245,17],"tags":["Mae Kampong","Kao Ba Fuaeng","food","lunch"]},{"id":"day-05-3-mae-kampong","slug":"day-05-3-mae-kampong","base":"/thailand-2024-1/","collection":"post","body":"After lunch, we walked around the Mae Kampong (แม่กำปอง) village. The village may look centuries old, but it is in fact only about 100 years ago that a few people settled here in order to grow tea and coffee. The village survives mainly on eco-tourism, and has many cafes, homestays. Today there are about 500 people living in over 120 houses in this village.\n\nWe walked up the main street of the village into a side street where I can see some residential houses next to the stream. After that, we continued to walk upwards, and discovered a gem of a hidden temple, called Wat Khantha Pruksa (พิพิธภัณฑ์คน-ป่า-เหมี้ยง), also known as Wat Mae Kampong. It is a 100-year-old temple with Lanna-style architecture, featuring intricate carvings and wooden structures. Its most unique feature is a small chapel that seems to float on a pond. Nestled in lush greenery, the temple offers a tranquil setting where we can hear the soothing sounds of the nearby stream and the gentle sway of the trees. Nearby is the Namtok Mae Kampong waterfall, but we did not get a chance to see it.","trip":"Thailand 2024 Part 1","place":"South East Asia","timezone":"Asia/Bangkok","location":"Mae Kampong","title":"Day 5: Wandering around Mae Kampong","description":"After lunch we walked around the Mae Kampong village, and discovered a temple with a beautiful chapel next to a stream.","date":"2024-11-16T07:00:00.000Z","image":{"src":"/thailand-2024-1/_astro/28_Temple.1DZDFzkg.webp","width":2560,"height":1707,"format":"webp"},"map":[18.866089982310104,99.35260947042515,17],"tags":["Mae Kampong","waterfall","temple"]},{"id":"day-05-4-yi-peng","slug":"day-05-4-yi-peng","base":"/thailand-2024-1/","collection":"post","body":"After Mae Kampong, we headed to the Mae On District to attend the 2024 [Chiang Mai CAD Khom Loy Sky Lantern Festival](https://yipengchiangmailanternfestival.com). The venue is located at 9 Ban Sa Ha Khon, On Klang, Mae On District, Chiang Mai 50130. [Facebook Page](https://www.facebook.com/cmCADFestival).\n\nCelebrating the combined Yi Peng and Loy Krathong festivals in Chiang Mai. Yi Peng is celebrated by floating lanterns into the sky and Loy Krathong is celebrated by floating lanterns on a river.\n\nYi Peng refers to the full moon day in the second month according to the Lanna lunar calendar (the twelfth month of the Thai lunar calendar). The festival is meant as a time to make merit literally: ‘floating lanterns’, are launched into the air. Khomloy are made from a thin fabric, such as rice paper, stretched over a bamboo or wire frame, to which a candle or fuel cell is attached. When the fuel cell is lit, the resulting hot air is trapped inside the lantern and creates enough lift for the Khomloy to float into the sky. During festival, some people also decorate their houses, gardens, and temples with Khom Fai intricately shaped paper lanterns which take on different forms. Khom Thue are lanterns which are carried around hanging from a stick, Khom Khwaen are the hanging lanterns, which are placed at temples and which revolve due to the heat of the candle inside.\n\n“Loy Krathong” are celebrated jointly with Yi Peng in Chiang Mai. In town we can see lights floating on the waters, lights hanging from trees/buildings or standing on walls. Loy (ลอย) means “to float”, while Krathong (กระทง) has various meanings, one of which is “A small container made of leaves which float on water during the Loy Krathong festival”. Krathong is traditionally a small leaf container which is made to hold a small portion of goods like a traditional Thai dish (such as “Hor Mok”) or dessert. The traditional Krathong used for floating at the festival are made from a slice of a banana tree trunk or a spider lily plant. A bread Krathong will disintegrate after a few days. Banana stalk Krathong are also biodegradable, but they pollute the rivers and may take years to decompose.\n\nA Kratong is decorated with elaborately-folded banana leaves, incense sticks, and a candle. A small coin is sometimes included as an offering to the river spirits. On the night of the full moon, Thais launch their kratong on a river, canal or a pond, making a wish as they do so. The festival may originate from an ancient ritual paying respect to the water spirits. Thai Buddhists in Thailand to honor the Buddha, The candle venerates the Buddha with light, while the Krathong’s floating symbolizes letting go of all one’s hatred, anger, and defilements. People sometimes cut their fingernails or hair and place the clippings on the Krathong as a symbol of letting go of past transgressions and negative thoughts. Many Thais use the Krathong to thank the Goddess of Water.\n\nI found the Yi Peng festival celebratory and magical, and the Loy Krathong contemplative and reflective. Due to the risk of fire, the former is now banned in the city of Chiang Mai but still allowed on the outskirts. Traditionally, both are celebrated by families and communities. Being tourists, we bought Premium tickets (6400 baht per person) to the \"official\" Chiangmai CAD Khomloy Sky Lantern Festival which combined both festivals along with dinner and a concert/performance. I must admit, I was surprised by how expensive the tickets are - they cost all the way up to nearly A$1000 (for \"Elite\" tickets - 15,500 baht). But when I saw the level of organisation involved, particularly to manage the risk of fire and providing food and entertainment to thousands of people, I understood. It's a very touristy event - with lots of Japanese, Brazilian, Chinese and other nationalities attending. I am guessing the average Thai won't be able to afford the ticket prices. I have read some criticism of the event - that it represents a fire and environmental risk, with the lanterns blocking air traffic, harming wildlife and polluting the countryside, but I would also like to think about the economic benefits to the region, and at the end of the day it was a truly magical and uplifting moment.\n\nThis is my video of the event - it was an amazing experience and one I will remember forever. I think we lit up enough lanterns to light up a street! Shot in widescreen for that dramatic cinematic look - but there is no screen wide enough to capture the sky that night!\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/rAlcZfLIYC4?si=fJY_Ln_9x3BlTZzt\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>","trip":"Thailand 2024 Part 1","place":"South East Asia","timezone":"Asia/Bangkok","location":"Khom Loy festival","title":"Day 5: Attending the Chiang Mai CAD Khom Loy Sky Lantern Festival","description":"We attended the combined Loy Krathong/Yi Peng festival on the outskirts of Chiang Mai.","date":"2024-11-16T14:00:00.000Z","image":{"src":"/thailand-2024-1/_astro/39_Lanterns.Cv0ZaLUL.webp","width":2560,"height":1707,"format":"webp"},"map":[18.7663194,99.2421828,17],"tags":["Chiang Mai CAD","Yi Peng","Loy Krathong"]},{"id":"day-06-1-viewpoint","slug":"day-06-1-viewpoint","base":"/thailand-2024-1/","collection":"post","body":"We stopped about halfway up the Srivichai Alley, which is the road from Chiang Mai up Doi Suthep, at Chaloem Phra Kiat Pavilion Viewpoint\n(จุดชมวิวศาลาเฉลิมพระเกียรติ). There are a number of stalls here selling souvenirs and food, as well as a pavilion for viewing a panoramic view of Chiang Mai. I discovered a lot of stray dogs sleeping on the roadside. I also met two cyclists who we had observed climbing up the road from the van. They told me this is about halfway up on the way to Doi Suthep and it is a popular route for cyclists. They said the gradient of the road was not too steep, averaging about 6% but there are some steep sections just before reaching the temple.","trip":"Thailand 2024 Part 1","place":"South East Asia","timezone":"Asia/Bangkok","location":"Chaloem Phra Kiat Pavilion Viewpoint","title":"Day 6: Viewpoint on the way to Doi Suthep","description":"Today we are visiting the famous Wat Phra That Doi Suthep. On the way, we stopped at a viewpoint to admire the scenery, plus buy some food and trinkets.","date":"2024-11-17T02:00:00.000Z","image":{"src":"/thailand-2024-1/_astro/11_Chris.DkPW1x1c.webp","width":2560,"height":1707,"format":"webp"},"map":[18.791932063172425,98.93316285292939,17],"tags":["Chiang Mai","Doi Suthep","viewpoint","pavilion","dog","food","shopping","cycling"]},{"id":"day-06-2-doi-suthep","slug":"day-06-2-doi-suthep","base":"/thailand-2024-1/","collection":"post","body":"[Wat Phra That Doi Suthep](https://www.tourismthailand.org/Attraction/wat-phra-that-doi-suthep/) (วัดพระธาตุดอยสุเทพราชวรวิหาร) is probably the most famous and well known of all the temples around Chiang Mai. Legend has it the temple was founded in 1383 and contains a relic of the Buddha (his shoulder).\n\nThere are 309 steps in the stairs leading up to the temple from the car park. Although there is a cable car taking tourists all the way to the top, and our driver/guide had already purchased cable car tickets for us, I elected to climb the 309 steps.\n\nClose to the Entrance Gate at the base of the stairs are a small pavilion featuring a multi-armed Buddha (the temple has many elements of Hinduism as well as Buddhism), a bell, a large Buddha statue, a golden statue of a monk, a wheel surrounded by deers, a gong, and other artefacts. There is also another pavilion with what looks like a Hindu multi armed god. Climbing the stair, I noticed the two seven-headed serpent statues that greeted me at the base.\n\nThe temple itself consists of an outer courtyard and an inner sanctunm consisting of the chedi and many statues of the Buddha, including various golden ones, an emerald one, a silver one, a reclining one etc. There are various structures arranged in the four compass directions surrounding the inner sanctum.\n\nAs the temple is about 1000m above sea level, there is a magnificent panoramic view of Chiang Mai from the south eastern courtyard. The temple grounds are also adorned with bells. In some of the chambers surrounding the inner sanctum, I saw monks providing blessings to visitors.\n\nWe took the cable car back to street level. Here there are many shops selling food, souvenirs and clothes. I found one selling fried insects but was too squeamish to try some.","trip":"Thailand 2024 Part 1","place":"South East Asia","timezone":"Asia/Bangkok","location":"Wat Phra That Doi Suthep","title":"Day 6: Wat Phra That Doi Suthep","description":"Wat Phra That Doi Suthep is a famous temple located in the mountain of Doi Suthep and the golden chedi surrounded by golden Buddha statues is iconic in many depictions of Thailand. The temple can actually be seen from Chiang Mai airport so it's one that many people recognise.","date":"2024-11-17T04:00:00.000Z","image":{"src":"/thailand-2024-1/_astro/037_Chedi.DJ_essCn.webp","width":2560,"height":1707,"format":"webp"},"map":[18.80541992766638,98.92172591375619,17],"tags":["Chiang Mai","Doi Suthep","Wat Phra That","temple","Buddhism"]},{"id":"day-06-3-lunch-khaomao-khaofang","slug":"day-06-3-lunch-khaomao-khaofang","base":"/thailand-2024-1/","collection":"post","body":"[Khaomao Khaofang Restaurant](http://www.khaomaokhaofang.com/?lang=en) (ข้าวเม่า-ข้าวฟ่าง ป่าในจินตนาการ) has been awarded a Michelin hat for 2020-2023. Upon arrival, we are immediately greeted with the exquisite scenery of a rainforest creating an unparalleled atmosphere of an “imaginary jungle”. The restaurant is beautifully decorated with various kinds of flowers and shrubs along with an enormous roaring waterfall. The toilet here has to be seen to be believed, I really feel like I am peeing in the jungle and washing my hands in a waterfall.\n\nWe had a variety of dishes here, including sweet rice paper rolls with pork, crab omelette, steamed squid roe in spicy lime soup, stir fried soft shell crabs in yellow curry sauce, and stir fried chayote with oyster sauce.","trip":"Thailand 2024 Part 1","place":"South East Asia","timezone":"Asia/Bangkok","location":"Khaomao Khaofang","title":"Day 6: Lunch at Khaomao Khaofang","description":"We had lunch at Michelin starred restaurant Khaomao Khaofang which recreates a setting of an imaginary rainforest.","date":"2024-11-17T05:00:00.000Z","image":{"src":"/thailand-2024-1/_astro/24_Group.C9Wa6vDG.webp","width":2560,"height":1707,"format":"webp"},"map":[18.73038392539398,98.94345382985176,17],"tags":["Chiang Mai","Khaomao Khaofang","lunch","food","Michelin"]},{"id":"day-06-4-nimman","slug":"day-06-4-nimman","base":"/thailand-2024-1/","collection":"post","body":"Nimman is a trendy neighbourhood in Chiang Mai full of unique shops, galleries, boutique accommodation and eating places. It is full of young students and digital nomads due to its proximity to Chiang Mai University. We wandered around the lanes and passed by Gotham (a trendy restaurant) and Art Mai Gallery (a boutique hotel).\n\nAs it was Sunday, we browsed through the “White Market” at Nimman Soi 1- formed by the gathering of Japanese people living in Chiang Mai Province. Predictably this is full of cute trinkets and clothes.\n\nWe ended up at [One Nimman](https://www.onenimman.com/about/), a trendy mall at Nimmanhaemin Soi 1 full of lifestyle retailers and design studios. There is a clocktower located in the square in front of the mall which is full of food stalls.\n\nLastly, we stopped by at [MAYA](https://mayashoppingcenter.com) and browsed through some of the shops there.","trip":"Thailand 2024 Part 1","place":"South East Asia","timezone":"Asia/Bangkok","location":"One Nimman","title":"Day 6: Wandering around Nimman and Maya","description":"After lunch Margaret and I decided to wander around the trendy Nimman neighbourhood.","date":"2024-11-17T08:00:00.000Z","image":{"src":"/thailand-2024-1/_astro/12_Chris.CgEaCxm3.webp","width":2560,"height":1707,"format":"webp"},"map":[18.800283241710463,98.96834208286874,17],"tags":["Chiang Mai","Nimman","White Market","MAYA","One Nimman"]},{"id":"day-06-5-heritage-hotel","slug":"day-06-5-heritage-hotel","base":"/thailand-2024-1/","collection":"post","body":"[99 The Heritage Hotel](https://www.99theheritagehotels.com) is a luxurious boutique hotel that somehow reminds me of the Raffles in Singapore of the Peninsula in Hong Kong. Exuding old world charm and elegance, we posed for a few photos here. Next time I visit Chiang Mai, I would not mind staying here! It opened in 2016 and has 26 rooms over 2 floors.","trip":"Thailand 2024 Part 1","place":"South East Asia","timezone":"Asia/Bangkok","location":"99 The Heritage Hotel","title":"Day 6: 99 The Heritage Hotel","description":"We stumbled upon this charming boutique hotel on our way to visit the Chiang Mai Sunday night market.","date":"2024-11-17T10:00:00.000Z","image":{"src":"/thailand-2024-1/_astro/08_Heritage_Hotel.BkSxBUHG.webp","width":2560,"height":1707,"format":"webp"},"map":[18.789205878929074,98.98269804705494,17],"tags":["Chiang Mai","99 The Heritage Hotel","hotel"]},{"id":"day-06-6-night-market","slug":"day-06-6-night-market","base":"/thailand-2024-1/","collection":"post","body":"The [Sunday Market](https://www.visitchiangmai.com.au/sunday_market.html) (or Walking Street) is a large market located right in the centre of the old walled city area of Chiang Mai. Starting at the Tha Phae Gate at one end the Sunday Market extends for roughly 1km down the full length of Ratchadamnoen Road. We caught a tuk tuk from the house where we are staying which dropped us outside Wat Phra Singh end and we walked down Ratchadamnoen St. There were a lot of stalls and street food on display, but I found it overwhelming. There is a huge number of assorted stalls and vendors selling a wide array of goods including shoes, bags, jewellery, paintings, crafts, scarves, clothing, accessories, and more!","trip":"Thailand 2024 Part 1","place":"South East Asia","timezone":"Asia/Bangkok","location":"Sunday Walking Street market","title":"Day 6: Sunday night (Walking Street) market","description":"We visited the Chiang Mai Sunday night market held in the inner part of the city from Wat Phra Singh the Tha Pae Gate.","date":"2024-11-17T13:00:00.000Z","image":{"src":"/thailand-2024-1/_astro/13_Street_food.Dd-6aGF1.webp","width":2560,"height":1920,"format":"webp"},"map":[18.78841235394366,98.98637535563415,17],"tags":["Chiang Mai","walking street","sunday","market","night","shopping","food"]},{"id":"day-06-7-wat-tung-yu","slug":"day-06-7-wat-tung-yu","base":"/thailand-2024-1/","collection":"post","body":"Wat Tung Yu (วัดทุงยู) is a hidden gem located right in the middle of the Chiang Mai old city and looks beautiful at night. The primary assembly hall of the temple is tiny and compact, although it features a beautiful three-tiered roof with elaborately decorated gables that extend from the temple’s main structure. The main entrance to Wat Thung Yu is the smaller viharn, whose entrance is guarded by two intricately carved naga serpents. There are also two statues of two monks; on the left is a golden monk statue of Kruba Srivichai, who was one of the Lanna Kingdom’s most revered monks. Srivichai was responsible for overseeing the construction of many of Chiang Mai’s temples. Between these statues is a Buddha footprint, which is covered using a Burmese umbrella known as a Pathein Htee. Inside the temple I found many intricate murals depicting various stories from the Buddha's life. Behind the viharn is a small chedi.","trip":"Thailand 2024 Part 1","place":"South East Asia","timezone":"Asia/Bangkok","location":"Wat Tung Yu","title":"Day 6: Wat Tung Yu","description":"We discovered this charming temple whilst visiting the Sunday night market. It looked glorious at night.","date":"2024-11-17T13:00:00.000Z","image":{"src":"/thailand-2024-1/_astro/14_Wat_Tung_Yu.CQ5d_8pM.webp","width":2560,"height":1707,"format":"webp"},"map":[18.78864660291048,98.9841933786165,17],"tags":["Chiang Mai","Wat Tung Yu","temple","night"]},{"id":"day-07-1-wat-chiang-man","slug":"day-07-1-wat-chiang-man","base":"/thailand-2024-1/","collection":"post","body":"This is our last day in Chiang Mai. We opted for a tuk tuk tour of the old city:\n\n![Tuk tuk tour](../gallery/day-07-wat-chiang-man/01_Tuk_tuk.webp)\n\nThe tuk tuk took Margaret and I around the perimeter of the old city and we can see the remains of the old city walls and moat.\n\nChiang Mai (\"new city\") was founded in 1296 CE (1839 BE) by King Mangrai (Phaya Mangrai), who was the premier ruler of the Lanna Kingdom. The city was intended to replace Chiang Rai as the capital of the Lanna Kingdom. The city was established in an area that was formerly part of the Hariphunchai Kingdom (in present-day Lamphun Province) next to the Ping River. King Mangrai built the city as the political, commercial, and cultural center of Lanna.\n\nChiang Mai was designed with a well-planned layout, which featured city walls and a moat surrounding the city for the purpose of slowing down invasion as well as a security structure for those going in and out of the city. There are currently five main gates in the city wall that attest to the glorious past: Tha Phae Gate, Suan Dok Gate, Chang Phuak Gate, Chiang Mai Gate, and Saen Phu Gate. The early construction of Chiang Mai emphasized the building of important temples and religious sites, thus making the city a religious and cultural hub.\n\nAccording to this [interesting article](http://www.bytelife.altervista.org/thapae.htm) the ancient walls and gates of the old city were deliberately taken down prior to World War II and used for road construction, so it wasn't destroyed during World War II as I had originally thought. The Tha Pae gate where many tourists take photographs is actually a reconstruction from 1986. This is another interesting [article](https://changpuakmagazine.com/en-article/WALLS-AND-GATES/300287/) that talks about the walls and gates of Chiange Mai.\n\nOur first stop in the tuk tuk tour is [Wat Chiang Man](https://en.wikipedia.org/wiki/Wat_Chiang_Man) (วัดเชียงมั่น). The oldest structure here is the Chedi Chang Lom ('Elephant Chedi') fronted by two large viharns. The smaller viharn contains a crystal Buddha called Phra Sae Tang Khamani. I was intrigued by the many murals on the walls depicting various Buddhist scenes.\n\nThe main viharn contains multiple golden statues of Buddhas on a mondop structure. The historic chedi is very impressive - the square base supports a second level which has the front half of 15 life-sized brick-and-stucco elephants emerging from it. The elephants seem to carry the upper levels of the building on their backs. The gilded upper part of the chedi contains a bell shaped relic chamber directly underneath the pinnacle.\n\nAt the back of the temple is the Ho Trai (Temple Library) set on an artificial island in the middle of a lotus pond. We were allowed to pose for photographs on the bridge to the library, but not allowed to enter the library itself.\n\nThere is also an ubosot here which we did not enter.","trip":"Thailand 2024 Part 1","place":"South East Asia","timezone":"Asia/Bangkok","location":"Wat Chiang Man","title":"Day 7: Wat Chiang Man","description":"Today we went on a tuk tuk tour of the old city. First stop is Wat Chiang Man, a delightful temple.","date":"2024-11-18T02:00:00.000Z","image":{"src":"/thailand-2024-1/_astro/34_Wat_Chiang_Man.CekX2m19.webp","width":2560,"height":1707,"format":"webp"},"map":[18.79401571859497,98.98928102519676,17],"tags":["Chiang Mai","Wat Chiang Man","temple"]},{"id":"day-07-2-wat-phra-singh","slug":"day-07-2-wat-phra-singh","base":"/thailand-2024-1/","collection":"post","body":"Some people say [Wat Phra Singh Woramahaviharn](https://en.wikipedia.org/wiki/Wat_Phra_Singh) (วัดพระสิงห์วรมหาวิหาร) is the most beautiful temple in Chiang Mai. It is also known as the “Monastery of the Lion Buddha’ or the ‘Temple of the Lion Buddha’\n\nThe striking feature in this temple, and the oldest structure, is the main chedi, that was built in 1345 by King Pha Yu to enshrine the ashes of his father. The chedi (Chedi Than Chang Lom Wat Phra Singh - เจดีย์ฐานช้างล้อมวัดพระสิงห์) is circular in shape with a square base. Each of the sides of the chedi is decorated with elephant figures emerging from the chedi. Since its construction in the 14th century it has been enlarged considerably.\n\nThe main viharn (Viharn Lai Kham) or assembly hall was built at the end of the 14th century using Lanna style architecture to house a very highly revered Buddha image named Phra Singh Buddha.\n\n![Phra Singh Buddha](../gallery/day-07-wat-phra-singh/30_Wat_Phra_Singh.webp)\n\nThe very ornate exterior of the Viharn Lai Kham is decorated in typical Lanna gold and ochre colors. The viharn made from teak wood has a three tiered roof line, the lower edges of which are decorated with chofahs, a ornamental decoration that resembles the shape of a very thin bird.\n\n![Viharn Lai Kham and Chedi Than Chang Lom](../gallery/day-07-wat-phra-singh/12_Wat_Phra_Singh.webp)\n\nThe largest building at Wat Phra Singh is its other prayer hall, Viharn Luang, which was built in 1925 as replacement for the original dilapidated prayer hall built in the 14th Century. The front of this massive structure is very ornately decorated in gold relief.\n\n![Viharn Luang](../gallery/day-07-wat-phra-singh/01_Wat_Phra_Singh.webp)\n\nInside the Viharn Luang there is a 15th Century Buddha statue, the Phra Chao Thong Tip. The origins of this statue are known. It was cast in 1477 in Chiang Mai. Around the statue are life sized models of important monks who lived at the temple which are so life like that at a glance visitors are likely to mistake them for real live monks.\n\n![Phra Chao Thong Tip](../gallery/day-07-wat-phra-singh/20_Wat_Phra_Singh.webp)\n\nThe ubosot or ordination hall is an ornate teak wood structure built in 1806.\n\n![Ubosot](../gallery/day-07-wat-phra-singh/10_Wat_Phra_Singh.webp)\n\nThere are several other buildings here, including the Ho Tai scripture library (หอไตร)\n\n![Ho Tai](../gallery/day-07-wat-phra-singh/65_Wat_Phra_Singh.webp)\n\nAn example is the Chedi Ku Lai, which has a five-tiered roof and its inner chamber is connected by an “overground tunnel” to the viharn.\n\n![Chedi Ku Lai](../gallery/day-07-wat-phra-singh/37_Wat_Phra_Singh.webp)\n\nOther buildings here include monks' living quarters, various statues in gardens etc.","trip":"Thailand 2024 Part 1","place":"South East Asia","timezone":"Asia/Bangkok","location":"Wat Phra Singh","title":"Day 7: Wat Phra Singh","description":"The second stop on our tuk tuk tour of Chiang Mai is the Wat Chedi Luang, or \"temple of the big stupa\".","date":"2024-11-18T03:00:00.000Z","image":{"src":"/thailand-2024-1/_astro/36_Wat_Phra_Singh.Dio7w8k-.webp","width":2560,"height":1707,"format":"webp"},"map":[18.78862082412017,98.9820178638951,17],"tags":["Chiang Mai","Wat Phra Singh","temple"]},{"id":"day-07-3-wat-chedi-luang","slug":"day-07-3-wat-chedi-luang","base":"/thailand-2024-1/","collection":"post","body":"[Wat Chedi Luang](https://en.wikipedia.org/wiki/Wat_Chedi_Luang) (Thai: วัดเจดีย์หลวง) lives up to it's name, for the chedi is truly massive.\n\n![Chedi](../gallery/day-07-wat-chedi-luang/19_Wat_Chedi_Luang.webp)\n\nThe construction of the temple started in the 14th century, when King Saen Muang Ma planned to bury the ashes of his father in the place. After 10 years of building time it was left unfinished, later to be continued after the death of the king by his widow. Probably due to stability problems it took until the mid-15th century to be finished during the reign of king Tilokaraj. It was then 82 m high and had a base diameter of 54 m, at that time the largest building of all Lanna. In 1468, the Emerald Buddha was installed in the eastern niche. In 1545, the upper 30 m of the structure collapsed after an earthquake, and shortly thereafter, in 1551, the Emerald Buddha was moved to Luang Prabang.\n\nIn the early 1990s the chedi was reconstructed, financed by UNESCO and the Japanese government.\n\nAlso on the temple grounds is the city pillar (Lak Mueang) of Chiang Mai, named Sao Inthakin. Only men are allowed to go inside the shrine, so we could only view it from the outside.\n\n![Sao Inthakin](../gallery/day-07-wat-chedi-luang/01_Wat_Chedi_Luang.webp)\n\nThere is a pavilion here housing a reclining Buddha.\n\n![Reclining Buddha](../gallery/day-07-wat-chedi-luang/35_Wat_Chedi_Luang.webp)\n\nThe there is also another pavilion housing a wax figure of Chan Kusalo.\n\n![Chan Kusalo](../gallery/day-07-wat-chedi-luang/30_Wat_Chedi_Luang.webp)\n\nAfter that the tuk tuk driver dropped us back at MAYA where we had lunch before doing some shopping.","trip":"Thailand 2024 Part 1","place":"South East Asia","timezone":"Asia/Bangkok","location":"Wat Chedi Luang","title":"Day 7: Wat Chedi Luang","description":"The last stop on our tuk tuk tour of Chiang Mai is the Wat Chedi Luang.","date":"2024-11-18T04:00:00.000Z","image":{"src":"/thailand-2024-1/_astro/26_Wat_Chedi_Luang.Bx3ej89x.webp","width":2560,"height":1707,"format":"webp"},"map":[18.787152112417836,98.98665549821237,17],"tags":["Chiang Mai","Wat Chedi Luang","temple"]},{"id":"day-07-4-dinner-khantoke","slug":"day-07-4-dinner-khantoke","base":"/thailand-2024-1/","collection":"post","body":"A khantoke or khantok (ขันโตก) is a pedestal tray used as a small dining table by the Lanna people (of northern Thailand), Laotians, and by people from Isan (northeastern Thailand). The tradition of hosting traditional khanthoke dinners was initiated by Kraisi Nimmanhemin in 1906, a well–known business man and Lanna Thai scholar. The diners often enjoy the experience of sitting cross-legged on the floor ,sampling Northern cuisine from a shared khantoke tray and enhanced\nwith Northern classical dances.\n\nWe arrived at the venue dressed in traditional Thai outfits and it took a while for our khantoke to arrive as the venue seems to be prioritising large tour groups. However, the food was good and it was bottomless as well which helped.\n\nThere were various shows including a tee dance and various hill tribe dances.","trip":"Thailand 2024 Part 1","place":"South East Asia","timezone":"Asia/Bangkok","location":"Khum Khantoke","title":"Day 7: Khum Khantoke dinner and show","description":"On our last night in Chiang Mai we attended Khum Khantoke which consists of traditional Lanna dining and performances.","date":"2024-11-18T13:00:00.000Z","image":{"src":"/thailand-2024-1/_astro/21_Group.BvzNvp2j.webp","width":2560,"height":1707,"format":"webp"},"map":[18.799765161470287,99.02642382007195,17],"tags":["Chiang Mai","Khum Khantoke","food","dinner","performance"]},{"id":"day-08-2-cable-pole-art","slug":"day-08-2-cable-pole-art","base":"/thailand-2024-1/","collection":"post","body":"Here are some examples of cabling on poles in Thailand.\n\nI first encountered them on the street from the townhouse we were living in Chiang Mai to the main street.\n\n![cables](../gallery/day-n-cables/01_Cables.webp)\n\n![Chris](../gallery/day-n-cables/02_Cables.webp)\n\nThese examples are from the balcony of the property we stayed in Chiang Rai.\n\n![Grow Home](../gallery/day-n-cables/15_Cables.webp)\n\n![Grow Home](../gallery/day-n-cables/16_Cables.webp)\n\nFinally, here are some examples from Nimman:\n\n![Nimman](<../gallery/day-n-cables/16 Nimman.webp>)\n\n![Nimman](<../gallery/day-n-cables/17 Nimman.webp>)","trip":"Thailand 2024 Part 1","place":"South East Asia","timezone":"Asia/Bangkok","location":"various","title":"Postscript - the art of cable wiring on poles in Northern Thailand","description":"I am convinced cabling on poles is an art form in Thailand.","date":"2024-11-19T01:00:00.000Z","image":{"src":"/thailand-2024-1/_astro/16 Nimman.C4nFq-pJ.webp","width":2560,"height":1707,"format":"webp"},"map":[18.803261,98.970924,17],"tags":["Chiang Mai","Chiang Rai","cables"]},{"id":"day-08-1-house","slug":"day-08-1-house","base":"/thailand-2024-1/","collection":"post","body":"Advertised as \"A stylish and clean 3-story townhouse in Chiang Mai's prime location, boasting large, comfy space, safety, and serenity.\" on [Airbnb](https://www.airbnb.com.au/rooms/30682712?adults=6&children=0&infants=0&pets=0&wishlist_item_id=11003294352864&check_in=2024-11-12&check_out=2024-11-19&source_impression_id=p3_1710381379_5wsYKbGhkcDFOigg&previous_page_section_name=1000&fbclid=IwZXh0bgNhZW0CMTEAAR1-ncCIEvNNyLUBcf5w1pawIurxP_6nUrrzIS7tlB_Uz1Lrw90PLQ7skAg_aem_nyXaalX7r9QVk-hcl7s4Iw), this was our \"home\" whilst we were in Chiang Mai.\n\nI liked it a lot, it was about 10 min walk to MAYA and Nimman and quite convenient.","trip":"Thailand 2024 Part 1","place":"South East Asia","timezone":"Asia/Bangkok","location":"Townhouse in Tambon Chang Phueak","title":"Day 8: The Airbnb property we stayed in Chiang Mai","description":"As we prepare to leave Chiang Mai to board a flight to Bangkok, I took some photos of the Airbnb house we stayed in Chiang Mai.","date":"2024-11-19T00:00:00.000Z","image":{"src":"/thailand-2024-1/_astro/15_Living_Room.DOvrLwUM.webp","width":2560,"height":1707,"format":"webp"},"map":[18.803261,98.970924,17],"tags":["Chiang Mai","accommodation"]}]