[{"id":"thailand-2024-2","slug":"index.html","base":"/thailand-2024-2/","collection":"trip","body":"Ever since the COVID-19 pandemic lockdown, a group of us have been dreaming that we will take an overseas trip together once international travel restrictions have been lifted and we enter the brave new world of post-COVID vacations. Our dream is finally realised in 2024 when we are able to plan a trip to Bangkok. We literally spent many days talking about where we would go and what activities we would participate in.\n\nWe quickly agreed some ground rules - we would focus on food, sightseeing and shopping (not necessarily in that order, but that would be my personal priorities). The opportunity came when we realised plane tickets to Bangkok were quite reasonable (not quite pre-COVID sale prices but okay) and we all quickly booked our flights. We then scoured around for properties to rent so that we can stay together as a group.\n\nWe decided initially to just visit Chiang Mai and Bangkok, but then we realised there were a lot of things to see in Chiang Rai and it would be rushed to do it as a day trip. We hired a private tour driver who planned an itinerary for us. Cat, who is half-Thai, took charge of planning our itinerary in Bangkok.\n\nThis trip is so massive for the sake of optimising storage I have broken the trip to two parts. In Part 1, we fly from Sydney and arrive in Chiang Mai via Bangkok. We spent about a week in both Chiang Mai and Chiang Rai, visiting a variety of locations and sampling food from many places.\n\nIn Part 2 the adventure continues in Bangkok as we fly from Chiang Mai to Bangkok and spent a week there including a side trip to Amphawa.","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Thailand","title":"Thailand 2024 Part 2","description":"Part 2 of a long planned and awaited Girl's trip to Thailand, where we conclude the trip by spending 7 days in Bangkok.","date":"2024-11-26T11:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/trip.D61l7TSE.jpeg","width":2560,"height":1707,"format":"jpg"},"tags":["Thailand","Bangkok"]},{"id":"day-08-3-apartment","slug":"day-08-3-apartment","base":"/thailand-2024-2/","collection":"post","body":"We stayed an AirBNB apartment called [Prani Ploenchit](https://www.airbnb.com.au/rooms/843913711884697422). It's quite small (compared to the house we had in Chiang Mai) but quite well appointed with 2 bedrooms, 2 toilets and a living room/kitchen.","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Prani Ploenchit","title":"Day 8: Our Apartment at Khet Pathum Wan","description":"Photos from the apartment we stayed in Bangkok.","date":"2024-11-19T09:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/03_Living_Room.BNSePIPx.webp","width":2560,"height":1707,"format":"webp"},"map":[13.742629090467684,100.54927202512506,17],"tags":["Bangkok","Mahatun Plaza","Prani Ploenchit","accommodation"]},{"id":"day-08-2-mahatun","slug":"day-08-2-mahatun","base":"/thailand-2024-2/","collection":"post","body":"The apartment we are staying is located at Mahatun Plaza, very close to the BTS Ploenchit station and within walking distance to quite a few shopping centres.\n\nEven though I had lunch on the plane, we opted for another lunch at Madam Somtum - [Facebook Page](https://www.facebook.com/madamsomtum/). This is an Esan restaurant serving different varieties of somtum along with other Thai dishes, and apparently owned by the same owner as the apartment we are staying in.\n\nThe restaurant has an interesting decor, and the salted egg somtum we ordered was really nice!\n\nHere is a video of the staff at Madam Somtum at work:\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/V6J8Kyy9oCU?si=NCO23Odq9fk_uPW3\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Madam Somtum","title":"Day 8: Lunch at Madam Somtum at Mahatun","description":"We are staying at Mahatun Plaza near Ploenchit BTS Station, and had a late lunch at Madam Somtum.","date":"2024-11-19T08:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/04_Madame_Somtum.C2IawohY.webp","width":2560,"height":1707,"format":"webp"},"map":[13.742629090467684,100.54927202512506,17],"tags":["Bangkok","Mahatun Plaza","Madam Somtum","lunch","food"]},{"id":"day-08-4-yaowarat","slug":"day-08-4-yaowarat","base":"/thailand-2024-2/","collection":"post","body":"We took our first BTS train to Yaowarat (changing over to the Metro to reach our final destination):\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/7KK5mMo8wko?si=DoqgUDx0FnIHy48r\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n\nYaowarat Rd is the main artery of Bangkok's Chinatown, and every night it is full of food stalls. We saw many interesting stalls selling anything from giant oysters to sculptured 3D ice cream to all kinds of food, even shark fins and bird nests.\n\nWe couldn't help but stop at the famous Plaeng Nam Shark Fin-Bird’s Nest（義福巷燕窩). I was not game enough to try the shark fin soup, but I had the crab fried rice and tasted the fish maw soup.\n\nAfter that we also tried the famous wanton mee at the junction of Yaowarat Road and Yaowa Phanit called Mung Korn Khao Noodle.\n\nAfter that, we walked around Yaowarat Rd and stopped by a Thai dessert stall to have coconut ice cream desserts. All in all it was a very interesting night, and I really wished I could have eaten more.\n\nHere is a good video that gives an idea of what the experience of walking around Yaowarat Rd is like:\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/hlO2v6lerkk?si=-_BJSZAesC7nszgK\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Yaowarat Rd","title":"Day 8: Dinner at Yaowarat (Chinatown)","description":"We ventured to famous Yaowarat Rd via BTS and the metro to search for food.","date":"2024-11-19T13:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/02_MRT_station.CgQ9SCdH.webp","width":2560,"height":1707,"format":"webp"},"map":[13.740539816019728,100.50958079393155,17],"tags":["Bangkok","Yaowarat","Chinatown","food","dinner"]},{"id":"day-09-1-bangkok","slug":"day-09-1-bangkok","base":"/thailand-2024-2/","collection":"post","body":"In the morning we bought tickets for the Calypso cabaret show and the day tour tomorrow from a travel agency called [Boarding Pass](https://www.boardingpass.co.th/main/index.php?action=home&lang=en) located near the Ambassador Hotel on Soi Sukhumvit 11, Klongtoey Nua, Wattana.\n\nAlong Soi Sukhumvit 11, I passed through more examples of cable art:\n\n![cable art](../gallery/day-09-bangkok/03_cables.webp)\n\n![cable art](../gallery/day-09-bangkok/04_cables.webp)\n\nAfter that we headed to [Siam Paragon](https://www.siamparagon.co.th). Cat's friend Nuch owns a jewellery shop here called XAVIER BY UTHAI JEWELRY - [Facebook Page](https://www.facebook.com/xavierbyuthaijewelry/).\n\n![Xavier](../gallery/day-09-bangkok/11_Xavier.webp)\n\nWe also had lunch here at the Food Court on the Ground Floor. I had Thai Beef Noodle soup (Guay Tiew Nuea Nam Sai) and it was delicious. Aileen decided to order the crab omelette from Here Hai, a Michelins starred restaurant that as opened an outlet at the food court. It was delicious (I tried it), but it took nearly an hour for her to get the dish!\n\n![crab omelette](../gallery/day-09-bangkok/05_Crab_omelette.webp)\n\nI also bought some Kipling bags at the Paragon Department Store. They offered to do the tourist VAT processing for me even though I don't have my passport with me - all I needed to show as a photo of my passport with the details on it.","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Siam Paragon","title":"Day 9: Morning in Bangkok","description":"A morning spent at various places ending with lunch at Siam Paragon.","date":"2024-11-20T05:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/01_Nana_Station.QpvGusrg.webp","width":2560,"height":1707,"format":"webp"},"map":[13.745983317713028,100.53444461163275,17],"tags":["Bangkok","Ambassador Hotel","Boarding Pass","Siam Paragon","Xavier by Uthai Jewellery","lunch"]},{"id":"day-08-1-flight","slug":"day-08-1-flight","base":"/thailand-2024-2/","collection":"post","body":"We checked out of the house we were staying, and took a van to Chiang Mai airport. We boarded the flight at around 12pm and landed early, around 1:30pm to [Suvarnabhumi Airport](https://www.bangkokairportonline.com) (ท่าอากาศยานสุวรรณภูมิ).\n\nWe had prebooked an airport transfer van through the AirBNB property we are staying in Bangkok so we didn't wait very long at the airport. The trip to the apartment at Mahatun took a lot faster that we anticipated because traffic was quite light at that time.","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Suvarnabhumi Airport","title":"Day 8: Flight from Chiang Mai to Bangkok","description":"We bade goodbye and boarded Thai Airways TG105 from Chiang Mai to Bangkok.","date":"2024-11-19T07:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/06_Group.CE_gnYs8.webp","width":2560,"height":1707,"format":"webp"},"map":[13.682831776210376,100.74692364703516,17],"tags":["Bangkok","Suvarnabhumi","airport","flight"]},{"id":"day-10-1-wat-pho","slug":"day-10-1-wat-pho","base":"/thailand-2024-2/","collection":"post","body":"Our guide picked us up at 8:00AM and his name is Chuchai but he told us to call him \"Bird\". The temple and city half day tour includes the following:\n\n- Grand Palace & Emerald Buddha\n- Wat Pho (Reclining Buddha)\n- Wat Arun (Temple of Dawn)\n- Boat trip along the Klong (45-50 mins)\n\nThe first stop is [Wat Pho](https://en.wikipedia.org/wiki/Wat_Pho) (วัดโพธิ์).\n\nWat Pho is one of Bangkok's oldest temples. It existed before Bangkok was established as the capital by King Rama I. Our guide explained that King Rama I (Phra Bat Somdet Phra Phutthayotfa Chulalok Maharat พระบาทสมเด็จพระพุทธยอดฟ้าจุฬาโลกมหาราช) was the founder of the Rattanakosin Kingdom (now Thailand) and the first King of Siam from the reigning Chakri dynasty. He ascended the throne in 1782, following the deposition of King Taksin of Thonburi, who united Siam following the collapse of the Ayutthaya Kingdom but became mad in his later years (or so they say, perhaps they just wanted to get rid of him).\n\nKing Rama I decided to move the capital of Thailand from Thonburi to Bangkok, and decided to build the Grand Palace beside Wat Pho. He also decided to renovate Wat Pho. Originally, the temple site was named Wat Photaram or Podharam and it was renamed to Phra Chetuphon Vimolmangklavas. The temple complex continued to undergo changes over the next 200 years and was renamed Wat Phra Chetuphon Vimolmangklararm by King Rama IV.\n\nIt is home to more than one thousand Buddha images, as well as one of the largest single Buddha images at 46 metres (151 ft) in length. The Wat Pho complex consists of two walled compounds bisected by Chetuphon Road running in the east–west direction. The larger northern walled compound, the phutthawat, is open to visitors and contains the finest buildings dedicated to the Buddha, including the bot with its four directional viharn, and the temple housing the reclining Buddha. The southern compound, the sankhawat, contains the residential quarters of the monks and a school. The temple grounds contain four great chedis, 91 small chedis, two belfries, a bot (central shrine), a number of viharas (halls) and various buildings such as pavilions, as well as gardens and a small temple museum.\n\n![Group](../gallery/day-10-wat-pho/02_Group.webp)\n\nA number of large Chinese statues, some of which depict Europeans, are also found in the complex guarding the gates of the perimeter walls as well as other gates in the compound. These stone statues were originally imported as ballast on ships trading with China. One of these is apparently Marco Polo.\n\n![The group with Chinese guardians at the gate](../gallery/day-10-wat-pho/09_Group.webp)\n\nPhra Ubosot (Phra Uposatha) or bot is the ordination hall, the main hall used for performing Buddhist rituals, and the most sacred building of the complex. Inside the ubosot is a gold and crystal three-tiered pedestal topped with a gilded Buddha made of a gold-copper alloy, and over the statue is a nine-tiered umbrella representing the authority of Thailand. The Buddha image, known as Phra Buddha Theva Patimakorn, is thought to be from the Ayutthaya period.\n\n![Phra Buddha Theva Patimakorn](../gallery/day-10-wat-pho/24_Phra_Buddha_Theva_Patimakorn.webp)\n\nPhra Rabiang is a double cloister contains around 400 images of Buddha from northern Thailand selected out of the 1,200 originally brought by King Rama I.\n\n![Buddhas](../gallery/day-10-wat-pho/18_Buddhas.webp)\n\nThere are four towers, or phra prang, at each corner of the courtyard around the bot.\n\n![Phra Prang](../gallery/day-10-wat-pho/21_Phra_Prang.webp)\n\nPhra Maha Chedi Si Rajakarn is a group of four large stupas, each 42 metres high. These four chedis are dedicated to the first four Chakri kings. The first, in green mosaic tiles, was constructed by Rama I to house the remnants of the great Buddha from Ayuthaya, which was scorched to remove its gold covering by the Burmese.\n\n![Phra Maha Chedi Si Rajakarn](../gallery/day-10-wat-pho/13_Phra_Maha_Chedi_Si_Rajakarn.webp)\n\nOutside the Phra Rabiang cloisters are dotted many smaller chedis, called Phra Chedi Rai. They contain ashes of the royal family and also relics of the Buddha.\n\n![Phra Chedi Rai](../gallery/day-10-wat-pho/10_Phra_Chedi_Rai.webp)\n\nThe wat and the reclining Buddha (Phra Buddhasaiyas, Thai: พระพุทธไสยาสน์) were built by Rama III in 1832. The image of the reclining Buddha represents the entry of Buddha into Nirvana and the end of all reincarnations. The posture of the image is referred to as sihasaiyas, the posture of a sleeping or reclining lion. The figure is 15 m high and 46 m long, and it is one of the largest Buddha statues in Thailand.\n\n![Phra Buddhasaiyas](../gallery/day-10-wat-pho/38_Phra_Buddhasaiyas.webp)\n\nThis is video I made of our visit:\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/-Z2l1rst97k?si=46-CF4-KupOkh6Ca\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Wat Pho","title":"Day 10: Bangkok City Tour - Wat Pho","description":"Belinda, Margaret and I opted to take a private city tour of Bangkok organised by BoardingPass. First stop is Wat Pho, which contains the giant statue of the Reclining Buddha.","date":"2024-11-21T02:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/33_Phra_Buddhasaiyas.QsEb-8PJ.webp","width":2560,"height":1707,"format":"webp"},"map":[13.746594919676753,100.49250167639512,17],"tags":["Bangkok","tour","Wat Pho","temple"]},{"id":"day-10-2-grand-palace","slug":"day-10-2-grand-palace","base":"/thailand-2024-2/","collection":"post","body":"The [Bangkok Grand Palace พระบรมมหาราชวัง](https://www.royalgrandpalace.th/en/home) was constructed by King Rama I as a royal residence covering an area of 218,000 square metres that are enclosed by crenallated walls measuring 19,000 metres. It is laid out with Halls of Residence and Throne Halls as well as administrative buildings and a temple that serves as the Chapel Royal.\n\nRama I had eight prang or corncob towers on the east of the temple constructed to function as a Chedi monument worthy of veneration (Phra Asada Maha Chedi). The plastered brick chedi are decorated with stucco motifs and glazed tiles of differing colours and dedicated to eight Buddhist concepts.\n\n![Phra Asada Maha Chedi](../gallery/day-10-grand-palace/010_Phra_Asada_Maha_Chedi.webp)\n\nThe Prasad Phra Thepbidon Royal Pantheon is a building that has a Prang or corncob spire surmounting its roof. Geometric patterns of coloured glass mosaics adorn its exterior walls and pillars that are interspersed with ceramic tiles.\n![Prasad Phra Thepbidon](../gallery/day-10-grand-palace/022_Prasat_Phra_Thep_Bidon.webp)\n\nTwo golden stupas, titled Phra Suwannachedi (พระสุวรรณเจดีย์), are situated to the east of the terrace, flanking the steps leading up to the Prasat Phra Thep Bidon - this is one of them:\n\n![Phra Suwannachedi](../gallery/day-10-grand-palace/017_Phra_Suwannachedi_.webp)\n\nThe Phra Ubosot (Convocation Hall) is constructed in the midst of a chest height boundary wall with eight double-sema boundary stones that mark a consecrated area and the double-sema boundary stones signify that the temple was constructed by a king.\n\n![Phra Ubosot](../gallery/day-10-grand-palace/018_Phra_Ubosot.webp)\n\nThe Emerald Buddha that is considered to be an object of national veneration is carved from a block of jasper in the attitude of meditation and is enshrined high up on a tiered base in an altar of gilded wood designed to represent the Busabok aerial chariot of heavenly beings.\n\n![Emerald Buddha](../gallery/day-10-grand-palace/071_Emerald_Buddha.webp)\n\nSeven pairs of mythological figures decorate the terrace, made of bronze and gilded with gold leaf. These are half-animal half-human celestial beings which, according to tradition, inhabited the mythical Himavanta forest. Two examples are the Theppaksi, human male upper body with feathered arms, bird lower body, human feet and holding a sword; and Apsarasingha (Apsonsi), human female upper body and lion lower body.\n\n![Theppaksi](../gallery/day-10-grand-palace/028_Theppaksi.webp)\n\n![Apsarasingha](../gallery/day-10-grand-palace/027_Apsarasingha.webp)\n\nPhra Mondop is a traditional square building with mother-of pearl inlay doors topped by a Thai mondop spired roof was constructed by Rama I to hold a large lacquered mother-of-pearl inlay cabinet containing palm leaf Buddhist Tripitaka scriptures. The exterior walls are covered in glass mosaic and around the base are rows of gilt-stucco Thepanom folded-palm deities atop a row of Asura giants interspersed with mythical Garudas.\n\n![Phra Mondop](../gallery/day-10-grand-palace/029_Phra_Mondop.webp)\n\nThe Phra Sawet Kudakhan Wihan Yot (พระเศวตกุฏาคารวิหารยอด) or the Wihan Yot extends northwards from the terrace. The building, a vihara, serves as a Buddha image hall, and was first built by Rama III to house many important Buddha images.\n\n![Phra Sawet Kudakhan](../gallery/day-10-grand-palace/039_Phra_Sawet_Kudakhan_Wihan_Yot.webp)\n\nBronze figures of Tantima birds—birds with a human torso and Garuda head—guard the entrances on the west and east sides.\n\n![Tantima](../gallery/day-10-grand-palace/049_Tantima.webp)\n\nPhra Sri Rattana Chedi is a bell-shaped chedi or stupa of brick and mortar that was constructed in 1855 during the reign of Rama IV to house relics of the Buddha was originally white-washed but was later covered with gold mosaic tiles imported from Italy during the reign of Rama V in time to mark the centenary of Bangkok in 1882.\n\n![Phra Sri Rattana Chedi](../gallery/day-10-grand-palace/062_Phra_Sri_Rattana_Chedi.webp)\n\nFour small gilt-bronze busabok (Phra Barom Sanyalak Busabok) that are elevated on marble plinths around the Phra Mondop contain gilt-bronze emblems of the former nine Kings of the Bangkok period. At the base of each busabok are bronze elephant statues on marble bases that represent the auspicious white elephants consecrated in each of the reigns.\n\n![Phra Barom Sanyalak Busabok](../gallery/day-10-grand-palace/061_Phra_Barom_Sanyalak_Busabok.webp)\n\nSix pairs of statues of Asura or giants are placed as guardians with their backs to the gates inside the temple compound facing the Phra Ubosoth to show deference to the Emerald Buddha. These are two of them:\n\n![Giant Asura Guardians](../gallery/day-10-grand-palace/063_Giant_Asura_Guardians.webp)\n\nThe belfry or bell tower is decorated in floral and foliage patterns with bits and pieces of broken imported Chinese porcelain was begun in the reign of Rama IV to replace the belfry that was built by Rama I and was completed in time for the Centenary of Bangkok in the reign of Rama V.\n\n![Belfry](../gallery/day-10-grand-palace/075_Belfry.webp)\n\nThe Ho Sastragom Hall was built by Rama IV on the foundations of a former building of the reign of Rama I and was used as a chapel and to store auspicious items and talismans for warfare.\n\n![Ho Sastragom Hall](../gallery/day-10-grand-palace/090_Ho_Sastragom_Hall.webp)\n\nThe Phra Maha Monthien\nThe Phra Maha Monthian residential complex inside boundary walls was constructed by King Rama I and consists of the Chakkraphat Biman Royal Residence, the Debhasatharn Bilas Hall, the Deba-asana Bilai Hall, the Baisal Daksin Hall, and the Amarindra Vinijaya Throne Hall. All the buildings are connected and include the Ho Phra Suralai Biman and the Ho Phra Dhat Monthian.\n\n![Phra Maha Monthien](../gallery/day-10-grand-palace/091_Phra_Maha_Monthien.webp)\n\nThe Grand Palace itself, the Phra Thinang Chakri Maha Prasad, has reception rooms, dining hall and a Throne Hall. The building is in the neo-classical style with a roof surmounted by three Thai-spired Prasad instead of the three domes as stipulated by John Clunich the British architect.\n\n![Phra Thinang Chakri Maha Prasad](../gallery/day-10-grand-palace/098_Phra_Thinang_Chakri_Maha_Prasad.webp)\n\nThe Dusit Maha Prasad Throne Hall is enclosed by boundary walls as it is part of the residential complex built by Rama I. This brick plastered Throne Hall with a Prasad spired roof with red Garuda clutching the heads and seizing the tails of two Naga serpent statues at the four corners of the seven-tiered Maha Prasad roof replaced the Phra Thinang Indrabhisek Throne Hall that was built in wood and was destroyed in the fire that was caused by a lightning strike in 1789.\n\n![Dusit Maha Prasad Throne Hall](../gallery/day-10-grand-palace/099_Dusit_Maha_Prasad_Throne_Hall.webp)\n\nRama IV built the Abhorn Bimok Pavilion behind the west boundary wall of the Phrathinang Dusit Maha Prasad complex as a robing pavilion prior to mounting or after dismounting a palanquin.\n\n![Abhorn Bimok Pavilion](../gallery/day-10-grand-palace/101_Abhorn_Bimok_Pavilion.webp)\n\nThis is a video of the regimental march:\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/OOuDV1h4gwo?si=bQQA5liSKIwcPmzS\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Grand Palace","title":"Day 10: Bangkok Grand Palace","description":"Our second stop on the private city tour is the Grand Palace, the official residence of the Kings of Siam (and later Thailand) since 1782.","date":"2024-11-21T03:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/098_Phra_Thinang_Chakri_Maha_Prasad.Da0bSNPa.webp","width":2560,"height":1707,"format":"webp"},"map":[13.750053758286134,100.49164084832223,17],"tags":["Bangkok","tour","Grand Palace"]},{"id":"day-09-3-calypso","slug":"day-09-3-calypso","base":"/thailand-2024-2/","collection":"post","body":"We alighted from the river boat and arrived at [Asiatique เอเชียทีค เดอะ ริเวอร์ฟรอนท์](https://www.asiatiquethailand.com), the Riverfront, a large open-air mall in Bangkom facing the Chao Phraya River and Charoen Krung Road at the former docks of the East Asiatic Company. Here there are many stores selling clothes, food stalls and restaurants.\n\nWe came here to watch the [Calypso Cabaret คาลิปโซ่ คาบาเร่ต์](https://calypsocabaret.com). Our ticket includes not just the cabaret performance, but also a meal and a traditional Thai Classical Dance performance.\n\nHere we met Belinda, who had just arrived from Bangkok in the morning and would be spending the next few days with us.\n\nI was surprised that the dinner was quite tasty and filling, and the Thai Classical performance was a variety of numbers similar to the Khum Khantoke event we attended in Chiang Mai.\n\nPrior to the cabaret show, and whilst we are having dinner, are a number of classical Thai performances. These two videos showcases some of the performances:\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/uuaj0UHlQbY?si=SfIvj5M73IrGMs_K\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/7nypFeQ7qC8?si=Vu_7LbgNHqd-vxVg\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n\nThe show itself was fabulous, the production was very professionals, the dancers are very good, and the numbers range from amazing to funny. Here are some of the performances that I recorded:\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/ReNNL7pm3us?si=8Zrsmtfm3HLnWBoS\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/JeYQkOSo0yY?si=PKta-dnm1_P_6RVg\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/FtYb1bu7S7E?si=Sh6Rn2WL8K5w6KYl\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/nb9OmBOHBQ8?si=OuqQd6rf3d27UWWq\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/MKlEPm9UPOg?si=4QS6XVFSU9f7w728\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/pn3CMRYve5w?si=8rK-TlmzGRrECoa9\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/a0HvXg7rKFg?si=w7GTyhBY8XZYyKWM\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/aqABbSTaufg?si=3HcI-n68oTwYii6n\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/3z5RRvZ_3kU?si=3jpPHDfYZcmEYIDl\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Icon Siam","title":"Day 9: Calypso Cabaret","description":"Calypso Cabaret is a ladyboy show that has been operating since 1988. We attended a dinner plus performance at Asiatique the Riverfront.","date":"2024-11-20T14:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/04_Chris.BKmmrXtI.webp","width":2560,"height":1706,"format":"webp"},"map":[13.704208490794827,100.50371637715375,17],"tags":["Bangkok","Asiatique","Calypso Cabaret","performance","dinner"]},{"id":"day-09-2-icon-siam","slug":"day-09-2-icon-siam","base":"/thailand-2024-2/","collection":"post","body":"In the afternoon we took a taxi to [Icon Siam ไอคอนสยาม](https://www.iconsiam.com/th). The intention is to explore [Sook Siam](http://www.sooksiam.com) - the amazing recreation of a floating market in the ground floor of the massive shopping centre.\n\nThe taxi took a long time to get to Icon Siam, mainly because the traffic was so heavy.\n\nThe amount of stalls selling food and other products here is truly amazing - I have never seen such a bewildering array of different food available under one roof before. And the recreationg of a floating market is quite cute, complete with elephant and shrine.\n\nThis video gives a good idea of Sook Siam and how massive it is:\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/rTjNeyKjCfU?si=RRG88cMH2IIrA6qH\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n\nAfter that, we left Icon Siam and walked along the river promenade to catch a river boat to Asiatique.\n\nCITY TOUR DETAILS:\n\nconfirmed private city tour as below ;\nDriver : Boarding Pass Team / Mr.Pom\nTel : 0804359772\nPlate No. : 3099\nBy : Toyota Innova\nDate : 21/11/2024\nTemple & City tour by private car & tour guide half day\n\n- Grand Palace & emerald Buddha\n- Wat Pho ( Reclining Buddha)\n- Wat Arun ( Temple of Down)\n- Boat trip along the Klong (45-50 mins)\n  Pick up 2 point\n  Pick up time : 08.00 am\n  From : Kimpton Maa-Laai Bangkok\n  Name : Belinda Ward\n  after Mahatun Plaza meeting infront of Siam Pharmacy\n  Name : Margaret Stow & Chris Tham\n  Total ; 3 person\n\nTour Guide : Chuchai\nTel. : 0981571967\n\n\\*\\*start 08.00am ending tour 14.00 pm","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Icon Siam","title":"Day 9: Icon Siam","description":"In the afternoon we took a taxi to Icon Siam to explore Sook Siam - the amazing recreation of a floating market on the ground floor.","date":"2024-11-20T10:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/28_Icon_Siam.B1JPzH7R.webp","width":2560,"height":1707,"format":"webp"},"map":[13.726731524508908,100.50996845396077,17],"tags":["Bangkok","Icon Siam","Sook Siam","floating market","river cruise"]},{"id":"day-10-3-river-cruise","slug":"day-10-3-river-cruise","base":"/thailand-2024-2/","collection":"post","body":"Most tourists who visit Bangkok are of course aware of the Chao Phraya river, where a lot of Bangkok's attractions and hotels are located, but less have explored the complex and intricate network of small rivers and canals criss cross the city.\n\nAfter the Grand Palace, our guide hailed a river boat and we hopped on to it. I was very surprised how low the boat was, it felt like we were almost touching the water. But fortunately, the waters are quite calm. The river boat operator took us along the Chao Phraya river, but then ducked into a canal (Bangkok Noi) and soon we were exploring a side of Bangkok I have never seen before.\n\nWe passed through old communities along the canal banks where life seemed peaceful and far away from the bustling city. We also saw several temples, including one next to a statue of the Buddha where we could feed the catfish by throwing scraps of bread to the water. We also passed through the [Royal Barges National Museum](http://www.virtualmuseum.finearts.go.th/royalbarges/360/boat_1.html) พิพิธภัณฑสถานแห่งชาติ เรือพระราชพิธี.\n\nThis video is a glimpse of what the river journey is like:\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/XRJIihAnV8c?si=lsa-vLa2R3tW2ERK\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"River boat cruise","title":"Day 10: Cruising Bangkok's canals via river boat","description":"After the Grand Palace, we hopped onto a river boat to tour through Bangkok's canals.","date":"2024-11-21T04:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/06_Bangkok_river_cruise.BjOFSGxt.webp","width":2560,"height":1707,"format":"webp"},"map":[13.76216582412703,100.4845943962893,17],"tags":["Bangkok","tour","river boat","Chao Phraya river","Bangkok Noi","Royal Barge Museum"]},{"id":"day-10-5-kimpton","slug":"day-10-5-kimpton","base":"/thailand-2024-2/","collection":"post","body":"[Kimpton Maa-Lai](https://www.kimptonmaalaibangkok.com) is a luxury hotel. It is situated near Lumphini Park in the very posh neighbourhood along Soi Ton Son.\n\nThe room that Belinda stayed in is huge, bigger than the apartment accommodating 5 of us, and has fantastic views of the surrounding area.\n\nWe elected to have lunch at the hotel restaurant, and had a mixture of up market versions of standard Thai dishes, and after that we wandered around the gardens surrounding the hotel and took some photos.","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Kimpton Maa-Lai","title":"Day 10: Lunch at Kimpton Maa-Lai","description":"At the conclusion of our city tour, we are tired and hungry, so elected to stop by and have lunch at the Kimpton.","date":"2024-11-21T06:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/18_Chris.NEyQcMux.webp","width":2560,"height":1707,"format":"webp"},"map":[13.737867546707871,100.54348589064925,17],"tags":["Bangkok","hotel","Kimpton","lunch","food"]},{"id":"day-10-4-wat-arun","slug":"day-10-4-wat-arun","base":"/thailand-2024-2/","collection":"post","body":"[Wat Arun Ratchawararam Ratchawaramahawihan วัดอรุณราชวรารามราชวรมหาวิหาร](https://www.wat-arun.com) is an iconic Bangkok landmark, with it's imposing 82m tall spire (Prang) situated next to the Chao Phraya river. A buddhist temple has existed at this site since the Ayutthaya Kingdom. 1351–1767 AD, however the origins of the temple appears to be Hindu - it derives its name from the hindu god Aruna. embodied as the radiations of the rising sun. The central spire symbolises Mount Meru from hindu cosmology which is considered to be the centre of all physical, metaphysical and spiritual universes.\n\nKing Taksin (1734–82), who established the Thonburi Kingdom following the fall of Ayutthaya, established his capital around Wat Arun and brought with him the Emerald Buddha (originally from Vientiane, Laos) - the Emerald Buddha as we know is now located at the Wat Ubosot in the Grand Palace,\n\nThe surrounding spires are devoted to the wind God, Phra Phai. The giant white figurine is Sahassa Deja and the giant green figurine is Thotsakan. The Giants (yaksha) face in four directions to offer protection. The central spire is topped with a seven pronged trident, known as \"Trident of Shiva\". At the second terrace there are four statues of the Hindu God Indra riding on Erawan, (a colossal elephant with three heads). Around the base of the spire are various figures of ancient Chinese soldiers.\n\nIt is possible to climb the stairs of the central spire to get a good view of Bangkok, but we were too tired and elected not to undertake the task.","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Wat Arun","title":"Day 10: Wat Arun","description":"Our last stop on the private Bangkok city tour, Wat Arun has the romantic name of Temple of Dawn.","date":"2024-11-21T05:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/10_Wat_Arun.C_RDE_0y.webp","width":2560,"height":1707,"format":"webp"},"map":[13.744463093682487,100.48850206747825,17],"tags":["Bangkok","tour","Wat Arun","temple"]},{"id":"day-11-1-road-trip","slug":"day-11-1-road-trip","base":"/thailand-2024-2/","collection":"post","body":"Today we embarked on a road trip to stay at a riverside house near Amphawa. The plan is to eat along the way, and visit the Amphawa Floating Market. Two of Cat's friends, Nuch and Mam, decided to join us on the trip so we are 8 in all.\n\nWe stopped by at a rest stop/petrol station along the way to buy some snacks and drinks, and encountered a lovely huge fluffy dog that we all gave lots of attention to.\n\nWe rented out a house at [Baankwaeom Boutique Homestay](http://www.baankwaeom.com/index.php) บ้านแควอ้อมบูติคโฮมสเตย์อัมพวา, beside the Khwae Om canal. It is called Tara House, and it is a very interesting property. The ground floor is a living room, a kitchen and 2 bathrooms. Upstairs is a single bedroom that sleeps up to 8 people in 4 beds. Nearby is Baan Cafe which served us some food on arrival and will also serve us breakfast the next day. The property is owned by a friend of Cat - Mam","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Pit Stop","title":"Day 11: Road Trip to Amphawa","description":"Joined by two of Cat's friends, we are taking a girls road trip to Amphawa and staying overnight.","date":"2024-11-22T02:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/01_Van.cSxaVgpM.webp","width":2560,"height":1707,"format":"webp"},"map":[13.555781573928313,100.27624764412285,17],"tags":["Amphawa","road trip","food"]},{"id":"day-10-6-ton-son","slug":"day-10-6-ton-son","base":"/thailand-2024-2/","collection":"post","body":"Walking from the Kimpton back to our apartment was quite pleasant and took about 15 mins. For the most part, I was walking along Soi Ton Son, a quiet road next to a canal and leafy trees.\n\nOnce I hit Ploen Chit Rd, I was confronted with modern Bangkok and passed many gleaming skyscrapers and shopping centres,","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Soi Ton Son","title":"Day 10: Walk along Soi Ton Son and Ploen Chit Rd","description":"After lunch I elected to walk back to the apartment we are staying at Mahatun Plaza through the leafy street of Soi Ton Son next to a canal.","date":"2024-11-21T08:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/1_Soi_Ton_Son.BtnwgWDF.webp","width":2560,"height":1707,"format":"webp"},"map":[13.742457050206523,100.54538489467024,17],"tags":["Bangkok","walk","Soi Ton Son","Ploen Chit Rd"]},{"id":"day-11-3-baankwaeom","slug":"day-11-3-baankwaeom","base":"/thailand-2024-2/","collection":"post","body":"We rented out a house at [Baankwaeom Boutique Homestay](http://www.baankwaeom.com/index.php) บ้านแควอ้อมบูติคโฮมสเตย์อัมพวา, beside the Khwae Om canal. It is called Tara House, and it is a very interesting property. The ground floor is a living room, a kitchen and 2 bathrooms. Upstairs is a single bedroom that sleeps up to 8 people in 4 beds. Nearby is Baan Cafe which served us some food on arrival and will also serve us breakfast the next day. The property is owned by a friend of a friend of Cat.\n\nWhen we arrived, I was surprised to see the place flooded with water and most of the lawns were covered with water. I was later told this is high tide and quite normal, and the water level does not get any higher than this.\n\nWe spent a lovely afternoon relaxing at the property, and I ended up dozing on the deck chair and also spent some time in the sauna. Life beside the canal is very peaceful and tranquil and after the hectic hustle and bustle of our trip so far, it is nice to be able to relax.","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Baankwaeom","title":"Day 11: Baankwaeom Boutique Homestay","description":"This is a riverside property by the canal owned by a friend of a friend of Cat. We stayed here overnight.","date":"2024-11-22T08:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/09_Baankwaeom.BNbLdCIX.webp","width":2560,"height":1707,"format":"webp"},"map":[13.440336439413128,99.93513621390306,17],"tags":["Amphawa","road trip","Baankwaeom","Naan Cafe"]},{"id":"day-11-2-lunch-daeng","slug":"day-11-2-lunch-daeng","base":"/thailand-2024-2/","collection":"post","body":"[Daeng Seafood Restaurant](https://www.daengseafood.com/en/) แดงอาหารทะเล (40 ปี) ร้านต้นตำรับตัวจริงกว่า 40 ปี based in Samut Songkhram has been around nearly 40 years and is situated in an open area. The restaurant is partially an open air restaurant but we elected to sit inside. Wow, the seafood here is fresh and delicious, I really enjoyed every dish and felt this was one of the best restaurant meals I had in Thailand.\n\nWe had a variety of dishes, including razor clams, squid, pomfret, pork balls, tofu, pork balls and morning glory.","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Daeng Seafood","title":"Day 11: Lunch at Daeng Seafood Restaurant","description":"We stopped by at this well known seafood restaurant on the way to Amphawa.","date":"2024-11-22T05:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/18_Daeng.CY5rcPPr.webp","width":2560,"height":1707,"format":"webp"},"map":[13.559122730129772,100.27809045901279,17],"tags":["road trip","food","lunch","Daeng Seafood","Samut Songkhram"]},{"id":"day-11-4-boat-trip","slug":"day-11-4-boat-trip","base":"/thailand-2024-2/","collection":"post","body":"The boat was quite similar to the river boat we went on in Bangkok. It passed through a number of temples on the way to Amphawa Floating market, including Wat Bang Koh Thepsak, Wat Bangkhae Noi and Wat Phummarin Kudithong. After leaving the Khwae Om canal, it went along the Mae Klong river before turning into Wat Chula canal, where the Amphawa Floating market is.\n\nThis video documents part of our boat trip to Amphawa:\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/eF6Xp4od7tc?si=a4wL0tpj7QwMpObj\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"River Boat","title":"Day 11: Boat Trip to Amphawa Floating Market","description":"In the evening, we hired a river boat to take us to Amphawa Floating Market.","date":"2024-11-22T11:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/07_Boat.BXHmOdOI.webp","width":2560,"height":1707,"format":"webp"},"map":[13.424731155701087,99.94855920073826,17],"tags":["Amphawa","boat trip","temple","river","canal"]},{"id":"day-12-1-baankwaeom","slug":"day-12-1-baankwaeom","base":"/thailand-2024-2/","collection":"post","body":"The next morning, we woke up, had breakfast at Naam Cafe, and checked out of the homestay, but not before taking a few photos. I was glad to see the water has receeded, so we were able to visit more places in the property. Cat, Mam and Nuch were supposed to go and give alms to the monks in a nearby temple, but apparently the monks are busy today with an event.\n\nThis video is a dog we found on the property:\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/7_PQ1RZ1XTA?si=oTFWh9q0KGX2cd2a\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Baankwaeom","title":"Day 12: Baankwaeom Boutique Homestay","description":"We woke up the next morning to have breakfast, and then checked out of Baankwaeom.","date":"2024-11-23T02:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/73_Group.CKMlKjuq.webp","width":2560,"height":1707,"format":"webp"},"map":[13.440336439413128,99.93513621390306,17],"tags":["Amphawa","road trip","Baankwaeom","Naan Cafe","breakfast"]},{"id":"day-11-5-amphawa","slug":"day-11-5-amphawa","base":"/thailand-2024-2/","collection":"post","body":"[Amphawa Floating Market](https://amphawafloatingmarket.org) is located in the province of Samut Songkhram, Thailand, Amphawa Floating Market (ตลาดน้ำอัมพวา) is a vibrant and colourful market set against the stunning backdrop of the Mae Khlong River. There are a myriad of food stalls and other shops selling local items and handicrafts.\n\nI was amazed at the variety of food here, including huge grilled river prawns, various kinds of skewers and sausages. We ended up ordering probably too much, and had a delightful time in the riverfront eating, and then walked around visiting the stalls and enjoying the various boats in the canal carrying tourists.\n\nThis video gives a good overview of Amphawa Floating Market from the boat:\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/xDNzgqKIjmI?si=jbcLAqj088nkKTml\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Amphawa Floating Market","title":"Day 11: Amphawa Floating Market","description":"Amphawa Floating Market is strictly speaking no longer floating market, since most of the stalls have moved into the riverfront.","date":"2024-11-22T13:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/16_Amphawa.DFSkDwH4.webp","width":2560,"height":1707,"format":"webp"},"map":[13.42517728059532,99.95492676489779,17],"tags":["Amphawa","floating market","night","food","dinner"]},{"id":"day-12-2-wat-bang-kung","slug":"day-12-2-wat-bang-kung","base":"/thailand-2024-2/","collection":"post","body":"Wat Bang Kung วัดบางกุ้ง ([Facebook Page](https://www.facebook.com/pages/วัดบางกุ้ง%20โบสถ์ปรกโพธ์%20อ.บางคนที%20จ.สมุทรสงคราม/961583520599818/?locale=th_TH&_rdc=1&_rdr)) is an ancient temple in Samut Songkhram, Thailand, built during the Ayutthaya period. It was the site of the Battle of Bang Kung, between the Konbaung dynasty and the Thonburi Kingdom. The temple is covered with various roots, which help support the ubosot. Inside, there is a statue of Buddha and a mural depicting the story of his life.\n\nIt is is interesting that the temple site has many sculptures depicting the Battle of Bang Kung.","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Wat Bang Kung","title":"Day 12: Wat Bang Kung","description":"On the way back to Bangkok, we made a stop at a nearby temple famous for their sculptures and the ubosot is covered by fig tree roots.","date":"2024-11-23T04:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/07_Wat_Bang_Kung.C1wn4Ul9.webp","width":2560,"height":1707,"format":"webp"},"map":[13.446319781797683,99.9411003674498,17],"tags":["Amphawa","road trip","Wat Bang Kung","temple"]},{"id":"day-12-3-manpai-sainam","slug":"day-12-3-manpai-sainam","base":"/thailand-2024-2/","collection":"post","body":"Manpai Sainam Café & Restaurant ร้านอาหาร ม่านไผ่ สายน้ำ ([Facebook Page](https://www.facebook.com/profile.php/?id=100081770051609)) nestled in the Sam Phran District of Nakhon Pathom, is an interesting restaurant where diners enjoy food in outdoor huts or cabanas situated around an artificial lake. The food here is delicious, and there are lots of opportunities to take photos around the site. At the back is a waterlily pond which is somewhat reminiscent of Monet's Garden, but it was a bit overgrown when I was there.\n\nThis video gives a good overview of the restaurant:\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/KRrG_yKuEpk?si=IjI9T5hDr7ypwL1x\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Manpai Sainam","title":"Day 12: Lunch at Manpai Sainam","description":"Manpai Sainam is a very picturesque restaurant where diners eat in in huts or villas situated by a lake.","date":"2024-11-23T05:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/31_Cat.qLwgl7Ub.webp","width":2560,"height":1707,"format":"webp"},"map":[13.791422642651193,100.30337636181851,17],"tags":["Amphawa","road trip","Manpai Sainam","food","lunch"]},{"id":"day-12-4-fa-pla-tahn","slug":"day-12-4-fa-pla-tahn","base":"/thailand-2024-2/","collection":"post","body":"Safely back in Bangkok after the road trip, we decided to venture to Central Embassy and Childlom in search of dinner and to do some shopping.\n\nฟ้าปลาทาน เซ็นทรัล ชิดลม Fá Plā Tahń at Central Childlom ([Facebook Page](https://www.facebook.com/faplatahn/)) is a restaurant specialising in Khao Tom Pla, or boiled rice soup with fish. Their speciality seems to be Teochew style \"fish noodles\" - the noodles are actually made out of fish paste, and typically served with fish balls and minced pork. The food is expensive by Bangkok standards, but reasonable by Australian standards.\n\nI really enjoyed my bowl of fish noodles and would happily come back here again.","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Fá Plā Tahń","title":"Day 12: Dinner at Fá Plā Tahń","description":"Fá Plā Tahń is a noodle restaurant with a difference - they serve noodles made out of fish paste.","date":"2024-11-23T11:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/01_Fa_Pla_Tahn.CRLYR2xX.webp","width":2560,"height":1707,"format":"webp"},"map":[13.74516228535405,100.54460277273853,17],"tags":["Bangkok","Fá Plā Tahń","dinner","Central","Childlom"]},{"id":"day-13-1-chatuchak","slug":"day-13-1-chatuchak","base":"/thailand-2024-2/","collection":"post","body":"With over 200,000 people flocking into [Chatuchak Weekend Market](https://www.chatuchakmarket.org) ตลาดนัดจตุจักร every weekend, this has become the World’s largest Weekend Market. The Market has over 15,000 stalls which are spread across 35 acres and 26 sections which range from Food, Art, Antiques, Fashion and much more.\n\nGetting here was a challenge, and involved taking the BTS to Mo Chit Station and it was quite far from where we stayed.\n\n![Mo Chit](../gallery/day-13-chatuchak/03_Chatuchak.webp)\n\nWe all bought a lot of bras at a lingerie shop here because the woman was very helpful in choosing sizes for us.\n\n![Bra shopping](../gallery/day-13-chatuchak/06_Group.webp)\n\nAfter that, we wandered off to JJ Mall in search of Thai silk outfits. We had lunch at JJ Mall and it was my first opportunity to try vegetarian food which I enjoyed.\n\n![Lunch](../gallery/day-13-chatuchak/07_Lunch.webp)\n\nAfter lunch, I wandered off by myself because I wasn't very interested in Thai silk. I probably covered only 10% of the market, there were that many stalls and little lanes, but it was exhausting, so I eventually made my way to Kamphaeng Phet monorail station and returned back to the apartment.","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Chatuchak","title":"Day 13: Chatuchak Market","description":"Today we decided to visit Chatuchak Market, the World's Largest Weekend Market.","date":"2024-11-24T07:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/02_Chatuchak.CZKwIj-9.webp","width":2560,"height":1707,"format":"webp"},"map":[13.799999788653281,100.55044595396166,17],"tags":["Bangkok","Chatuchak","market","lunch","shopping"]},{"id":"day-13-2-wishulada","slug":"day-13-2-wishulada","base":"/thailand-2024-2/","collection":"post","body":"[Wishulada Panthanuvong](https://www.wishulada-art.com) is an environmental artist who challenges conventional thinking by transforming waste materials into valuable artworks. I visited her exhibition [\"Adaptation: The Coexistence of \"Trace\" and \"Transformation\"](https://www.bangkokartcity.org/discover-detail/adaptation) at noble PLAY, a creative space in Phloen Chit (which hosted the event from 07th October 2024 to 26th January 2025).\n\nWishulada Panthanuvong’s exhibition \"Adaptation: The Coexistence of \"Trace\" and \"Transformation\" is an artistic work that depicts the evolution of an expanding metropolis. The environment bears witness to the transformations that have transpired due to human activity and urbanization. Despite the damage, artist Wishulada turns the rubble into a beacon of hope, with the inscription \"Trace\". While the message of \"Transformation\" from past mistakes seeks to guide people away from destructive habits and toward a more sustainable way of life.\n\nnoble PLAY and Wishulada Panthanuvong share a common goal to enhance environmental awareness, encourage the use of waste resources, and develop the environment for optimum advantage through this exhibition. Works in the exhibition are created from a variety of construction waste materials; these artworks challenge the conventional wisdom about \"worthless things that everyone overlooks.\" The artist's work also encourages people to think about the complex interactions between humans, the environment, and the metropolis.\n\nThis exhibition delves into the underlying significance of adaptability and sustainable cohabitation in a fast-changing world, utilizing art as a communication tool to encourage visitors to reflect on their own role in society and the environment.\n\nThe artist Wishulada creates works through questioning and discovery to inspire people to 'remember' the lessons of past unfriendly environmental actions, 'adapt' their way of life, be conscious of how to make the best use of available resources, and collaborate to create a sustainable future.\n\n\"Adaptation: The Coexistence of \"Trace\" and \"Transformation\" is an exhibition where you may discover...\n\n## Three-Tree Transformation\n\n\"Installation Art\" repurposes construction materials such steel bars, pipes, bricks, tile and cement to create \"Three-Tree Transformation,\" which may assume three distinct forms for Halloween, Christmas, and Chinese New Year festivities.\n\nUrban construction traces transformed into symbolic artworks reveal not just the adaptability, curiosity, and openness of the artists, but also the society at large.\nThe exhibition invites viewers to ponder and question the essence of coexistence in a multicultural society, while also providing a fresh space for learning and exchanging ideas. Encourage everyone to adapt, open their minds to tolerate differences, and reconsider their stance on coexistence.\n\n## A \"Concrete Jungle Blossoms\"\n\nEnter a fantastical realm where construction debris takes the form of trees, complete with sturdy trunks and branches that extend across the exhibition space.\nRecycled plastic bottles and plastic bags, as well as multicolored vinyl pieces, are braided into leaves, flowers, and fruits to make a magnificent tree transformation.\nWhile the box made of vinyl remnants is a sobering reminder of the effects of consumer culture, it is also a hopeful sign of the potential for repurposing unwanted items into art that raises environmental consciousness.\n\nThe \"Concrete Jungle Blossoms\" initiative brings together urbanites, nature, and the built environment. The strategically placed benches invite visitors to pause, converse, exchange ideas, and build small communities that develop in tandem with the tree transformation.\nIn a rapidly changing world, this exhibition reflects the importance of adaptation for both human and nature’s survival. It is a reminder of the impact of mindless consumption while also inspiring people to take collective action toward a greener tomorrow.\n\n## \"Finale: turning a page... towards a fresh start\"\n\nOpen the door to the behind-the-scenes world of art creation, where inspiration, creativity, and the artist's working process merge. The exhibition demonstrates the sustainable coexistence of humans and nature in a constantly evolving world.\n\nThis exhibition serves as a catalyst for learning and exploration, encouraging creativity and raising awareness that there is only one world and limited resources. Using resources wisely and sustainably means leaving preserve space for future generations to grow sustainably.\n\n## “SUSTAINABLE MAP: Map of Bangkok, Thailand”\n\nThis exhibition explores Bangkok through an artistic lens that combines beauty and sustainability. The exhibition draws inspiration from over 300 kilograms of construction waste and recycled materials for creating stories about 179 prominent places in Bangkok, including well-known restaurants, trendy cafes, museums, and religious sites.\nBy simply scanning the QR code, visitors can discover nearby attractions, creating a one-of-a-kind travel experience, benefiting the local economy, and increasing public awareness of tourist destinations.\n\nThe artwork exemplifies the circular economy concept by repurposing discarded materials into works of art and connecting trash recycling to generate cash for the community, demonstrating the power of creativity and the importance of adaptation. It serves as a reminder to be mindful of the environmental impact of our consumption and an encouragement for people to work together to create a sustainable future.","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Wishulada at noble PLAY","title":"Day 13: Wishulada at noble PLAY","description":"In the afternoon I went out fo a walk and discovered an exhibition of art from waste by Wishulada.","date":"2024-11-24T08:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/03_Wishulada.DbVF3tIs.webp","width":2560,"height":1707,"format":"webp"},"map":[13.743732911434504,100.54835653861717,17],"tags":["Bangkok","Wishulada","noble PLAY","exhibition"]},{"id":"day-14-1-lunch-nhong-rim-klong","slug":"day-14-1-lunch-nhong-rim-klong","base":"/thailand-2024-2/","collection":"post","body":"Formerly located by the canal as a food stall, Nhong Rim Klong is now located at Ekkamai Soi 23. It is a casual dining ambience with simple furniture and a semi-open kitchen concept. The restaurant is also listed on the Michelin Bib Gourmand list for Bangkok in 2023.\n\nIt is not easy to get to by public transport, so we opted to catch a Grab there. The place has been made famous through social media, very soon after we arrived there was already a queue forming outside.\n\nIt took quite a while for the food to arrive. I must admit, I was a little disappointed. After all the hype, the food is fairly ordinary and I am not sure I will come back here again.","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Nhong Rim Klong","title":"Day 14: Lunch at Nhong Rim Klong","description":"Our last day in Bangkok. We decided to take a Grab to Nhong Rim Klong - a place famour for the crab omelette.","date":"2024-11-25T05:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/01_Nong_Rim_Klong.CGuxru8L.webp","width":2560,"height":1707,"format":"webp"},"map":[13.741497478194807,100.58867753861718,17],"tags":["Bangkok","food","Nhong Rim Klong","lunch"]},{"id":"day-13-3-bangkok-shopping","slug":"day-13-3-bangkok-shopping","base":"/thailand-2024-2/","collection":"post","body":"In the afternoon, I continued my exploration of Bangkok shopping centres within walking distance from the apartment where we stayed. I visited [Central Embassy](https://www.centralembassy.com), then [centralWorld](https://www.centralworld.co.th/en/home), and walked along the BTS Skyway.\n\ncentralwOrld was pretty much as I remembered it from 10 years, it is a huge shopping centre and takes quite some time to walk through it all. I ended up having dinner at the Thai food court in the Central Department Store, and it was good.\n\n![Lim Lao Ngow](../gallery/day-13-bangkok-shopping/33_Lim_Lao_Ngow.webp)\n\n![Noodles](../gallery/day-13-bangkok-shopping/34_Noodles.webp)\n\nThis video is the Warm Wishes Tunnel connecting Central Embassy to Central Childlom:\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/WZI_C40xr54?si=1UPy1PqXn_LUG6_q\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"centralwOrld","title":"Day 13: Bangkok Shopping","description":"I visited various shopping centres within walking distance of the apartment.","date":"2024-11-24T11:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/06_centralwOrld.w0_P3Gz8.webp","width":2560,"height":1707,"format":"webp"},"map":[13.746762960065398,100.53919171163278,17],"tags":["Bangkok","shopping","Central Embassy","Gaysorn Village","centralWorld"]},{"id":"day-14-2-terminal-21","slug":"day-14-2-terminal-21","base":"/thailand-2024-2/","collection":"post","body":"[Terminal 21](https://www.terminal21.co.th) เทอร์มินอล21​ อโศก is my favourite shopping centre in Bangkok because it is like a theme park - each floor is meant to evocate a city or location in the world, so it brings the dream of traveling the world to downtown Bangkok, with its unique concept that places several world-famous cities under one roof. Wandering through the shopping centre is like wandering around a maze of shops in Tokyo City, sauntering down London’s Carnaby Street, bagging a bargain in an Istanbul souk, eating at the Fisherman’s Wharf in San Francisco. The atrium looks a bit like an airport with floor signs that signal the arrivals in particular cities, electronic display boards bring to mind flight information displays at an airport terminal, and the information desk receptionists wear flight attendant uniforms.\n\nAnd there are various props that one can pose next to for photos. I decided my quest is to take a photo of myself next to every prop I can find, so I enlisted the help of various strangers who are visiting the mall. Many were very cooperative, one Indian guy took dozens of photos of me in various poses. Two Italians (actually, they told me they were from the Republic of San Marino) took various photos of me next to a Vespa scooter, and they said they were trying to get a photo that was optimal from the perspective of the scooter as well as myself. All in all, it was great fun, and a fantastic way to chill out before packing for the flight. I finished off with a strawberry ice cream sundae from Swensens.","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Terminal 21","title":"Day 14: Posing for Photos at Terminal 21","description":"After lunch I was dropped off at a nearby BTS station and went to Terminal 21 - my favourite shopping centre in Bangkok.","date":"2024-11-25T09:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/02_Terminal_21.BMtc0kR1.webp","width":2560,"height":1707,"format":"webp"},"map":[13.739637613826801,100.5607529758888,17],"tags":["Bangkok","shopping","Terminal 21"]},{"id":"day-15-1-airport","slug":"day-15-1-airport","base":"/thailand-2024-2/","collection":"post","body":"We had preordered an Airport transfer that picked us up at 7am in the morning and we had an uneventlful journey to the airport, managed to check in successfully, then had breakfast at McDonalds. After that we waited for the flight to board, and happily discovered the flight was not very full - we had nobody sitting in the middle seat between us, and also the row in front, which had extra legroom, was empty.\n\nWe had a great flight back to Sydney, and landed at around 10pm at night and made it safely home.\n\nThis is a video of the impressive Samudra manthan sculpture at the airport:\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/TFHHdAKBrjo?si=1tJleoGvA_9qMY0u\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n\nAnd this is a video of a cute cleaning robot we found whilst waiting for food:\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/-kOzymEDiJc?si=xnPh3lFzR6YSzmjm\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Suvarnabhumi Airport","title":"Day 15: Flying back to Sydney","description":"Unfortunately our holiday is now officially over so I packed everything the night before, and in the morning we made our way to the airport.","date":"2024-11-26T03:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/06_Plane.YCScW-SR.webp","width":2560,"height":1707,"format":"webp"},"map":[13.682831776210376,100.74692364703516,17],"tags":["Bangkok","airport","Suvarnabhumi","flight","Sydney"]}]