[{"id":"thailand-2024.md","slug":"index.html","base":"/thailand-2024/","collection":"trip","body":"\nEver since the COVID-19 pandemic lockdown, a group of us have been dreaming that we will take an overseas trip together once international travel restrictions have been lifted and we enter the brave new world of post-COVID vacations. Our dream is finally realised in 2024 when we are able to plan a trip to Bangkok. We literally spent many days talking about where we would go and what activities we would participate in.\n\nWe quickly agreed some ground rules - we would focus on food, sightseeing and shopping (not necessarily in that order, but that would be my personal priorities). The opportunity came when we realised plane tickets to Bangkok were quite reasonable (not quite pre-COVID sale prices but okay) and we all quickly booked our flights. We then scoured around for properties to rent so that we can stay together as a group.\n\nWe decided initially to just visit Chieng Mai and Bangkok, but then we realised there were a lot of things to see in Chieng Rai and it would be rushed to do it as a day trip. We hired a private tour driver who planned an itinerary for us. Cat, who is half-Thai, took charge of planning our itinerary in Bangkok.\n\nI tried my best to lose weight before the trip, but unfortunately I completely failed in this endeavour so I boarded the plane feeling heavy.\n","trip":"Thailand 2024","place":"Thailand","timezone":"Asia/Bangkok","location":"Thailand","title":"Thailand 2024","description":"Girl's trip to Thailand, visiting Chieng Rai, Chieng Mai and Bangkok. We have been planning this ever since the COVID-19 pandemic lockdown so it has taken almost 2 years to fruition!","date":"2024-11-26T11:00:00.000Z","image":{"src":"/thailand-2024/_astro/trip.CgyoIZQu.jpeg","width":4485,"height":2990,"format":"jpg","fsPath":"/Users/christie/Repositories/thailand-2024/src/assets/trip.jpeg"},"tags":["Thailand","Bangkok","Chieng Mai","Chieng Rai"]},{"id":"day-01-flight.md","slug":"day-01-flight","base":"/thailand-2024/","collection":"post","body":"\n## Checkin\n\nMargaret and I took at taxi at 6:30am and arrived at Sydney Airport International Terminal. Fortunately, at this hour of the day, with nearly 3 hours before our flight, the queue at the checkin counter was quite short, plus we had already checked in online the day before so we just needed to drop our bags. The girl behind the counter was Indonesian and she was very helpful and checked our luggage all the way to Chieng Mai. She also assisted us with boarding the lane.\n\n## AMEX Lounge\n\nAfter checkin, we headed to the AMEX Lounge. Unfortunately this was located on the opposite end of the airport relative to our boarding gate, so it's a bit of a walk to the lounge. Luckily Margaret had two spare lounge passes with her AMEX Card so we were able to enjoy the facilities of the lounge. I had my usual breakfast of bacon, scrambled eggs, sausages, baked beans, potatoes and toast plus a cup of coffee.\n\n![AMEX Lounge](../../assets/day-01-flight/01_AMEX_Lounge.jpg)\n\n![AMEX Lounge](../../assets/day-01-flight/02_AMEX_Lounge.jpg)\n\n![AMEX Lounge](../../assets/day-01-flight/03_AMEX_Lounge.jpg)\n\nWhen it was to boarding we headed towards the gate. Along the way, I saw a Gentle Monster shop at the airport. I saw a similar shop at TRX in Kuala Lumpur recently so I knew they were famous for their gigantic sculptures. I posed in front a giant rotating face and Margaret took a photo just when the face was looking at me.\n\n![Gentle Monster](../../assets/day-01-flight/05_Gentle_Monster.jpg)\n\n## Boarding flight to Bangkok\n\nWe all met together as a group at the boarding gate for Thai Airways flight TG 476 to Bangkok. We were lucky in that some of us were in Group 2 boarding, which is the first group to board after the premium passengers, so we entered the plane early and had plenty of cabin luggage space to put our bags.\n\n![Plane](../../assets/day-01-flight/04_Plane.jpg)\n\n![Group](../../assets/day-01-flight/06_Group.jpg)\n\n![Plane](../../assets/day-01-flight/07_Plane.jpg)\n\nThe flight was uneventful and quite pleasant. I was pleasantly surprised that I received all my meals first as I had preordered the \"oriental vegetarian\" option for my meals. I watched two movies:\n\n- [Lovesick Ellie](https://www.dailymotion.com/video/x95s79u): Eriko Ichimura (Nanoka Hara) has an ordinary and unnoticed student life at her high school. Her only joy is to watch popular male student Akira Omi (Nanoka Hara) and imagine them being a couple. She writes down those thoughts on her social media account under the name of Lovesick Ellie. Akira Omi seems like a perfect guy, with good looks and gentle personality. One day, she witnesses Akira Omi spouting vulgar language and she realizes he is kind of like a two-faced person. Making things worse, her fantasy thoughts are discovered by him. He thinks that she is funny and he approaches her. [(AsianWiki)](https://asianwiki.com/Lovesick_Ellie)\n- [Indiana Jones and the Dial of Destiny](https://www.imdb.com/title/tt28194558/): The legendary hero, Indiana Jones, returns in the fifth installment of this beloved swashbuckling series of films. Finding himself in a new era, approaching retirement, Indy wrestles with fitting into a world that seems to have outgrown him. But as the tentacles of an all-too-familiar evil return in the form of an old rival, Indy must don his hat and pick up his whip once more to make sure an ancient and powerful artifact doesn't fall into the wrong hands.\n\n## Bangkok stopover\n\nWe arrived in Suvarnabhumi Airport, Bangkok, in the afternoon and cleared customs. Since we had around three hours before the next flight to Chieng Mai, we wandered around the transit area and decided to have an early dinner at Thai Street Food. I had the tom yum noodle for 231 baht (around A$11) - it was delicious and surprisingly quite filling. The others had Thai chicken rice and BBQ Portk and wantan dry noodles.\n\n![Group](../../assets/day-01-flight/11_Group.jpg)\n\n![Tom yum noodle](../../assets/day-01-flight/12_Tom_yum_noodle.jpg)\n\n![Thai chicken rice](../../assets/day-01-flight/13_Chicken_rice.jpg)\n\n![BBQ pork wantan noodle](../../assets/day-01-flight/14_BBQ_pork_wantan_noodle.jpg)\n\n## Flight to Chieng Mai\n\nWe boarded TG 120 which departed just after 7pm and arrived about one hour later to Chieng Mai. We had no problems disembarking and claiming our baggage. The airport had quite a few lanterns and sculptures celebrating the upcoming festival.\n\n![Chieng Mai airport](../../assets/day-01-flight/21_Chiengmai.jpg)\n\n![Chieng Mai airport](../../assets/day-01-flight/22_Chiengmai.jpg)\n\nWe arrived at the AirBNB accommodation. I must admit, I was really tired (it is well over midnight Sydney time) and I quickly unpacked, showered and crashed out so no pictures.\n","trip":"Thailand 2024","place":"Thailand","timezone":"Asia/Bangkok","location":"Chiang Mai","title":"Day 1: Flight to Chiang Mai","description":"We had a pleasant checkin experience, had breakfast at the AMEX lounge, before boarding a flight to Bangkok. We stopped for 3 hours in Bangkok which was enough time, before boarding a flight to Chieng Mai. We arrived safely and checked into an AirBNB house for our stay here.","date":"2024-11-12T00:21:00.000Z","image":{"src":"/thailand-2024/_astro/07_Plane.FYd5leeN.jpg","width":2560,"height":1707,"format":"jpg","fsPath":"/Users/christie/Repositories/thailand-2024/src/assets/day-01-flight/07_Plane.jpg"},"map":[18.803261,98.970924,17],"tags":["Sydney Airport","AMEX Lounge","breakfast","Bangkok","dinner","Chieng Mai"]},{"id":"day-02-1-maya.md","slug":"day-02-1-maya","base":"/thailand-2024/","collection":"post","body":"\nCat and I both woke up early, around 5AM local time (since that corresponded to 9AM Sydney time), so we decided to explore the neighbourhood.\n\nWe sneaked out of the house around 7AM and walked out of the quite residential street of Soi Muban Lanna Villa onto the main road (Interestingly named the Super Highway!). Just before entering the main road, we stopped by to take photos of interesting cabling along the poles:\n\n![Cables](../../assets/day-02-maya/01_Cables.jpg)\n\n![Chris](../../assets/day-02-maya/02_Cables.jpg)\n\nAcross the Super Highway is [Maya Lifestyle Shopping Center](https://mayashoppingcenter.com). This is a big mall with cinemas, concept stores, supermarket, and many dining options, but it was not yet open:\n\n![Maya](../../assets/day-02-maya/19_Maya_Mall.jpg)\n\n![Maya](../../assets/day-02-maya/05_Maya_Mall.jpg)\n\n![Intersection](../../assets/day-02-maya/07_Intersection.jpg)\n\n\nNext to the mall is an interesting elephant shrine. In Thailand, the elephant is considered a sacred animal and is closely associated with Buddhism, the predominant religion in the country. The white elephant, in particular, is seen as a symbol of purity and spiritual power. It is believed to be a harbinger of good fortune and prosperity. The image of the elephant can be found in many temples and shrines across Thailand, where they are worshipped and offered food and water as a sign of respect.\n\n![Elephant Shrine](../../assets/day-02-maya/03_Elephant_Shrine.jpg)\n\n![Elephant Shrine](../../assets/day-02-maya/04_Elephant_Shrine.jpg)\n\n![Elephant Shrine](../../assets/day-02-maya/06_Elephant_Shrine.jpg)\n\n![Chris](../../assets/day-02-maya/10_Elephant_Shrine.jpg)\n\nAlso nearby is a shrine full of roosters. The rooster holds a significant place in Thai culture, representing courage, strength, and vigilance. In Buddhism, the rooster symbolizes the dawn, heralding the arrival of a new day and the dispelling of darkness. It is believed making offerings to roosters will bring prosperity and business success.\n\n![Rooster shrine](../../assets/day-02-maya/08_Rooster_Shrine.jpg)\n\n![Rooster shrine](../../assets/day-02-maya/09_Rooster_Shrine.jpg)\n\nOpposite Maya on Huay Kaew Rd is trendy Think Park, which is a shopping and cafe space.\n\n![Think Park](../../assets/day-02-maya/20_Think_Park.jpg)\n\n![Think Park](../../assets/day-02-maya/11_Think_Park.jpg)\n\nWe then walked west along Huay Kaew Rd and passed this golden arch:\n\n![Arch](../../assets/day-02-maya/12_Arch.jpg)\n\nBeyond this is a trendy cafe called [Tiger TED Cafe](https://www.facebook.com/profile.php/?id=100055000754567). We explored here and Cat ordered a juice drink.\n\n![alt text](../../assets/day-02-maya/15_Tiger_TED_Cafe.jpg)\n\n![Sleeping Cat](../../assets/day-02-maya/16_Sleeping_Cat.jpg)\n\nAfter the cafe is the Kat Rin Kam night market and food centre.\n\n![Kat Rin Kham](../../assets/day-02-maya/13_Kat_Rin_Kham.jpg)\n\n![Food Centre](../../assets/day-02-maya/17_Food_Center.jpg)\n\nWandering back to the house via Soi Muban Lanna Villa Rd, we stopped by at Furama Hotel, a local landmark and owned by relatives of one of Cat's  friends.\n\n![Neighbourhood](../../assets/day-02-maya/21_Soi_Muban_Lanna_Villa.jpg)\n\n![Furama Hotel](../../assets/day-02-maya/22_Furama_Hotel.jpg)\n\n![Furama Hotel](../../assets/day-02-maya/23_Furama_Hotel.jpg)\n\n![Furama Hotel](../../assets/day-02-maya/24_Furama_Hotel.jpg)","trip":"Thailand 2024","place":"Thailand","timezone":"Asia/Bangkok","location":"Maya Lifestyle Shopping Centre","title":"Day 2: Early morning walk around Maya Mall","description":"Woke up early, and decided to explore our neighbourhood by walking to Maya Lifestyle Shopping Centre.","date":"2024-11-13T00:00:00.000Z","image":{"src":"/thailand-2024/_astro/05_Maya_Mall.BFSCa_83.jpg","width":2560,"height":1707,"format":"jpg","fsPath":"/Users/christie/Repositories/thailand-2024/src/assets/day-02-maya/05_Maya_Mall.jpg"},"map":[18.802458,98.967267,17],"tags":["Chiang Mai","MAYA","Think Park","Huay Kaew Rd","morning","walk","elephant","shrine","rooster","Furama Hotel","Kat Rin Kam","Tiger TED Cafe"]},{"id":"day-02-2-charoen-prathet-rd.md","slug":"day-02-2-charoen-prathet-rd","base":"/thailand-2024/","collection":"post","body":"\nWhen we returned from our walk, we waited until the other ladies woke up, and then we had breakfast, dressed and went out to visit [S.K. Sakol Money Exchange](https://www.chiangmailocator.com/chiang-mai-banks-currency-exchange-offices-1664:sk-sakol-money-exchange), a foreign currency exchange office located on Charoen Prathet Rd.\n\nWe were planning to hire a Grab car to take us there, but we found a Songthaew driver right outside Furama Hotel. He was much cheaper. A songthaew (สองแถว, lit. 'two rows') is a passenger vehicle in Thailand adapted from a pick-up or a larger truck and used as a share taxi or bus. Songthaew rides in Chiang Mai are priced at 30 baht per person per ride (around A$1.50).\n\n![Songtghaew](../../assets/day-02-charoen-prathet-rd/04_Songthaew.jpg)\n\n![Songthaew](../../assets/day-02-charoen-prathet-rd/01_Songthaew.jpg)\n\n![Songthaew](../../assets/day-02-charoen-prathet-rd/02_Songthaew.jpg)\n\nWe were not aware that we arrived at our destination when the driver stopped (we thought he was just waiting at the traffic lights). The driver got off the car, went to the back, and gave us a \"Why aren't you getting off?\" shrug.\n\nLyn had already exchanged my money into Thai baht before I left Australia, so I did not need to visit the money exchange office, so I took the opportunity to wander along the street.\n\nCharoen Prathet Road (ถนนเจริญประเทศ) in Chiang Mai is a well-known street that runs along the eastern side of the Ping River, just outside the Old City walls. This road is a vibrant area that blends Chiang Mai's rich history with modern-day attractions. Many old colonial-style buildings and traditional teakwood houses can still be found along the road, reflecting its historical charm. I found a combination of massage parlours, hotels and old teak mansions.\n\n![Teak House](../../assets/day-02-charoen-prathet-rd/05_Teak_House.jpg)\n\n![Crystal Club](../../assets/day-02-charoen-prathet-rd/06_Crystal_Club.jpg)\n\n![Old Teak Mansion](../../assets/day-02-charoen-prathet-rd/07_Old_Teak_Mansion.jpg)\n\n![Teak House](../../assets/day-02-charoen-prathet-rd/08_Teak_House.jpg)\n\n![Scooters](../../assets/day-02-charoen-prathet-rd/09_Scooters.jpg)\n\nWhen the ladies have concluded their money changing transactions, we were ready to head to [Central Festival](https://www.central.co.th/en/store/central-festival-chiangmai) for food and shopping!\n","trip":"Thailand 2024","place":"Thailand","timezone":"Asia/Bangkok","location":"Charoen Prathet Rd","title":"Day 2: Charoen Prathet Rd","description":"After returning from our morning walk, we went to a foreign money exchange office in Charoen Prathet Rd to convert Australian dollars into Thai baht.","date":"2024-11-13T04:00:00.000Z","image":{"src":"/thailand-2024/_astro/03_Tuk_Tuk.B0pDyh2N.jpg","width":2560,"height":2560,"format":"jpg","fsPath":"/Users/christie/Repositories/thailand-2024/src/assets/day-02-charoen-prathet-rd/03_Tuk_Tuk.jpg"},"map":[18.784107,99.00313,17],"tags":["Chiang Mai","Charoen Prathet Rd","SK Sakol","teak mansions","songthaew"]},{"id":"day-02-3-central-festival.md","slug":"day-02-3-central-festival","base":"/thailand-2024/","collection":"post","body":"\nWe used the same songthaew driver to take us from Charoen Prathet Rd to [Central Festival](https://www.central.co.th/en/store/central-festival-chiangmai). Actually, he was willing to wait for us for 100 baht so it was a bonus. He was amused once again that we werent aware when we arrived at the destination, and gave us the shrug again. He then gave another gesture after we aligted to let us know we were walking in the wrong direction!\n\nCentral Festival Chiangmai is the largest, most comprehensive, and most modern shopping complex in Northern Thailand, covering an area of 70 rai. It is located on the Superhighway and Chiangmai-Doi Saket Road.\n\n![Central Festival](../../assets/day-02-central-festival/01_Central_Festival.jpg)\n\nWe are hungry by now, so we stopped by at the food hall to search for lunch.\n\n![Food Hall](../../assets/day-02-central-festival/02_Food_Hall.jpg)\n\nThere's a large variety of dishes here, made fresh.\n\n![Dessert](../../assets/day-02-central-festival/03_Making_Dessert.jpg)\n\n![Dessert](../../assets/day-02-central-festival/04_Making_Dessert.jpg)\n\n![Dessert](../../assets/day-02-central-festival/05_Making_Dessert.jpg)\n\n![Snacks](../../assets/day-02-central-festival/06_Thai_Snacks.jpg)\n\n![Dessert](../../assets/day-02-central-festival/07_Thai_Desserts.jpg)\n\nWe had a selection of dishes for lunch. My favourite was the stir fired squid eggs.\n\n![Crab Cakes](../../assets/day-02-central-festival/08_Crab_Cakes.jpg)\n\n![Thai Popiah](../../assets/day-02-central-festival/09_Thai_Popiah.jpg)\n\n![Fried Dumplings](../../assets/day-02-central-festival/10_Fried_Dumplings.jpg)\n\n![Squid Eggs](../../assets/day-02-central-festival/11_Squid_Eggs.jpg)\n\n![Sour Mango](../../assets/day-02-central-festival/12_Sour_Mango.jpg)\n\nAfter lunch we went shopping. There are some interesting sculptures located within the mall:\n\n![Flower Sculpture](../../assets/day-02-central-festival/13_Flower_Sculpture.jpg)\n\n![Circle Sculpture](../../assets/day-02-central-festival/17_Circle_Sculpture.jpg)\n\n![Cone Sculpture](../../assets/day-02-central-festival/18_Cone_Sculpture.jpg)\n\nI posed an Under Armour store as one of the classes I teach at university is doing a case study assessment on it.\n\n![Under Armour](../../assets/day-02-central-festival/14_Under_Armour.jpg)\n\nThere's a Hello Kitty section in the Central department store!\n\n![Hello Kitty](../../assets/day-02-central-festival/16_Hello_Kitty.jpg)\n\nI bought thie very pretty dress by Lolita in Central. I can't belie ve it costs 590 baht (around A$25).\n\n![Dress](../../assets/day-02-central-festival/15_Dress.jpg)\n\nAfter Central Festival, we headed to Warorot Market via songthaew to find some traditional Thai costumes to wear for the Loy Krathong Festival. Warorot Market (Thai: ตลาดวโรรส), locally known as Kad Luang (กาดหลวง; lit: \"Big Market\") is a market and one of tourist attractions in Chiang Mai Province, regarded as the largest and most well-known market in the north region of Thailand.\n\n![Warorot Market](../../assets/day-02-central-festival/19_Warorot_Market.jpg)\n\nHere, everyone managed to find something to buy, and we also had some delicious soda drinks. By 4pm hwoever, we were pretty exhausted and caught our final songthaew for the day to head back to the AirBNB house. The route back seemed to take forever and I can only assume it was peak hour on the main roads. The cost was still the same though (30 baht per person).\n","trip":"Thailand 2024","place":"Thailand","timezone":"Asia/Bangkok","location":"Central Festival","title":"Day 2: Cenrtral Festival and Warorot Market","description":"We had lunch and did some shopping at Central Festival, and then headed to Warorot Market to buy some traditional Thai costumes for the Loy Krathong Festival.","date":"2024-11-13T09:00:00.000Z","image":{"src":"/thailand-2024/_astro/01_Central_Festival.ijhX3eyh.jpg","width":2560,"height":1707,"format":"jpg","fsPath":"/Users/christie/Repositories/thailand-2024/src/assets/day-02-central-festival/01_Central_Festival.jpg"},"map":[18.807405,99.018214,17],"tags":["Chiang Mai","Central Festival","Warorot Market","Under Armour","Hello Kitty","lunch","food"]},{"id":"day-02-4-chefs-together.md","slug":"day-02-4-chefs-together","base":"/thailand-2024/","collection":"post","body":"\nOne of Cat's high school friend has retired in Chiang Mai and decided to take us our for dinner. He and his wife and her friends met us at the AirBNB house and offered us a platter of Thai desserts:\n\n![Pre dinner](../../assets/day-02-dinner/02_Pre_dinner.jpg)\n\n![dessert platter](../../assets/day-02-dinner/01_Dessert_platter.jpg)\n\nWe went to [Chef's Together by Aod & Dan](https://www.facebook.com/chefstogehter/) via two cars. It is located at Charoen Prathet Rd beside the Ping River (actually I saw it this morning whilst walking along this road).\n\n![Chefs Together](../../assets/day-02-dinner/27_Chefs_Together.jpg)\n\n![Dinner](../../assets/day-02-dinner/13_Dinner.jpg)\n\n![Cocktail](../../assets/day-02-dinner/05_Cocktail.jpg)\n\nIt is a trendy place with an international menu but we ordered some northern Thai dishes which were amazing. Unfortunately I have forgotten the names of the dishes, but I loved the coconutless curry and the deep fried prawn heads.\n\n![Yum](../../assets/day-02-dinner/06_Yum.jpg)\n\n![Curry](../../assets/day-02-dinner/07_Curry.jpg)\n\n![Platter](../../assets/day-02-dinner/08_Platter.jpg)\n\n![Larb](../../assets/day-02-dinner/09_Larb.jpg)\n\n![Sticky rice](../../assets/day-02-dinner/10_Sticky_Rice.jpg)\n\n![Pork](../../assets/day-02-dinner/11_Pork.jpg)\n\n![Khao Soi](../../assets/day-02-dinner/12_Khao_Soi.jpg)\n\n![Prawn heads](../../assets/day-02-dinner/14_Prawn_heads.jpg)\n\nBecause it is the Loy Krathong festival, there were fireworks by the river, and also several musical performances.\n\n![Fireworks](../../assets/day-02-dinner/03_Fireworks.jpg)\n\n![Band](../../assets/day-02-dinner/04_Band.jpg)\n\n![Band](../../assets/day-02-dinner/26_Band.jpg)\n\nAfter dinner, we walked along the riverbank, and crossed the Iron Bridge. We saw some festivalgoers lighting water lanterns and launching them by the riverside.\n\n![By the Bridfge](../../assets/day-02-dinner/15_By_the_Bridge.jpg)\n\n![Chefs Together](../../assets/day-02-dinner/16_Chefs_Together.jpg)\n\n![Chefs Together](../../assets/day-02-dinner/18_Chefs_Together.jpg)\n\n![Chefs Together](../../assets/day-02-dinner/20_Chefs_Together.jpg)\n\n![Bridge](../../assets/day-02-dinner/17_Bridge.jpg)\n\n![Launching Lanterns](../../assets/day-02-dinner/22_Launching_Lanterns.jpg)\n\n![Launching Lanterns](../../assets/day-02-dinner/21_Launching_Lanterns.jpg)\n\n![Ping River](../../assets/day-02-dinner/23_Ping_River.jpg)\n\n![Ping River](../../assets/day-02-dinner/25_Ping_River.jpg)\n\n![Bridge](../../assets/day-02-dinner/24_Bridge.jpg)\n\nOn the way back, we drove past Tha Pae St which were lit up using many light arches for the festival.\n\n![Tha Pae St lights](../../assets/day-02-dinner/28_Tha_Pae_St_lights.jpg)","trip":"Thailand 2024","place":"Thailand","timezone":"Asia/Bangkok","location":"Chefs Together","title":"Day 2: Dinner at Chefs Together","description":"Fabulous dinner at a trendy restaurant by the Ping River called Chefs Together.","date":"2024-11-13T14:00:00.000Z","image":{"src":"/thailand-2024/_astro/01_Central_Festival.ijhX3eyh.jpg","width":2560,"height":1707,"format":"jpg","fsPath":"/Users/christie/Repositories/thailand-2024/src/assets/day-02-central-festival/01_Central_Festival.jpg"},"map":[18.783903832802014,99.00349669554622,17],"tags":["Chiang Mai","Central Festival","Warorot Market"]}]