[{"id":"thailand-2024-2","slug":"index.html","base":"/thailand-2024-2/","collection":"trip","body":"Ever since the COVID-19 pandemic lockdown, a group of us have been dreaming that we will take an overseas trip together once international travel restrictions have been lifted and we enter the brave new world of post-COVID vacations. Our dream is finally realised in 2024 when we are able to plan a trip to Bangkok. We literally spent many days talking about where we would go and what activities we would participate in.\n\nWe quickly agreed some ground rules - we would focus on food, sightseeing and shopping (not necessarily in that order, but that would be my personal priorities). The opportunity came when we realised plane tickets to Bangkok were quite reasonable (not quite pre-COVID sale prices but okay) and we all quickly booked our flights. We then scoured around for properties to rent so that we can stay together as a group.\n\nWe decided initially to just visit Chiang Mai and Bangkok, but then we realised there were a lot of things to see in Chiang Rai and it would be rushed to do it as a day trip. We hired a private tour driver who planned an itinerary for us. Cat, who is half-Thai, took charge of planning our itinerary in Bangkok.\n\nThis trip is so massive for the sake of optimising storage I have broken the trip to two parts. In Part 1, we fly from Sydney and arrive in Chiang Mai via Bangkok. We spent about a week in both Chiang Mai and Chiang Rai, visiting a variety of locations and sampling food from many places.\n\nIn Part 2 the adventure continues in Bangkok as we fly from Chiang Mai to Bangkok and spent a week there including a side trip to Amphawa.","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Thailand","title":"Thailand 2024 Part 2","description":"Part 2 of a long planned and awaited Girl's trip to Thailand, where we conclude the trip by spending 7 days in Bangkok.","date":"2024-11-26T11:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/trip.MGFqZ6Lt.jpeg","width":2560,"height":1707,"format":"jpg"},"tags":["Thailand","Bangkok"]},{"id":"day-08-1-flight","slug":"day-08-1-flight","base":"/thailand-2024-2/","collection":"post","body":"We checked out of the house we were staying, and took a van to Chiang Mai airport. We boarded the flight at around 12pm and landed early, around 1:30pm to [Suvarnabhumi Airport](https://www.bangkokairportonline.com) (ท่าอากาศยานสุวรรณภูมิ).\n\nWe had prebooked an airport transfer van through the AirBNB property we are staying in Bangkok so we didn't wait very long at the airport. The trip to the apartment at Mahatun took a lot faster that we anticipated because traffic was quite light at that time.","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Suvarnabhumi Airport","title":"Day 8: Flight from Chiang Mai to Bangkok","description":"We bade goodbye and boarded Thai Airways TG105 from Chiang Mai to Bangkok.","date":"2024-11-19T07:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/06_Group.CE_gnYs8.webp","width":2560,"height":1707,"format":"webp"},"map":[13.682831776210376,100.74692364703516,17],"tags":["Bangkok","Suvarnabhumi","airport","flight"]},{"id":"day-08-2-mahatun","slug":"day-08-2-mahatun","base":"/thailand-2024-2/","collection":"post","body":"The apartment we are staying is located at Mahatun Plaza, very close to the BTS Ploenchit station and within walking distance to quite a few shopping centres.\n\nEven though I had lunch on the plane, we opted for another lunch at Madam Somtum - [Facebook Page](https://www.facebook.com/madamsomtum/). This is an Esan restaurant serving different varieties of somtum along with other Thai dishes, and apparently owned by the same owner as the apartment we are staying in.\n\nThe restaurant has an interesting decor, and the salted egg somtum we ordered was really nice!","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Madam Somtum","title":"Day 8: Lunch at Madam Somtum at Mahatun","description":"We are staying at Mahatun Plaza near Ploenchit BTS Station, and had a late lunch at Madam Somtum.","date":"2024-11-19T08:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/04_Madame_Somtum.C2IawohY.webp","width":2560,"height":1707,"format":"webp"},"map":[13.742629090467684,100.54927202512506,17],"tags":["Bangkok","Mahatun Plaza","Madam Somtum","lunch","food"]},{"id":"day-08-3-apartment","slug":"day-08-3-apartment","base":"/thailand-2024-2/","collection":"post","body":"We stayed an AirBNB apartment called [Prani Ploenchit](https://www.airbnb.com.au/rooms/843913711884697422). It's quite small (compared to the house we had in Chiang Mai) but quite well appointed with 2 bedrooms, 2 toilets and a living room/kitchen.","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Prani Ploenchit","title":"Day 8: Our Apartment at Khet Pathum Wan","description":"Photos from the apartment we stayed in Bangkok.","date":"2024-11-19T09:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/03_Living_Room.BNSePIPx.webp","width":2560,"height":1707,"format":"webp"},"map":[13.742629090467684,100.54927202512506,17],"tags":["Bangkok","Mahatun Plaza","Prani Ploenchit","accommodation"]},{"id":"day-09-2-icon-siam","slug":"day-09-2-icon-siam","base":"/thailand-2024-2/","collection":"post","body":"In the afternoon we took a taxi to [Icon Siam ไอคอนสยาม](https://www.iconsiam.com/th). The intention is to explore [Sook Siam](http://www.sooksiam.com) - the amazing recreation of a floating market in the ground floor of the massive shopping centre.\n\nThe taxi took a long time to get to Icon Siam, mainly because the traffic was so heavy.\n\nThe amount of stalls selling food and other products here is truly amazing - I have never seen such a bewildering array of different food available under one roof before. And the recreationg of a floating market is quite cute, complete with elephant and shrine.\n\nThis video gives a good idea of Sook Siam and how massive it is:\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/rTjNeyKjCfU?si=RRG88cMH2IIrA6qH\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n\nAfter that, we left Icon Siam and walked along the river promenade to catch a river boat to Asiatique.\n\nCITY TOUR DETAILS:\n\nconfirmed private city tour as below ;\nDriver : Boarding Pass Team / Mr.Pom\nTel : 0804359772\nPlate No. : 3099\nBy : Toyota Innova\nDate : 21/11/2024\nTemple & City tour by private car & tour guide half day\n\n- Grand Palace & emerald Buddha\n- Wat Pho ( Reclining Buddha)\n- Wat Arun ( Temple of Down)\n- Boat trip along the Klong (45-50 mins)\n  Pick up 2 point\n  Pick up time : 08.00 am\n  From : Kimpton Maa-Laai Bangkok\n  Name : Belinda Ward\n  after Mahatun Plaza meeting infront of Siam Pharmacy\n  Name : Margaret Stow & Chris Tham\n  Total ; 3 person\n\nTour Guide : Chuchai\nTel. : 0981571967\n\n\\*\\*start 08.00am ending tour 14.00 pm","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Icon Siam","title":"Day 9: Icon Siam","description":"In the afternoon we took a taxi to Icon Siam to explore the amazing recreation of a floating market on the ground floor.","date":"2024-11-20T10:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/28_Icon_Siam.B1JPzH7R.webp","width":2560,"height":1707,"format":"webp"},"map":[13.726731524508908,100.50996845396077,17],"tags":["Bangkok","Icon Siam","Sook Siam","floating market","river cruise"]},{"id":"day-08-4-yaowarat","slug":"day-08-4-yaowarat","base":"/thailand-2024-2/","collection":"post","body":"Yaowarat Rd is the main artery of Bangkok's Chinatown, and every night it is full of food stalls. We saw many interesting stalls selling anything from giant oysters to sculptured 3D ice cream to all kinds of food, even shark fins and bird nests.\n\nWe couldn't help but stop at the famous Plaeng Nam Shark Fin-Bird’s Nest（義福巷燕窩). I was not game enough to try the shark fin soup, but I had the crab fried rice and tasted the fish maw soup.\n\nAfter that we also tried the famous wanton mee at the junction of Yaowarat Road and Yaowa Phanit called Mung Korn Khao Noodle.\n\nAfter that, we walked around Yaowarat Rd and stopped by a Thai dessert stall to have coconut ice cream desserts. All in all it was a very interesting night, and I really wished I could have eaten more.\n\nHere is a good video that gives an idea of what the experience of walking around Yaowarat Rd is like:\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/hlO2v6lerkk?si=-_BJSZAesC7nszgK\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Yaowarat Rd","title":"Day 8: Dinner at Yaowarat (Chinatown)","description":"We ventured to famous Yaowarat Rd via BTS and the metro to search for food.","date":"2024-11-19T13:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/02_MRT_station.CgQ9SCdH.webp","width":2560,"height":1707,"format":"webp"},"map":[13.740539816019728,100.50958079393155,17],"tags":["Bangkok","Yaowarat","Chinatown","food","dinner"]},{"id":"day-09-3-calypso","slug":"day-09-3-calypso","base":"/thailand-2024-2/","collection":"post","body":"We alighted from the river boat and arrived at [Asiatique เอเชียทีค เดอะ ริเวอร์ฟรอนท์](https://www.asiatiquethailand.com), the Riverfront, a large open-air mall in Bangkom facing the Chao Phraya River and Charoen Krung Road at the former docks of the East Asiatic Company. Here there are many stores selling clothes, food stalls and restaurants.\n\nWe came here to watch the [Calypso Cabaret คาลิปโซ่ คาบาเร่ต์](https://calypsocabaret.com). Our ticket includes not just the cabaret performance, but also a meal and a traditional Thai Classical Dance performance.\n\nI was surprised that the dinner was quite tasty and filling, and the Thai Classical performance was a variety of numbers similar to the Khum Khantoke event we attended in Chiang Mai.\n\nThe show itself was fabulous, the production was very professionals, the dancers are very good, and the numbers range from amazing to funny. Here are two performances that I recorded:\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/G30Gp4hB7Zc?si=mDMa6EySBeq1JjWh\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/r51d6jyq8_U?si=TpL8NOOcaT0p1rDU\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Icon Siam","title":"Day 9: Calypso Cabaret","description":"Calypso Cabaret is a ladyboy show that has been operating since 1988.","date":"2024-11-20T14:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/04_Chris.BKmmrXtI.webp","width":2560,"height":1706,"format":"webp"},"map":[13.704208490794827,100.50371637715375,17],"tags":["Bangkok","Asiatique","Calypso Cabaret","performance","dinner"]},{"id":"day-10-1-wat-pho","slug":"day-10-1-wat-pho","base":"/thailand-2024-2/","collection":"post","body":"Our guide picked us up at 8:00AM and his name is Chuchai but he told us to call him \"Bird\". The temple and city half day tour includes the following:\n\n- Grand Palace & Emerald Buddha\n- Wat Pho (Reclining Buddha)\n- Wat Arun (Temple of Dawn)\n- Boat trip along the Klong (45-50 mins)\n\nThe first stop is Wat Pho.\n\nWat Pho is one of Bangkok's oldest temples. It existed before Bangkok was established as the capital by King Rama I. Our guide explained that King Rama I (Phra Bat Somdet Phra Phutthayotfa Chulalok Maharat พระบาทสมเด็จพระพุทธยอดฟ้าจุฬาโลกมหาราช) was the founder of the Rattanakosin Kingdom (now Thailand) and the first King of Siam from the reigning Chakri dynasty. He ascended the throne in 1782, following the deposition of King Taksin of Thonburi, who united Siam following the collapse of the Ayutthaya Kingdom but became mad in his later years (or so they say, perhaps they just wanted to get rid of him).\n\nKing Rama I decided to move the capital of Thailand from Thonburi to Bangkok, and decided to build the Grand Palace beside Wat Pho. He also decided to renovate Wat Pho. Originally, the temple site was named Wat Photaram or Podharam and it was renamed to Phra Chetuphon Vimolmangklavas. The temple complex continued to undergo changes over the next 200 years and was renamed Wat Phra Chetuphon Vimolmangklararm by King Rama IV.\n\nIt is home to more than one thousand Buddha images, as well as one of the largest single Buddha images at 46 metres (151 ft) in length. The Wat Pho complex consists of two walled compounds bisected by Chetuphon Road running in the east–west direction. The larger northern walled compound, the phutthawat, is open to visitors and contains the finest buildings dedicated to the Buddha, including the bot with its four directional viharn, and the temple housing the reclining Buddha. The southern compound, the sankhawat, contains the residential quarters of the monks and a school. The temple grounds contain four great chedis, 91 small chedis, two belfries, a bot (central shrine), a number of viharas (halls) and various buildings such as pavilions, as well as gardens and a small temple museum.\n\n![Group](../gallery/day-10-wat-pho/02_Group.webp)\n\nA number of large Chinese statues, some of which depict Europeans, are also found in the complex guarding the gates of the perimeter walls as well as other gates in the compound. These stone statues were originally imported as ballast on ships trading with China. One of these is apparently Marco Polo.\n\n![The group with Chinese guardians at the gate](../gallery/day-10-wat-pho/09_Group.webp)\n\nPhra Ubosot (Phra Uposatha) or bot is the ordination hall, the main hall used for performing Buddhist rituals, and the most sacred building of the complex. Inside the ubosot is a gold and crystal three-tiered pedestal topped with a gilded Buddha made of a gold-copper alloy, and over the statue is a nine-tiered umbrella representing the authority of Thailand. The Buddha image, known as Phra Buddha Theva Patimakorn, is thought to be from the Ayutthaya period.\n\n![Phra Buddha Theva Patimakorn](../gallery/day-10-wat-pho/24_Phra_Buddha_Theva_Patimakorn.webp)\n\nPhra Rabiang is a double cloister contains around 400 images of Buddha from northern Thailand selected out of the 1,200 originally brought by King Rama I.\n\n![Buddhas](../gallery/day-10-wat-pho/18_Buddhas.webp)\n\nThere are four towers, or phra prang, at each corner of the courtyard around the bot.\n\n![Phra Prang](../gallery/day-10-wat-pho/21_Phra_Prang.webp)\n\nPhra Maha Chedi Si Rajakarn is a group of four large stupas, each 42 metres high. These four chedis are dedicated to the first four Chakri kings. The first, in green mosaic tiles, was constructed by Rama I to house the remnants of the great Buddha from Ayuthaya, which was scorched to remove its gold covering by the Burmese.\n\n![Phra Maha Chedi Si Rajakarn](../gallery/day-10-wat-pho/13_Phra_Maha_Chedi_Si_Rajakarn.webp)\n\nOutside the Phra Rabiang cloisters are dotted many smaller chedis, called Phra Chedi Rai. They contain ashes of the royal family and also relics of the Buddha.\n\n![Phra Chedi Rai](../gallery/day-10-wat-pho/10_Phra_Chedi_Rai.webp)\n\nThe wat and the reclining Buddha (Phra Buddhasaiyas, Thai: พระพุทธไสยาสน์) were built by Rama III in 1832. The image of the reclining Buddha represents the entry of Buddha into Nirvana and the end of all reincarnations. The posture of the image is referred to as sihasaiyas, the posture of a sleeping or reclining lion. The figure is 15 m high and 46 m long, and it is one of the largest Buddha statues in Thailand.\n\n![Phra Buddhasaiyas](../gallery/day-10-wat-pho/38_Phra_Buddhasaiyas.webp)","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Wat Pho","title":"Day 10: Bangkok City Tour - Wat Pho","description":"Belinda, Margaret and I opted to take a private city tour of Bangkok organised by BoardingPass. First stop is Wat Pho","date":"2024-11-21T02:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/33_Phra_Buddhasaiyas.QsEb-8PJ.webp","width":2560,"height":1707,"format":"webp"},"map":[13.746594919676753,100.49250167639512,17],"tags":["Bangkok","tour","Wat Pho","temple"]},{"id":"day-09-1-bangkok","slug":"day-09-1-bangkok","base":"/thailand-2024-2/","collection":"post","body":"In the morning we bought tickets for the Calypso cabaret show and the day tour tomorrow from a travel agency called [Boarding Pass](https://www.boardingpass.co.th/main/index.php?action=home&lang=en) located near the Ambassador Hotel on Soi Sukhumvit 11, Klongtoey Nua, Wattana.\n\nAlong Soi Sukhumvit 11, I passed through more examples of cable art:\n\n![cable art](../gallery/day-09-bangkok/03_cables.webp)\n\n![cable art](../gallery/day-09-bangkok/04_cables.webp)\n\nAfter that we headed to [Siam Paragon](https://www.siamparagon.co.th). Cat's friend Nuch owns a jewellery shop here called XAVIER BY UTHAI JEWELRY - [Facebook Page](https://www.facebook.com/xavierbyuthaijewelry/).\n\nWe also had lunch here at the Food Court on the Ground Floor. I had Thai Beef Noodle soup (Guay Tiew Nuea Nam Sai) and it was delicious. Aileen decided to order the crab omelette from Here Hai, a Michelins starred restaurant that as opened an outlet at the food court. It was delicious (I tried it), but it took nearly an hour for her to get the dish!\n\n![crab omelette](../gallery/day-09-bangkok/05_Crab_omelette.webp)\n\nI also bought some Kipling bags at the Paragon Department Store. They offered to do the tourist VAT processing for me even though I don't have my passport with me - all I needed to show as a photo of my passport with the details on it.","trip":"Thailand 2024 Part 2","place":"South East Asia","timezone":"Asia/Bangkok","location":"Siam Paragon","title":"Day 9: Morning in Bangkok","description":"A morning spent at various places ending with lunch at Siam Paragon.","date":"2024-11-20T05:00:00.000Z","image":{"src":"/thailand-2024-2/_astro/01_Nana_Station.QpvGusrg.webp","width":2560,"height":1707,"format":"webp"},"map":[13.745983317713028,100.53444461163275,17],"tags":["Bangkok","Ambassador Hotel","Boarding Pass","Siam Paragon","Xavier by Uthai Jewellery","lunch"]}]