[{"id":"thailand-2024.md","slug":"index.html","base":"/thailand-2024/","collection":"trip","body":"\nEver since the COVID-19 pandemic lockdown, a group of us have been dreaming that we will take an overseas trip together once international travel restrictions have been lifted and we enter the brave new world of post-COVID vacations. Our dream is finally realised in 2024 when we are able to plan a trip to Bangkok. We literally spent many days talking about where we would go and what activities we would participate in.\n\nWe quickly agreed some ground rules - we would focus on food, sightseeing and shopping (not necessarily in that order, but that would be my personal priorities). The opportunity came when we realised plane tickets to Bangkok were quite reasonable (not quite pre-COVID sale prices but okay) and we all quickly booked our flights. We then scoured around for properties to rent so that we can stay together as a group.\n\nWe decided initially to just visit Chieng Mai and Bangkok, but then we realised there were a lot of things to see in Chieng Rai and it would be rushed to do it as a day trip. We hired a private tour driver who planned an itinerary for us. Cat, who is half-Thai, took charge of planning our itinerary in Bangkok.\n\nI tried my best to lose weight before the trip, but unfortunately I completely failed in this endeavour so I boarded the plane feeling heavy.\n","trip":"Thailand 2024","place":"Thailand","timezone":"Asia/Bangkok","location":"Thailand","title":"Thailand 2024","description":"Girl's trip to Thailand, visiting Chieng Rai, Chieng Mai and Bangkok. We have been planning this ever since the COVID-19 pandemic lockdown so it has taken almost 2 years to fruition!","date":"2024-11-26T11:00:00.000Z","image":{"src":"/thailand-2024/_astro/trip.CgyoIZQu.jpeg","width":4485,"height":2990,"format":"jpg","fsPath":"/Users/christie/Repositories/thailand-2024/src/assets/trip.jpeg"},"tags":["Thailand","Bangkok","Chieng Mai","Chieng Rai"]},{"id":"day-01-flight.md","slug":"day-01-flight","base":"/thailand-2024/","collection":"post","body":"\n## Checkin\n\nMargaret and I took at taxi at 6:30am and arrived at Sydney Airport International Terminal. Fortunately, at this hour of the day, with nearly 3 hours before our flight, the queue at the checkin counter was quite short, plus we had already checked in online the day before so we just needed to drop our bags. The girl behind the counter was Indonesian and she was very helpful and checked our luggage all the way to Chieng Mai. She also assisted us with boarding the lane.\n\n## AMEX Lounge\n\nAfter checkin, we headed to the AMEX Lounge. Unfortunately this was located on the opposite end of the airport relative to our boarding gate, so it's a bit of a walk to the lounge. Luckily Margaret had two spare lounge passes with her AMEX Card so we were able to enjoy the facilities of the lounge. I had my usual breakfast of bacon, scrambled eggs, sausages, baked beans, potatoes and toast plus a cup of coffee.\n\n![AMEX Lounge](../../assets/day-01-flight/01_AMEX_Lounge.jpg)\n\n![AMEX Lounge](../../assets/day-01-flight/02_AMEX_Lounge.jpg)\n\n![AMEX Lounge](../../assets/day-01-flight/03_AMEX_Lounge.jpg)\n\nWhen it was to boarding we headed towards the gate. Along the way, I saw a Gentle Monster shop at the airport. I saw a similar shop at TRX in Kuala Lumpur recently so I knew they were famous for their gigantic sculptures. I posed in front a giant rotating face and Margaret took a photo just when the face was looking at me.\n\n![Gentle Monster](../../assets/day-01-flight/05_Gentle_Monster.jpg)\n\n## Boarding flight to Bangkok\n\nWe all met together as a group at the boarding gate for Thai Airways flight TG 476 to Bangkok. We were lucky in that some of us were in Group 2 boarding, which is the first group to board after the premium passengers, so we entered the plane early and had plenty of cabin luggage space to put our bags.\n\n![Plane](../../assets/day-01-flight/04_Plane.jpg)\n\n![Group](../../assets/day-01-flight/06_Group.jpg)\n\n![Plane](../../assets/day-01-flight/07_Plane.jpg)\n\nThe flight was uneventful and quite pleasant. I was pleasantly surprised that I received all my meals first as I had preordered the \"oriental vegetarian\" option for my meals. I watched two movies:\n\n- [Lovesick Ellie](https://www.dailymotion.com/video/x95s79u): Eriko Ichimura (Nanoka Hara) has an ordinary and unnoticed student life at her high school. Her only joy is to watch popular male student Akira Omi (Nanoka Hara) and imagine them being a couple. She writes down those thoughts on her social media account under the name of Lovesick Ellie. Akira Omi seems like a perfect guy, with good looks and gentle personality. One day, she witnesses Akira Omi spouting vulgar language and she realizes he is kind of like a two-faced person. Making things worse, her fantasy thoughts are discovered by him. He thinks that she is funny and he approaches her. [(AsianWiki)](https://asianwiki.com/Lovesick_Ellie)\n- [Indiana Jones and the Dial of Destiny](https://www.imdb.com/title/tt28194558/): The legendary hero, Indiana Jones, returns in the fifth installment of this beloved swashbuckling series of films. Finding himself in a new era, approaching retirement, Indy wrestles with fitting into a world that seems to have outgrown him. But as the tentacles of an all-too-familiar evil return in the form of an old rival, Indy must don his hat and pick up his whip once more to make sure an ancient and powerful artifact doesn't fall into the wrong hands.\n\n## Bangkok stopover\n\nWe arrived in Suvarnabhumi Airport, Bangkok, in the afternoon and cleared customs. Since we had around three hours before the next flight to Chieng Mai, we wandered around the transit area and decided to have an early dinner at Thai Street Food. I had the tom yum noodle for 231 baht (around A$11) - it was delicious and surprisingly quite filling. The others had Thai chicken rice and BBQ Portk and wantan dry noodles.\n\n![Group](../../assets/day-01-flight/11_Group.jpg)\n\n![Tom yum noodle](../../assets/day-01-flight/12_Tom_yum_noodle.jpg)\n\n![Thai chicken rice](../../assets/day-01-flight/13_Chicken_rice.jpg)\n\n![BBQ pork wantan noodle](../../assets/day-01-flight/14_BBQ_pork_wantan_noodle.jpg)\n\n## Flight to Chieng Mai\n\nWe boarded TG 120 which departed just after 7pm and arrived about one hour later to Chieng Mai. We had no problems disembarking and claiming our baggage. The airport had quite a few lanterns and sculptures celebrating the upcoming festival.\n\n![Chieng Mai airport](../../assets/day-01-flight/21_Chiengmai.jpg)\n\n![Chieng Mai airport](../../assets/day-01-flight/22_Chiengmai.jpg)\n\nWe arrived at the AirBNB accommodation. I must admit, I was really tired (it is well over midnight Sydney time) and I quickly unpacked, showered and crashed out so no pictures.\n","trip":"Thailand 2024","place":"Thailand","timezone":"Asia/Bangkok","location":"Chieng Mai","title":"Day 1: Flight to Chieng Mai","description":"We had a pleasant checkin experience, had breakfast at the AMEX lounge, before boarding a flight to Bangkok. We stopped for 3 hours in Bangkok which was enough time, before boarding a flight to Chieng Mai. We arrived safely and checked into an AirBNB house for our stay here.","date":"2024-05-01T00:00:00.000Z","image":{"src":"/thailand-2024/_astro/07_Plane.urqz8QjX.jpg","width":5472,"height":3648,"format":"jpg","fsPath":"/Users/christie/Repositories/thailand-2024/src/assets/day-01-flight/07_Plane.jpg"},"map":[18.803227,98.970455,17],"tags":["Sydney Airport","AMEX Lounge","breakfast","Bangkok","dinner","Chieng Mai"]}]