[{"id":"yulefest-2022.md","slug":"index.html","base":"/undefined/","collection":"trip","body":"\nA short holiday with friends celebrating YuleFest in the Blue Montains, followed by a stay at [The Homestead at Dryridge Estate](https://www.dryridge.com.au/pages/homestead). Featuring wine tasting, a walk along the [Six Foot Track](https://www.nationalparks.nsw.gov.au/things-to-do/walking-tracks/six-foot-track), and some great food and campfires.\n\n| Day | Date          | Itinerary                                |\n| --: | :------------ | :--------------------------------------- |\n|   0 | Sat 30 July   | YuleFest Gala Dinner at Carrington Hotel |\n|   1 | Sun 31 July   | Katoomba, Megalong Valley wine tasting   |\n|   2 | Mon 01 August | Megalong Valley Six Foot Track           |\n|   3 | Tue 02 August | Megalong Valley Tea Rooms                |\n","trip":"YuleFest 2022","place":"Australia","timezone":"Australia/NSW","location":"Blue Mountains","title":"YuleFest 2022","description":"We celebrated Christmas in July at the Carrington Hotel, and then stayed for a couple of nights at Megalong Valley with some friends.","date":"2022-08-02T06:00:00.000Z","image":{"src":"/undefined/_astro/trip.hoiw_QIK.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/yulefest-2022/src/assets/trip.jpeg"},"tags":["YuleFest","Carrington Hotel","Katoomba","Megalong Valley"]},{"id":"1-katoomba.md","slug":"1-katoomba","base":"/undefined/","collection":"post","body":"\nWe booked a cottage in Katoomba called MayView via [AirBnB](https://www.airbnb.com.au/rooms/33054166) to stay in. It was small, with 3 bedrooms, and quite quaint. We arrived just after lunch and a few drinks at the [Carrington Hotel](https://thecarrington.com.au/).\n","trip":"YuleFest 2022","place":"Australia","timezone":"Australia/NSW","location":"Katoomba","title":"Day 1: Katoomba","description":"Cottage in Katoomba for one night","date":"2022-07-30T04:00:00.000Z","image":{"src":"/undefined/_astro/286 Katoomba.m7osS-Ea.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/yulefest-2022/src/assets/gallery/1-katoomba/286 Katoomba.jpeg"},"map":[-33.72555,150.3084,18],"tags":["Katoomba","MayView"]},{"id":"1-yulefest.md","slug":"1-yulefest","base":"/undefined/","collection":"post","body":"\nThe historic [Carrington Hotel](https://thecarrington.com.au/) (opened in 1883) hosts a set of Yulefest Gala Dinners over the winter months in July and August. These include\n\n- Pre Dinner Drinks & Winter Canapes\n- Traditional 5 Course Yulefest Dinner\n\nIn addition, we are entertained by carollers, pipe band, a Santa etc.\n\nIt was a fun night and festive occasion, and we really enjoyed ourselves.\n","trip":"YuleFest 2022","place":"Australia","timezone":"Australia/NSW","location":"Carrington Hotel","title":"Day 1: YuleFest","description":"Winter in the Blue Mountains is not complete without a traditional Christmas in July celebration.","date":"2022-07-30T11:00:00.000Z","image":{"src":"/undefined/_astro/Lyn_ Chris_ Ally_ Dagmar_ Julia_ Jamie_ Julie.B86X_7Pq.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/yulefest-2022/src/assets/gallery/1-yulefest/Lyn, Chris, Ally, Dagmar, Julia, Jamie, Julie.jpeg"},"map":[-33.71305,150.31061,18],"tags":["Katoomba","Carrington","YuleFest"]},{"id":"2-dryridge-estate.md","slug":"2-dryridge-estate","base":"/undefined/","collection":"post","body":"\nNestled in the beautiful Megalong Valley, surrounded by towering sandstone escarpments, [Dryridge Estate](https://www.dryridge.com.au/) is a stunning boutique vineyard 20 minutes by car from Blackheath, the nearest Blue Mountains township.\n\nWe enjoyed delicious wines, cheese platters and some of the best scenery in the Blue Mountains. The selection included cheeses, cold meats, delicious accompaniments like pickles, olives and sundried tomatoes. Served with fresh locally made bread, grissini and flat bread.\n\nThe view from the Cellar Door is spectacular. The Narrow Neck escarpment looms up from the valley floor and in the afternoon the sandstone cliffs are transformed by beautiful bright orange and yellow colours as the sun drops lower over the Great Dividing Range to the west.\n","trip":"YuleFest 2022","place":"Australia","timezone":"Australia/NSW","location":"Dryridge Estate","title":"Day 2: Wine tasting at Dryridge Estate","description":"We had breakfast at Katoomba, then drove down to Megalong Valley and reached Dryridge Estate just in time for wine tasting.","date":"2022-07-31T02:00:00.000Z","image":{"src":"/undefined/_astro/Dryridge Estate (1).B3Mnjgc7.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/yulefest-2022/src/assets/gallery/2-dryridge-estate/Dryridge Estate (1).jpeg"},"map":[-33.73575,150.21829,17],"tags":["Megalong Valley","Dryridge","winery"]},{"id":"2-echo-point.md","slug":"2-echo-point","base":"/undefined/","collection":"post","body":"\nWe woke up the next morning and took a walk from our Airbnb to Echo Point, where we were greeted with the spectacular Jamison Valley covered in a blanket of mist.\n\nEcho Point lookout is located on the boundary of Blue Mountains National Park.\n\nPart of the Greater Blue Mountains Area World Heritage Property, the Three Sisters is an iconic formation and there are different versions of the Aboriginal story of the Three Sisters.\n\nStanding proudly in the land of the Gundungurra and Darug People, the traditional custodians of this declared Aboriginal Place, the imposing Three Sisters is best seen from Echo Point lookout, just outside the national park, on the edge of the plateau above. These three weathered sandstone peaks, formed thousands of years ago through erosion, are set among the cliffs of the Jamison Valley. From the lookout, we can also see the Ruined Castle and Mount Solitary.\n","trip":"YuleFest 2022","place":"Australia","timezone":"Australia/NSW","location":"Echo Point","title":"Day 2: Echo Point in the morning","description":"We woke up early in the morning to take a quick walk around Echo Point.","date":"2022-07-30T22:00:00.000Z","image":{"src":"/undefined/_astro/Echo Point (1).D5HlA95Z.jpeg","width":2560,"height":1920,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/yulefest-2022/src/assets/gallery/2-echo-point/Echo Point (1).jpeg"},"map":[-33.7322,150.3122,16],"tags":["Katoomba","Echo Point","morning"]},{"id":"2-homestead.md","slug":"2-homestead","base":"/undefined/","collection":"post","body":"\nWe booked both the [Homestead](https://www.dryridge.com.au/pages/homestead) and the [Sunrise Lodge](https://www.dryridge.com.au/pages/sunriselodge).\n\nThe Homestead is set on top of a ridge overlooking the vineyard. The Estate enjoys spectacular views of the Blue Mountains sandstone escarpment that is transformed into bright orange and pink colours at sunset.\n\nThere is a large living room area with open fireplace, designer couch with big country dining room table. The residence also has a beautiful fully equipped gourmet kitchen with stainless steel gas cook top. The kitchen opens to a big balcony that directly overlooks the vineyard.\n\nThe Sunrise Lodge is nNestled on the edge of our boutique vineyard with magnificent escarpment views across the Megalong Valley. Purpose designed, the lodge comprises two large bedrooms each with an en-suite bathroom, spacious central living area with open fire and a fully-equipped kitchen and large deck.\n","trip":"YuleFest 2022","place":"Australia","timezone":"Australia/NSW","location":"Dryridge Estate","title":"Day 2: The Homestead at Dryridge Estate","description":"After the wine tasting sessions, we were ready to check into our accommodation.","date":"2022-07-31T06:00:00.000Z","image":{"src":"/undefined/_astro/Dryridge Estate (1).DrOqCN4o.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/yulefest-2022/src/assets/gallery/2-homestead/Dryridge Estate (1).jpeg"},"map":[-33.73575,150.21829,17],"tags":["Megalong Valley","Dryridge","Homestead"]},{"id":"2-megalong-creek.md","slug":"2-megalong-creek","base":"/undefined/","collection":"post","body":"\n[Megalong Creek Estate Vineyard](https://www.megalongcreekestate.com/) was established in 2002. This family farm run boutique vineyard is situated in the beautiful Megalong Valley, Blue Mountains. The grapes are grown here and then hand picked and transported to Mudgee for wine making. The Wine maker is the award winning and highly regarded third generation wine maker - Jacob Stein of Robert Steins wines. The wines are 'Single Vineyard' and include Viognier, Pinot Grigio, Pinot and Shiraz. They planted Pinot, Grenache and Mourvedre in 2018. Their range of wines from the varieties grown on the property also include a Sparkling which we have named 'Prozzante', this is a lightly sparked Prosecco style wine. They also have a Late Harvest unique Dessert style wine.\n\nThe current temporary cellar door is a unique, re-purposed shipping container and barn with a purpose built tasting bar and beautiful views of the Majestic Megalong. It has beautiful valley views, alpacas grazing in the foreground and a towering sandstone escarpment backdrop! In early 2023 they hope to commence building a new cellar door.\n","trip":"YuleFest 2022","place":"Australia","timezone":"Australia/NSW","location":"Megalong Creek Estate","title":"Day 2: Wine tasting at Megalong Creek Estate","description":"After Dryridge, we walked to Megalong Creek Estate and had a second wine tasting there.","date":"2022-07-31T04:00:00.000Z","image":{"src":"/undefined/_astro/Megaslong Creek Estate (1).D7NhoBWt.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/yulefest-2022/src/assets/gallery/2-megalong-creek/Megaslong Creek Estate (1).jpeg"},"map":[-33.7399,150.2182,17],"tags":["Megalong Valley","Megalong Creek","winery"]},{"id":"2-mulled-wine.md","slug":"2-mulled-wine","base":"/undefined/","collection":"post","body":"\nWe had mulled wine next to the fire whilst watching the sun set. After that we went back to the house and made burgers for dinner.\n","trip":"YuleFest 2022","place":"Australia","timezone":"Australia/NSW","location":"Dryridge Estate","title":"Day 2: Mulled wine at sunset","description":"We managed to get the fire going, and drank mulled wine whilst watching the sun set.","date":"2022-07-31T08:00:00.000Z","image":{"src":"/undefined/_astro/Mulled wine (1).BVPkkf84.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/yulefest-2022/src/assets/gallery/2-mulled-wine/Mulled wine (1).jpeg"},"map":[-33.73575,150.21829,17],"tags":["Megalong Valley","Dryridge","sunset","wine"]},{"id":"3-breakfast.md","slug":"3-breakfast","base":"/undefined/","collection":"post","body":"\nWe cooked and ate a big breakfast including sausages, bacon, tomatoes, scrambled eggs and toast.\n","trip":"YuleFest 2022","place":"Australia","timezone":"Australia/NSW","location":"Dryridge Estate","title":"Day 3: Breakfast","description":"We woke up, surprisingly hungry, cooked and ate a big breakfast with the works.","date":"2022-07-31T22:00:00.000Z","image":{"src":"/undefined/_astro/Breakfast (1).Dm7-TXvF.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/yulefest-2022/src/assets/gallery/3-breakfast/Breakfast (1).jpeg"},"map":[-33.73575,150.21829,17],"tags":["Megalong Valley","Dryridge","breakfast"]},{"id":"3-dinner.md","slug":"3-dinner","base":"/undefined/","collection":"post","body":"\nIvan and Dagmar prepared a delicious Italian dinner of smoked trout, a cheese and meat platter, followed by duck ragu and saffron and truffle risotto. We all dressed in Christmas outfits. I wore my Christmas coloured cheongsam.\n\nAfter dinner, we had drinks and exchanged Kris Kringles. All in all it was a fun night and a great end to this short trip.\n","trip":"YuleFest 2022","place":"Australia","timezone":"Australia/NSW","location":"Dryridge Estate","title":"Day 3: Dinner","description":"We had an Italian dinner of duck ragu plus saffron and truffle risotto.","date":"2022-08-01T11:00:00.000Z","image":{"src":"/undefined/_astro/Xmas Dinner (2).CBdYxzxN.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/yulefest-2022/src/assets/gallery/3-dinner/Xmas Dinner (2).jpeg"},"map":[-33.73575,150.21829,17],"tags":["Megalong Valley","Dryridge","dinner"]},{"id":"3-six-foot-track.md","slug":"3-six-foot-track","base":"/undefined/","collection":"post","body":"\nAfter breakfast, we decided to walk part of the Six Foot Tracks that passes through Dryridge Estate.\n\nThe Megalong Valley is very old, its bedrock first laid down 450 million years ago. Then about 250 million years ago the area that we now know as the Blue Mountains and the Sydney Basin were inundated by the sea which deposited a deep layer of sand. Over many more millions of years this sand hardened into the sandstone. At the beginning of the Triassic period 200 million years ago when dinosaurs roamed Australia, upward teutonic forces created the sandstone plateau that is the basic mountains landform today. This uplift caused rivers to run more vigorously, eroding the relatively soft sandstone to create the vast network of canyons and gorges - one of which is the Megalong Valley.\n\nFinally, around 17 million years ago, molten igneous rock vented into the valley laying down the granite from which Dryridge vineyard soils are derived and which can be seen today in the form of large spherical boulders.\n\nAs part of the Gundungurra First Nation territory, the Megalong Valley is profoundly important to Aboriginal people and rich in their heritage. Megalong is thought to have meant ‘Valley Under the Rock’. For over 20,000 years it was an important indigenous pathway linking southern parts with the Hunter Valley; and sections of the Six Foot Track also formed an ancient route to the western tablelands.\n\nFollowing European discovery and the way west through the Blue Mountains, a few hardy families settled in the valley from 1838 grazing cattle and pursuing other agriculture. Timber getting began shortly after. There was significant mining of kerosene shale on the eastern escarpment later still. The first shale mine opened in 1870 and the Megalong township of 200 was quickly established - its ruins can still be seen along the Six Foot Track towards Katoomba, a short and pleasant walk from the estate. The last of the mining was in the first few years of the 20th Century.\n\nThe [Six Foot Track](https://www.nationalparks.nsw.gov.au/things-to-do/walking-tracks/six-foot-track) traverses Dryridge Estate and is one of Australia’s finest scenic walks. It was built in 1887 to provide better access between Katoomba, the principal town in the Blue Mountains, and the Jenolan Caves located in the Great Dividing Range west of the Megalong Valley.\n\nThe Jenolan Caves are regarded as the oldest, best decorated and most complex in the world. They were first discovered by European settlers in 1838 and became a major 19th Century tourist attraction despite the difficult journey by horse and buggy across rugged terrain from Tarana, then the closest railway station. Recently-installed internal lighting further highlights the caves visual majesty.\n\nThe construction brief for the track provided for a passage six feet wide, so that two laden horses could pass each other -and the brief lives on as its name today. The 45 kilometre track starts at the Explorers’ Tree on the Great Western Highway three kilometres west of Katoomba; travels down Nellie's Glen to Megalong Road, past the Megalong Cemetery and across Dryridge Estate to the Cox's River Camping Ground and then onwards to the caves.\n\nThree days are recommended for the complete walk when camping along the route. We did an abridged version of the walk, from Dryridge Estate to Bowtell's Swing Bridge, and back again.\n\nThe walk is quite hilly in parts. Bowtell's Bridge really felt like something out of Indiana Jones. I channelled my inner Short Round and crossed the bridge safely. The walk took a lot longer than we expected, and we were exhausted and had to recuperate by drinking Chandon Garden Spritz.\n","trip":"YuleFest 2022","place":"Australia","timezone":"Australia/NSW","location":"Six Foot Track","title":"Day 3: Six Foot Track","description":"We walked the Six Foot Track from Dryridge Estate to Bowtell's Swing Bridge.","date":"2022-08-01T02:00:00.000Z","image":{"src":"/undefined/_astro/Bowtells Bridge (3).DisdWIab.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/yulefest-2022/src/assets/gallery/3-six-foot-track/Bowtells Bridge (3).jpeg"},"map":[-33.73398,150.21632,17],"tags":["Megalong Valley","Six Foot Track","walk"]},{"id":"3-sunset-campfire.md","slug":"3-sunset-campfire","base":"/undefined/","collection":"post","body":"\nAnother beautiful day ends with a fiery sunset as we prepared and ate blinis and ate them with marshmallows by the fire.\n","trip":"YuleFest 2022","place":"Australia","timezone":"Australia/NSW","location":"Dryridge Estate","title":"Day 3: Sunset Campfire","description":"When the evening came, we lit up the fire again and had blinis and marshmallow.","date":"2022-08-01T08:00:00.000Z","image":{"src":"/undefined/_astro/Sunset campfire (4).r_WGjwoS.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/yulefest-2022/src/assets/gallery/3-sunset-campfire/Sunset campfire (4).jpeg"},"map":[-33.73575,150.21829,17],"tags":["Megalong Valley","Dryridge","campfire","sunset"]},{"id":"4-breakfast.md","slug":"4-breakfast","base":"/undefined/","collection":"post","body":"\nEstablished in 1956, the Megalong Valley Tea Rooms have proudly served up scones and apple pie to generations of Blue Mountains residents and guests.\n\nThey also offer all-day breakfast and lunch with seasonal specials. We stopped by here on the way back to have a late breakfast, before we drove back to Sydney.\n","trip":"YuleFest 2022","place":"Australia","timezone":"Australia/NSW","location":"Megalong Valley Tearooms","title":"Day 4: Breakfast","description":"We had a delicious breakfast and scones at the Megalong Valley Tearooms.","date":"2022-08-02T23:00:00.000Z","image":{"src":"/undefined/_astro/Breakfast at Megalong Valley Tearooms.qeYTcOS-.jpeg","width":2560,"height":1707,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/yulefest-2022/src/assets/gallery/4-breakfast/Breakfast at Megalong Valley Tearooms.jpeg"},"map":[-33.69587,150.25302,19],"tags":["Megalong Valley","Megalong Valley Tearooms","breakfast"]},{"id":"4-sunrise.md","slug":"4-sunrise","base":"/undefined/","collection":"post","body":"\nThe early morning mist rolling across the valley and vineyard made for a delightful landscape. The sun illuminated the morning frost and made the whole valley glisten.\n\nWe cleaned the kitchen and packed the remaining food in preparation for checking out and leaving the property.\n","trip":"YuleFest 2022","place":"Australia","timezone":"Australia/NSW","location":"Dryridge Estate","title":"Day 4: Sunrise","description":"Woke up early to do some yoga and was greeted with a beautiful sunrise over the escarpment.","date":"2022-08-02T21:00:00.000Z","image":{"src":"/undefined/_astro/Sunrise (1).CVvBTuPx.jpeg","width":2560,"height":1709,"format":"jpg","orientation":1,"fsPath":"/Volumes/Dev/Repositories/travelens/yulefest-2022/src/assets/gallery/4-sunrise/Sunrise (1).jpeg"},"map":[-33.73575,150.21829,17],"tags":["Megalong Valley","Dryridge","sunrise"]}]